### Important &nbsp;&nbsp;Links

<br>

<div style="background-color: yellow;">
    
https://pandas.pydata.org/docs/

https://www.youtube.com/watch?v=gtjxAH8uaP0   (Frecodingtutorial - Best for practice)

https://www.geeksforgeeks.org/pandas-tutorial/?ref=outindfooter

https://www.geeksforgeeks.org/how-to-learn-pandas/#saving-data

https://www.learndatasci.com/tutorials/python-pandas-tutorial-complete-introduction-for-beginners/

https://medium.com/analytics-vidhya/pandas-complete-guide-a-z-36ba8bd15232

</div>



<br><br>


- https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-1-d693ac55-6455-40cf-ae34-867c6a02014e/notebook/6449493c84734151b11f4b6871f045d2#99f75bf946d04b9bb1daa9e14c2cfea9


- https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-dataset-7e3b6755-5d4b-464b-9b75-9c84667ae3bd/notebook/notebook-0de50f3b70834570b13b651dde44c491

- https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-part-2-adc5a3ee-5f61-4725-8e46-ccb07899acfc/notebook/notebook-78e3faf901da4f14881ef24e41c80bf6

- https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-after-employee-f84e02a1-fb6a-428e-af90-8dd99855749a/notebook/notebook-134ac20c38ef45e5a4432abd638e6c2e

<br>

<span style="color: red;">-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<br>

- https://www.youtube.com/watch?v=Gx5qb1uHss4


- https://freedium.cfd/https://blog.stackademic.com/excel-sql-and-python-conditional-statements-24198bb5736f  &nbsp;&nbsp;<code style="background-color: yellow;">Python SQL PANDAS NUMPY conditional statements</code>

- https://kawsar34.medium.com/learn-pandas-in-15-questions-from-leetcode-c8d0d10c2f0a     &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>

- https://kawsar34.medium.com/leetcode-hard-pandas-part-1-6bc739562552    &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>  <br>
  https://kawsar34.medium.com/leetcode-30-days-of-pandas-part-1-of-3-6a63f59a8b47   <br>
  https://kawsar34.medium.com/leetcode-30-days-of-pandas-part-2-of-3-721fa4bb5191   <br>
  https://kawsar34.medium.com/leetcode-30-days-of-pandas-part-3-of-3-3db3f3a41e5f   <br>
  https://medium.com/foundational-data-science-interview-questions/q-73-categorizing-foods-15d78ef7d525   <br>
  https://medium.com/foundational-data-science-interview-questions/q-61-average-lifetime-value-of-a-customer-670cad0b2206
  



- https://freedium.cfd/https://medium.com/@thedatabeast/python-uncommon-things-with-pandas-part-2-b6c4eebdb8ab &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code> <br>
  https://pythongeeks.org/pandas-interview-questions/               <br>
  https://www.geeksforgeeks.org/pandas-interview-questions/         <br>



- https://www.upgrad.com/blog/pandas-interview-questions-answers-for-freshers-experienced/     &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code> <br>

  https://medium.com/foundational-data-science-interview-questions/q-85-retail-revenue-trends-69a3b6bcfef8   <br>
  https://medium.com/foundational-data-science-interview-questions/q-84-user-messaging-29dcc336a0a0


- https://medium.com/foundational-data-science-interview-questions/q-61-average-lifetime-value-of-a-customer-670cad0b2206 &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code> <br>

- https://medium.com/foundational-data-science-interview-questions/q-88-filtering-strings-in-pandas-dataframes-aaac588396fa &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>

- https://medium.com/@sandeepmaths04/16-pandas-interview-questions-to-test-your-data-wrangling-skills-53387d72f9b2   &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>

- https://medium.com/@susovan_30602/top-20-python-pandas-interview-questions-and-expert-answers-d05c85897a71    &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>

- https://medium.com/@data_analyst/python-most-important-interview-questions-4f71783a17a1

- https://freedium.cfd/https://medium.com/@roiyeho/master-level-questions-in-pandas-1fdfc74a19a5   &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>   <br>
  https://freedium.cfd/https://medium.com/@roiyeho/solutions-to-master-level-questions-in-pandas-62c6efe57473

- https://medium.com/@khushbooalvi9/pandas-interview-questions-e7c4bc8cacfe  &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>

- https://adityadaria.medium.com/pandas-interview-questions-for-data-science-dd47787708ff    &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>

- https://freedium.cfd/https://medium.com/@kevinmenesesgonzalez/mastering-11-advanced-pandas-puzzles-to-ace-data-science-interview-questions-5aa44bf22496     &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>

- https://www.geeksforgeeks.org/pandas-interview-questions/    &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>   <br>
  https://www.datacamp.com/blog/top-python-pandas-interview-questions-and-answers

  https://pythongeeks.org/pandas-interview-questions/


- https://intellipaat.com/blog/interview-question/pandas-interview-questions/    &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code> 




- https://towardsdatascience.com/python-pandas-interview-questions-for-data-science-377dfac4a7a1   &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>


- https://www.datacamp.com/blog/top-python-pandas-interview-questions-and-answers     &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>

- https://medium.com/@sujathamudadla1213/interview-questions-on-pandas-series-df8a1c83ff93    &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>


- https://www.javatpoint.com/python-pandas-interview-questions     &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>



- https://www.interviewbit.com/pandas-interview-questions/      &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>


- https://mrmaheshrajput.medium.com/superchargd-analytics-with-pandasai-and-chatgpt-238e13ca1b9f   &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>   <br>
  https://python.plainenglish.io/most-asked-interview-questions-on-pandas-33af613f1ce9


- https://medium.com/@upGrad/10-most-important-pandas-interview-questions-answers-4a81d92cfda2     &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>


- https://www.mlstack.cafe/blog/pandas-python-interview-questions    &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>


- https://ravi-chan.medium.com/beginners-guide-to-regex-in-pandas-308b79e477e6    &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>

- https://python.plainenglish.io/top-3-frequently-asked-pandas-analyst-interview-questions-you-should-practice-e02114a80afe     &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>

- https://pravash-techie.medium.com/python-libraries-you-should-use-part-2-d8543eb0fc20  &nbsp;&nbsp;<strong>(use it for beautifying notebook)</strong>  <br>
  https://pravash-techie.medium.com/python-libraries-you-should-use-part-1-a68d38d23837  <br>
  https://freedium.cfd/https://medium.com/pythoneers/debugging-in-python-replace-print-with-ic-and-do-it-like-a-pro-18f330c863cb

- https://pravash-techie.medium.com/python-sched-for-automating-tasks-in-python-396618864658

- https://pravash-techie.medium.com/python-hidden-features-part-1-3d9817a0385e

-  https://medium.com/@stackerrors/example-story-6bd721732204      &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>

- https://medium.com/foundational-data-science-interview-questions/q-62-normalizing-student-grades-with-pandas-ba0930163c63   &nbsp;&nbsp;<code style="background-color: yellow;">PANDAS </code>  <br>

  https://medium.com/foundational-data-science-interview-questions/q-49-replacing-bad-data-with-pandas-9cdeb9736067

- https://medium.com/codewithcorgis/ranking-hosts-by-beds-airbnb-data-interview-question-for-hospitable-data-scientist-%EF%B8%8F-%EF%B8%8F-d050189743a2 &nbsp;&nbsp;&nbsp;&nbsp;<code style="background-color: yellow;">PANDAS</code> &nbsp;&nbsp;<code style="background-color: red; color: white">SQL </code>  <br> <br>





- https://freedium.cfd/https://tracyrenee61.medium.com/a-review-of-10-pandas-interview-questions-1d650b18943b  &nbsp;&nbsp;<codE style="background-color: yellow;">PANDAS<code>

- https://medium.com/foundational-data-science-interview-questions/q-48-retail-revenue-trends-f6a60242ccc7   &nbsp;&nbsp;<codE style="background-color: yellow;">PANDAS<code>

- https://freedium.cfd/https://medium.com/@poojatripathi0697/microsoft-software-engineer-2-data-interview-experience-r1-r2-86fd33241412  &nbsp;&nbsp;<strong>(Python Questions)</strong>

- https://pravash-techie.medium.com/python-interesting-facts-about-dictionaries-cd916635e3e0  &nbsp;&nbsp;<strong>(Python Questions)</strong>


- https://pravash-techie.medium.com/python-hidden-features-part-2-7d59bbef57ae &nbsp;&nbsp;<strong>(Python Questions)</strong>   <br>
  https://freedium.cfd/https://towardsdatascience.com/10-most-frequently-asked-python-dictionary-questions-on-stack-overflow-2cb345f07496

- https://freedium.cfd/https://python.plainenglish.io/10-most-frequent-python-data-types-that-are-commonly-used-in-data-engineering-tasks-d1d2af54ec55  &nbsp;&nbsp;<strong>(Python Questions)</strong>

- https://freedium.cfd/https://python.plainenglish.io/6-effective-string-concatenation-techniques-in-python-fd2a407b7f79 &nbsp;&nbsp;<strong>(Python Questions)</strong>


- https://rameshponnusamy.medium.com/python-basic-interview-questions-594964a7c15e   &nbsp;&nbsp;<strong>(Python Questions)</strong>

- https://pravash-techie.medium.com/python-mastering-data-composition-with-chainmap-6c3ced04dc6a   &nbsp;&nbsp;<strong>(Python Important Questions)</strong>

- https://freedium.cfd/https://python.plainenglish.io/python-going-beyond-the-basics-with-pandas-advanced-data-engineering-e23c40ca28c9  &nbsp;&nbsp;<strong>(PANDAS)</strong>

- https://python.plainenglish.io/python-for-data-engineering-handling-missing-data-in-pandas-dataframe-84a9038ef628  &nbsp;&nbsp;<strong>(PANDAS)</strong>

- https://freedium.cfd/https://python.plainenglish.io/why-i-stopped-using-python-list-comprehensions-and-what-i-use-instead-56361fec5628  &nbsp;;<code style="color: blue;">Python</code>

- https://pravash-techie.medium.com/python-simplify-your-data-cleaning-with-pyjanitor-79176e9ee586  &nbsp;&nbsp;(API on top on PANADAS)

- https://freedium.cfd/https://python.plainenglish.io/optimizing-pandas-dataframe-processing-chunking-for-speed-and-memory-efficiency-68a4c696ac4a  &nbsp;&nbsp;<strong>(PANDAS)</strong>

- https://freedium.cfd/https://python.plainenglish.io/must-know-python-interview-questions-for-data-analysis-roles-c977cb81c273  &nbsp;&nbsp;<strong>(PYTHON)</strong>

- https://freedium.cfd/https://python.plainenglish.io/how-to-handle-missing-data-in-pandas-a-practical-guide-82625308c874  &nbsp;&nbsp;<strong>(PANDAS)</strong>

- https://freedium.cfd/https://blog.stackademic.com/python-coding-questions-for-data-engineer-interview-part-i-easy-lev-d52c3c6e01e6  &nbsp;&nbsp;<strong>(Python Questions)</strong>
 https://freedium.cfd/https://medium.com/illuminations-mirror/python-coding-questions-for-data-engineer-interview-part-ii-easy-level-b45682509e0b





- https://towardsdatascience.com/simplifying-the-python-code-for-data-engineering-projects-95f0c41dc58a   &nbsp;&nbsp;<strong>(Python Questions)</strong>

- https://medium.com/itversity/quick-recap-of-python-collections-for-data-processing-718913410e5b   &nbsp;&nbsp;<strong>(Python Questions)</strong>

- https://freedium.cfd/https://python.plainenglish.io/difference-between-a-list-a-tuple-and-a-dictionary-in-python-9a8d76fbdd4e  &nbsp;&nbsp;<strong>(Python Questions)</strong>

- https://freedium.cfd/https://blog.varunsingh.in/top-10-python-interview-questions-and-answers-2cb4153cd072   &nbsp;&nbsp;<strong>(Python Questions)</strong>

- https://pravash-techie.medium.com/python-context-manager-to-simplify-resource-handling-5959a36a0f58 &nbsp;&nbsp;<code>Python</code>

- https://freedium.cfd/https://python.plainenglish.io/we-data-engineers-do-data-combining-guide-to-merging-data-in-python-17da86fb66f7  &nbsp;&nbsp;<strong>(Python Questions)</strong>

- https://freedium.cfd/https://python.plainenglish.io/from-pandas-to-pyspark-scaling-your-data-analysis-workflows-made-easy-54f4230ef20f 

- https://freedium.cfd/https://python.plainenglish.io/15-advanced-python-shortcuts-every-developer-should-use-for-faster-coding-8bc56031b835  &nbsp;&nbsp;<span style="color: red;">(Python tricks - Important)</span>

- https://freedium.cfd/https://python.plainenglish.io/coding-problems-every-data-engineer-should-know-lessons-from-multiple-interviews-faa1ceffc5b5 &nbsp;&nbsp;<strong>(Python Interview Questions)</strong>

- https://freedium.cfd/https://python.plainenglish.io/top-string-manipulation-interview-questions-for-data-engineer-roles-with-comprehensive-solutions-13845eb5971b  &nbsp;&nbsp;<strong>(Python Interview Questions)</strong>

- https://freedium.cfd/https://blog.stackademic.com/20-python-scripts-that-will-give-you-superpowers-4c6f4b15fe63

- https://freedium.cfd/https://premvishnoi.medium.com/agoda-data-engineer-first-round-interview-experience-01c993ea2b0a  &nbsp;&nbsp;<strong>(Python Interview Questions)</strong>

- https://freedium.cfd/https://python.plainenglish.io/top-string-manipulation-interview-questions-for-data-engineer-roles-with-comprehensive-solutions-13845eb5971b  &nbsp;&nbsp;<strong>(Python Interview Questions)</strong>

- https://freedium.cfd/https://medium.com/towards-data-engineering/array-problems-you-cant-miss-for-data-engineering-interviews-part-1-75b34b2c4e34  &nbsp;&nbsp;<strong>(Python Interview Questions)</strong>

- https://freedium.cfd/p/01c993ea2b0a  &nbsp;&nbsp;<strong>(Python Interview Questions)</strong>

- https://freedium.cfd/https://ai.gopubby.com/top-10-pandas-interview-questions-you-should-be-ready-to-answer-2c72ff7acb54

  <div style="margin-left: 25px; color: red;">
  - What technique is better: <strong>mean</strong> vs. <strong>median</strong> vs. <strong>mode</strong>?   <br>
  - What is the role of the <code>groupby()</code> function?                                                 <br>
  - Why do you use feature selection?                                                                        <br>
  - List out the data validation techniques.                                                                 <br>
  - Pick any product or app that you like and describe how you would improve it.                             <br>
  - How do you read the text in an image? Explain?
      
  </div> <br>

- https://freedium.cfd/https://medium.com/towards-data-science/how-to-handle-large-datasets-in-python-1f077a7e7ecf
- https://medium.com/@abhikshirsagar1999/interview-question-how-to-handle-api-which-contains-the-large-data-8a38a52933d8
- https://pravash-techie.medium.com/python-parallelism-vs-concurrency-vs-threading-d74a79065dc8
- https://freedium.cfd/https://medium.com/towards-data-engineering/an-introduction-in-great-expectations-with-python-4793a2609e4c  &nbsp;(Data Validation)
- https://freedium.cfd/https://towardsdev.com/great-expectations-in-data-quality-management-the-essential-handbook-for-data-guys-1541ecb715ec
- https://freedium.cfd/https://premvishnoi.medium.com/my-senior-data-engineer-interview-experience-at-smartnews-8ed43d14e0d4  &nbsp;&nbsp;<strong>(SQL + Python)</strong>

<br>

<div style="background-color: #f9e9ff; padding: 20px;">
    
How do you handle <strong>large data</strong> in context of <u>Python</u>, <u>Numpy</u>, <u>Pandas</u> & <u>Spark</u>? Ask in ChatGPT.

- One way is to use batch processing by dividing the data into chunks.    <br>
- Another way is to take care of the data types and file formats          <br>
- You can also go with Data Compression                                   <br>
- Indexing is yet another method                                          <br>
- Distributed Computing like Spark can also be used.                      <br>
- The concept of cache can also be invoked.                               <br>
- Instead of storing all the columns of the intermeditae records for the processing, you can give each record a unique id like primary key and store it for the reference. You don't have to store all the columns.

</div>

<br>

<br>

## <code style="background-color: black; color: white; padding: 10px;">Introduction to Pandas Data Structures</code>

PANDAS QUESTIONS WITH lambda, map, filter

https://leetcode.com/problemset/pandas/

In [1]:

import numpy as np
import pandas as pd

In [5]:

from pandas import Series, DataFrame

<br>

<span style="color: red; font-size: 1rem;">Introduction to <strong>pandas</strong> <u>Data Structures</u></span>

- Series
- Dataframes


### <div style="color: black; background-color: #ffe9c8; padding-top: 10px; padding-bottom: 10px; padding-right: 10px;"> <code style="font-size: 1.3rem; background-color: #ffe9c8; color: red;"><strong>Series</strong></code> &nbsp;(1D array)</div>


<span style="color: #a245ff;">Similar to <strong>Numpy vector</strong></span>

In [3]:

obj = pd.Series([4, 7, -5, 3])

obj

0    4
1    7
2   -5
3    3
dtype: int64


<br>

<code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">obj</span>.<span style="font-size: 1rem;"><strong>array</strong></span></code> &nbsp;&nbsp;&nbsp;&nbsp;&&nbsp;&nbsp;&nbsp;&nbsp; <code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">obj</span>.<span style="font-size: 1rem;"><strong>index</strong></span></code>

In [4]:

obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [5]:

obj.index

RangeIndex(start=0, stop=4, step=1)


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">If you want to create a Series with an index identifying each data point with a label :</span>

In [6]:

obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:

obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Compared with <strong>NumPy arrays</strong> , you can use labels in the index when selecting <strong>single values</strong> or a <strong>set of values</strong> :</span>

In [8]:

obj2["a"]

-5

In [9]:

obj2["d"] = 6

obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64


<span style="color: #a245ff;;">Here &nbsp;<code>["c", "a", "d"]</code>&nbsp; is interpreted as a list of indices, even though it contains strings instead of integers.</span> 

<br>

In [10]:

obj2

d    6
b    7
a   -5
c    3
dtype: int64


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<div style="display: flex;">
<div><span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span>&nbsp;&nbsp;&nbsp;</div>
<div><span style="color: #f76607;">Using <strong>NumPy functions</strong> or <strong>NumPy-like operations</strong>, such as &nbsp;<code style="background-color: #ffead5;">filtering with a Boolean array</code> , &nbsp;<code style="background-color: #ffead5;">scalar multiplication</code> , or &nbsp;<code style="background-color: #ffead5;">applying math functions</code> , will preserve the index-value link :</span></div>
</div>

In [11]:

obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [12]:

obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:

np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64


<span style="color: #a245ff;">For every array element &nbsp;<code>x</code> , it calculates &nbsp;<code> e<sup>x</sup> </code>&nbsp; where &nbsp;<code>e = 2.718</code> </span>


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<div style="display: flex;">
<div><span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span>&nbsp;&nbsp;&nbsp;</div>
<div><span style="color: #f76607;">Another way to think about <strong>a Series is as a fixed-length, ordered dictionary, as it is a mapping of index values to data values</strong>. &nbsp;It can be used in many contexts where you might use a <strong>dictionary</strong> :</span></div>
</div>

In [14]:

"b" in obj2

True

In [15]:

"e" in obj2

False

In [16]:

#sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
sdata = {"Delhi": 35000, "Mumbai": 71000, "Banglore": 16000, "Hyderabad": 5000}

obj3 = pd.Series(sdata)

obj3

Delhi        35000
Mumbai       71000
Banglore     16000
Hyderabad     5000
dtype: int64

In [43]:

pd.Series({'Alpha': 'A1', 'Beta': 'B1', 'Gamma': 'C1'})

Alpha    A1
Beta     B1
Gamma    C1
dtype: object

<br>

<code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">obj</span>.<span style="font-size: 1rem;"><strong>to_dict()</strong></span></code>

In [17]:

obj3.to_dict()

{'Delhi': 35000, 'Mumbai': 71000, 'Banglore': 16000, 'Hyderabad': 5000}

In [18]:

obj3.keys                                                                # <bound method Series.keys

<bound method Series.keys of Delhi        35000
Mumbai       71000
Banglore     16000
Hyderabad     5000
dtype: int64>

In [19]:

print(obj3.keys())                                                       # METHOD - 1

print(obj3.index)                                                        # METHOD - 2

Index(['Delhi', 'Mumbai', 'Banglore', 'Hyderabad'], dtype='object')
Index(['Delhi', 'Mumbai', 'Banglore', 'Hyderabad'], dtype='object')

In [20]:

obj3.values()

TypeError: 'numpy.ndarray' object is not callable

In [21]:

print(obj3.values)                                                       # METHOD - 1

print("\n")
print(obj3.array)                                                        # METHOD - 2

[35000 71000 16000  5000]


<PandasArray>
[35000, 71000, 16000, 5000]
Length: 4, dtype: int64

In [22]:

obj3.values == obj3.array

<PandasArray>
[True, True, True, True]
Length: 4, dtype: bool

<br>

<code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">obj</span>.<span style="font-size: 1rem;"><strong>keys()</strong></span></code> &nbsp;&nbsp;&nbsp;or&nbsp;&nbsp;&nbsp; <code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">obj</span>.<span style="font-size: 1rem;"><strong>index</strong></span></code> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;=======>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;returns the indexes of the Pandas array

<code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">obj</span>.<span style="font-size: 1rem;"><strong>values</strong></span></code> &nbsp;&nbsp;&nbsp;or&nbsp;&nbsp;&nbsp; <code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">obj</span>.<span style="font-size: 1rem;"><strong>array</strong></span></code> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;=======>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;returns the Pandas array


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;"><strong>Custom ordering</strong> of the dictionary keys when converted into a series</span>

In [23]:

sdata = {"Delhi": 35000, "Mumbai": 71000, "Banglore": 16000, "Hyderabad": 5000}
cities = ["Kolkata", "Delhi", "Banglore", "Mumbai"]

obj4 = pd.Series(sdata, index=cities)

obj4

Kolkata         NaN
Delhi       35000.0
Banglore    16000.0
Mumbai      71000.0
dtype: float64

<br>

<code style="background-color: #dfdfdf;">NaN</code> <span style="color: #a245ff;">&nbsp;&nbsp;========>&nbsp;&nbsp; (Not a Number)</span>


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">To detect <strong>missing data</strong> in Pandas &nbsp;&nbsp;======>&nbsp;&nbsp; <code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">pd</span>.<span style="font-size: 1rem;"><strong>isna(</strong><span style="color: #a245ff; font-size: 0.8rem;">obj</span><strong>)</strong></span></code> &nbsp;&nbsp;&nbsp;&&nbsp;&nbsp;&nbsp; <code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">pd</span>.<span style="font-size: 1rem;"><strong>notna(</strong><span style="color: #a245ff; font-size: 0.8rem;">obj</span><strong>)</strong></span></code> &nbsp;&nbsp;<strong>functions</strong></span>

In [24]:

pd.isna(obj4)

Kolkata      True
Delhi       False
Banglore    False
Mumbai      False
dtype: bool

In [25]:

pd.notna(obj4)

Kolkata     False
Delhi        True
Banglore     True
Mumbai       True
dtype: bool


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">By the way, <strong>Series</strong> also has these as <strong>instance methods</strong> :</span>

In [26]:

obj4.isna()

Kolkata      True
Delhi       False
Banglore    False
Mumbai      False
dtype: bool

In [27]:

obj4.notna()

Kolkata     False
Delhi        True
Banglore     True
Mumbai       True
dtype: bool

<div style="margin-left: 120px;">

![](../media/pandas_isna_notna.PNG)

</div>

<span style="font-size: 1rem; color: blue;"><strong>Note</strong></span> &nbsp;&nbsp;-&nbsp;&nbsp; <span style="color: blue;">Refer the section &nbsp; <code style="background-color: blue; color: white;">Data Cleaning & Preparation</code> &nbsp;for more details</span>


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>


<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">A useful <strong>Series</strong> feature for many applications is that <strong>it automatically aligns by index label in arithmetic operations</strong> :</span>

In [28]:

obj3

Delhi        35000
Mumbai       71000
Banglore     16000
Hyderabad     5000
dtype: int64

In [29]:

obj4

Kolkata         NaN
Delhi       35000.0
Banglore    16000.0
Mumbai      71000.0
dtype: float64

In [30]:

obj3 + obj4                                            # Banglore        32000.0      <---------      16000 + 16000.0
                                                       # Delhi           70000.0      <---------      35000 + 35000.0
                                                       # Hyderabad           Nan      <---------      5000 + Nan
                                                       # Kolkata             Nan      <---------      Nan
                                                       # Mumbai         142000.0      <---------      71000 + 71000.0

Banglore      32000.0
Delhi         70000.0
Hyderabad         NaN
Kolkata           NaN
Mumbai       142000.0
dtype: float64

In [31]:

print(len(obj3))                                       #  4

print(len(obj4))                                       #  4

print(len(obj3 + obj4))                                #  5

4
4
5

<br>

<span style="color: blue;"><span style="font-size: 1rem;"><strong>Note</strong></span> &nbsp;&nbsp;-&nbsp;&nbsp; <code style="background-color: blue; color: white; padding: 2px;">Data alignment features</code> will be addressed in more detail later. <br>
<span style="margin-left: 65px;">If you have experience with databases, you can think about this as being <u>similar to a join operation</u>.</span></span>


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Both the <strong>Series object itself</strong> and its <strong>index</strong> have a &nbsp;<code style="background-color: #ffff62;">name</code>&nbsp; attribute, which integrates with other areas of pandas functionality :</span>

In [32]:

obj4.name = "population"

obj4.index.name = "city"

obj4

city
Kolkata         NaN
Delhi       35000.0
Banglore    16000.0
Mumbai      71000.0
Name: population, dtype: float64


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">A <u>Series’s <strong>index</strong></u> can be altered <strong>in place</strong> by <strong>assignment</strong> :</span>

In [33]:

obj = pd.Series([4, 7, -5, 3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

In [34]:

obj.index = ["record_1", "record_2", "record_3", "record_4"]

obj

record_1    4
record_2    7
record_3   -5
record_4    3
dtype: int64

<br>

### <div style="color: black; background-color: #ffe9c8; padding-top: 10px; padding-bottom: 10px; padding-right: 10px;"> <code style="font-size: 1.3rem; background-color: #ffe9c8; color: red;"><strong>DataFrame</strong></code> &nbsp;(2D array)</div>

<br>

<span style="color: #a245ff;">A DataFrame represents a <strong>rectangular table of data</strong> and contains an ordered, named collection of columns, each of which can be a different value type (numeric, string, Boolean, etc.). &nbsp;<strong>The DataFrame has both a row and column index</strong> ; it can be thought of as <code>a dictionary of Series</code></span>

<br>

<div style="display: flex;">
<div><span style="color: blue; font-size: 1rem;"><strong>Note</strong>&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;</span></div>
<div style="margin-left: 20px;">While a DataFrame is physically <strong>two-dimensional</strong>, you can use it to represent higher dimensional data in a tabular format using <code>hierarchical indexing</code>, a subject we will discuss in subsection &nbsp;<code style="background-color: blue; color: white; padding: 2px;"><u>Data Wrangling</u> : Join, Combine, and Reshape</code>&nbsp; and an ingredient in some of the <u>more advanced data-handling features</u> in pandas</div>
</div>

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">There are many ways to construct a DataFrame, though one of the most common is &nbsp;<span style="background-color: #fff2dd; color: #f76607; padding: 2px;">&nbsp;from a <strong>dictionary</strong> of <strong>equal-length</strong> <u>lists</u> or <u>NumPy arrays</u>&nbsp;</span> :</span>

In [35]:

data = {"city": ["Mumbai", "Mumbai", "Mumbai", "Delhi", "Delhi", "Delhi"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "population": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}                                      # Each key-value pair in the dictionary data is a COLUMN


frame = pd.DataFrame(data)


frame

     city  year  population
0  Mumbai  2000         1.5
1  Mumbai  2001         1.7
2  Mumbai  2002         3.6
3   Delhi  2001         2.4
4   Delhi  2002         2.9
5   Delhi  2003         3.2

<span style="color: #a245ff;">As you can see similar to Series , the <strong>order</strong> of the &nbsp;<code style="background-color: #f9e5ff;">index</code> &nbsp;or the <code style="background-color: #f9e5ff;">keys</code> &nbsp;(or more popularly know as &nbsp;<code style="background-color: #f9e5ff;">columns</code>&nbsp; in this context) <strong>depends on their insertion order in the dictionary.</strong></span>

<br>


<div style="margin-left: 35px;">

![](../media/pandas_dataframe_1.PNG)

</div>

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">For <strong>large DataFrames</strong>, the &nbsp;<code style="background-color: #ffff62;">head()</code>&nbsp; method selects <strong>only the first five rows</strong> :</span>

In [36]:

frame.head()

     city  year  population
0  Mumbai  2000         1.5
1  Mumbai  2001         1.7
2  Mumbai  2002         3.6
3   Delhi  2001         2.4
4   Delhi  2002         2.9

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Similarly, &nbsp;<code style="background-color: #ffff62;">tail</code>&nbsp; returns <strong>the last five rows</strong> :</span>

In [37]:

frame.tail()

     city  year  population
1  Mumbai  2001         1.7
2  Mumbai  2002         3.6
3   Delhi  2001         2.4
4   Delhi  2002         2.9
5   Delhi  2003         3.2

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">If you specify <strong>a sequence of columns</strong>, the DataFrame’s columns will be <strong>arranged in that order</strong> :</span>

In [38]:

pd.DataFrame(data, columns=["year", "city", "population"])

   year    city  population
0  2000  Mumbai         1.5
1  2001  Mumbai         1.7
2  2002  Mumbai         3.6
3  2001   Delhi         2.4
4  2002   Delhi         2.9
5  2003   Delhi         3.2

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;"><strong>If you pass a column that isn’t contained in the dictionary</strong>, it will appear with <strong>missing values</strong> in the result :</span>

In [39]:

data = {"city": ["Mumbai", "Mumbai", "Mumbai", "Delhi", "Delhi", "Delhi"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "population": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}


frame2 = pd.DataFrame(data, columns=["year", "city", "population", "debt"])


frame2

   year    city  population debt
0  2000  Mumbai         1.5  NaN
1  2001  Mumbai         1.7  NaN
2  2002  Mumbai         3.6  NaN
3  2001   Delhi         2.4  NaN
4  2002   Delhi         2.9  NaN
5  2003   Delhi         3.2  NaN

In [40]:

frame2.columns

Index(['year', 'city', 'population', 'debt'], dtype='object')

In [41]:

frame2.keys()

Index(['year', 'city', 'population', 'debt'], dtype='object')

In [42]:

print(frame2.index)                     #  RangeIndex(start=0, stop=6, step=1)

print(frame2.index.values)              #  [0 1 2 3 4 5]           ----------------------->           array([0, 1, 2, 3, 4, 5], dtype=int64)

print(list(frame2.index))               #  [0, 1, 2, 3, 4, 5]

print(type(frame2.index))               # <class 'pandas.core.indexes.range.RangeIndex'>

RangeIndex(start=0, stop=6, step=1)
[0 1 2 3 4 5]
[0, 1, 2, 3, 4, 5]
<class 'pandas.core.indexes.range.RangeIndex'>

In [43]:

frame2.values

array([[2000, 'Mumbai', 1.5, nan],
       [2001, 'Mumbai', 1.7, nan],
       [2002, 'Mumbai', 3.6, nan],
       [2001, 'Delhi', 2.4, nan],
       [2002, 'Delhi', 2.9, nan],
       [2003, 'Delhi', 3.2, nan]], dtype=object)

<br>

<div style="margin-left: 40px;">

![](../media/pandas_dataframe_2.PNG)

</div>

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">A <strong>column in a DataFrame</strong> can be retrieved as a <strong>Series</strong> either by <strong>dictionary-like notation</strong> or by using the <strong>dot attribute notation</strong> :</span>


<code style="background-color: #ffff62; margin-left: 40px;">dataframe["colum1"]</code> &nbsp;&nbsp;&nbsp;&nbsp;&&nbsp;&nbsp;&nbsp;&nbsp; <code style="background-color: #ffff62;">dataframe.column1</code>

In [44]:

frame2["city"]                          # METHOD - 1

0    Mumbai
1    Mumbai
2    Mumbai
3     Delhi
4     Delhi
5     Delhi
Name: city, dtype: object

In [45]:

frame2.city                             # METHOD - 2

0    Mumbai
1    Mumbai
2    Mumbai
3     Delhi
4     Delhi
5     Delhi
Name: city, dtype: object

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<div style="display: flex;">
<div><span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span>&nbsp;&nbsp;&nbsp;</div>
<div><span style="color: #f76607;"><code style="background-color: #f9e5ff;">frame2[column]</code> works for any column name, but <code style="background-color: #f9e5ff;">frame2.column</code> works only when the column name is a valid Python variable name and does not conflict with any of the method names in DataFrame.</span></div>
</div>


<span style="color: #f76607; margin-left: 42px;">For example, <strong>if a column's name contains</strong> <span style="color: black;">whitespace</span> <strong>or</strong> <span style="color: black;">symbols</span> <span style="background-color: #fff1cd; padding: 2px;">&nbsp;<strong>other than</strong> <span style="color: black;"><strong>underscores</strong></span><strong>&nbsp;</span> , it</strong> <span style="color: black;"><u><span style="color: #ff8843;">cannot</span></u></span> <strong>be accessed with the dot attribute method.</strong></span>

In [46]:

data = {"Full_Name": ["Avinash Mishra", "Aman Mishra"],
        "Designation": ["Data Engineer", "Software Engineer"],
        "Years of Experience": [1, 3],
        "@portfolio": ['avinash.com', 'aman.com']}


frame = pd.DataFrame(data)


frame

        Full_Name        Designation  Years of Experience   @portfolio
0  Avinash Mishra      Data Engineer                    1  avinash.com
1     Aman Mishra  Software Engineer                    3     aman.com


<br>

<div style="margin-left: 80px;">

![](../media/pandas_dataframe_3.PNG)

<span style="color: #a245ff; margin-left: 8px;">Note that the returned Series have the same index as the DataFrame, and their <strong>name</strong> attribute has been appropriately set</span>

</div>

In [47]:

frame['Years of Experience']

0    1
1    3
Name: Years of Experience, dtype: int64

In [48]:

frame["@portfolio"]

0    avinash.com
1       aman.com
Name: @portfolio, dtype: object

In [49]:

frame['@portfolio'].name

'@portfolio'

In [50]:

frame['@portfolio'].dtype

dtype('O')

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Methods to find the <strong>type of a column</strong> of a pandas dataframe :</span>

In [51]:

data = {
    "name": ["Avinash", "Radha", "Aman"],
    "age": [25, 30, 35],
    "height": [5.5, 6.0, 5.8],
    "is_student": [True, False, True],
}

df = pd.DataFrame(data)

df

      name  age  height  is_student
0  Avinash   25     5.5        True
1    Radha   30     6.0       False
2     Aman   35     5.8        True


<span style="color: #a245ff;">1. &nbsp;Using &nbsp;<code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">df</span>.<span style="font-size: 1rem;"><strong>dtypes</strong></span></code> &nbsp;<span style="fontsize: 0.8rem;">property</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;===============================>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This attribute returns the data types of <strong>all columns</strong> in the DataFrame</span>

In [52]:

print(df.dtypes)

name           object
age             int64
height        float64
is_student       bool
dtype: object

<br>

<span style="color: #a245ff;">2. &nbsp;Using &nbsp;<code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">df["column1"]</span>.<span style="font-size: 1rem;"><strong>dtype</strong></span></code> &nbsp;<span style="fontsize: 0.8rem;">property 
for a <strong>Specific Column</strong></span></span>

In [53]:

print(df["age"].dtype)                        # OUTPUT: int64

print(df["name"].dtype)                       # OUTPUT: object

int64
object

<br>

<span style="color: #a245ff;">3. &nbsp;Using &nbsp;<code style="background-color: #ffff62; font-size: 1rem;"><strong>type(</strong><span style="color: #a245ff; font-size: 0.8rem;">df["column1"]</span><strong>)</strong></code> &nbsp;<span style="fontsize: 0.8rem;">to Check the Type of a <strong>Column Object</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ======>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; checks the type of the column as a whole, which is usually a &nbsp;<code style="background-color: #f7deff;">pandas.Series</code></span></span>

In [54]:

print(type(df))                               # <class 'pandas.core.frame.DataFrame'>    ------------>     A dataframe is a collection of series

print(type(df['name']))                       # <class 'pandas.core.series.Series'>

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

<br>

<span style="color: #a245ff;">4. &nbsp;Using &nbsp;<code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">df</span>.<span style="font-size: 1rem;"><strong>info()</strong></span></code> &nbsp;<span style="fontsize: 0.8rem;">for an overview</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;===========================>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This method provides a <strong>summary of the DataFrame</strong>, including column data types</span>

In [55]:

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        3 non-null      object
 1   age         3 non-null      int64
 2   height      3 non-null      float64
 3   is_student  3 non-null      bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 207.0+ bytes

<br>

<strong><u>Special Cases to Note</u></strong>

<br>

<span style="color: red;">1. &nbsp;Object &nbsp;Columns <span style="font-size: 1rem;">(</span>&nbsp;<code style="background-color: #c7feff;">dtype('O')</code>&nbsp;<span style="font-size: 1rem;">)</span> :</span>  <br>

<div style="margin-left: 30px; color: #a245ff;">

- Columns with &nbsp;<code style="background-color: #c7feff;">dtype('O')</code>&nbsp; can contain <u>strings</u>, &nbsp;<u>mixed types</u>, or <u>Python objects</u> . &nbsp;To check for string types :

</div>

In [56]:

print(df["name"].apply(type).unique())                    # Check unique types in the column     ------>     [<class 'str'>]


print(df["name"].dtype)                                   # object

[<class 'str'>]
object

<br>

<span style="color: red;">2. &nbsp;Datetime &nbsp;Columns :</span>

<div style="margin-left: 30px; color: #a245ff;">

- A column with datetime values will have &nbsp;<code style="background-color: #c7feff;">datetime64</code>&nbsp; as its type

</div>

In [57]:

df["date"] = pd.to_datetime(["2024-01-01", "2024-01-02", "2024-01-03"])

print(df["date"].dtype)

datetime64[ns]

<br>

&nbsp;<code style="background-color: #c7feff; margin-left: 60px;">datetime64</code> &nbsp;&nbsp;====> &nbsp;&nbsp; <code style="background-color: #ffff62;">dtype\('\<M8[ns]')</code>

In [58]:

df["date"].dtype

dtype('<M8[ns]')

In [59]:

pd.to_datetime(["2024-01-01", "2024-01-02", "2024-01-03"])

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03'], dtype='datetime64[ns]', freq=None)

In [60]:

type(pd.to_datetime(["2024-01-01", "2024-01-02", "2024-01-03"]))

pandas.core.indexes.datetimes.DatetimeIndex

<br>

<span style="color: red;">3. &nbsp;Category &nbsp;Columns :</span>

<div style="margin-left: 30px; color: #a245ff;">
    
- Categorical data has the type &nbsp;<code style="background-color: #c7feff;">category</code>

</div>

In [61]:

df["category"] = pd.Categorical(["A", "B", "A"])

print(df["category"].dtype)

category

<br>

<div style="margin-left: 150px;">

![](../media/pandas_dataframe_4.PNG)

</div>

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Rows can also be retrieved by <strong>position</strong> or <strong>name</strong> with the special &nbsp;<code style="background-color: #ffff62;">iloc</code>&nbsp; and &nbsp;<code style="background-color: #ffff62;">loc</code>&nbsp; attributes</span>  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;=====>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">df</span>.<span style="font-size: 1rem;"><strong>loc[]</strong></span></code> &nbsp;&nbsp;&nbsp;&&nbsp;&nbsp;&nbsp; <code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">df</span>.<span style="font-size: 1rem;"><strong>iloc[]</strong></span></code>
<br><span style="color: blue; margin-left: 40px;"><span style="font-size: 1.1rem;">( </span> more on this later in <code style="background-color: blue; color: white;">Selection on DataFrame with loc and iloc</code> &nbsp;<span style="font-size: 1.1rem;">)</span></span>

In [62]:

frame2

   year    city  population debt
0  2000  Mumbai         1.5  NaN
1  2001  Mumbai         1.7  NaN
2  2002  Mumbai         3.6  NaN
3  2001   Delhi         2.4  NaN
4  2002   Delhi         2.9  NaN
5  2003   Delhi         3.2  NaN

In [63]:

frame2.loc[1]

year            2001
city          Mumbai
population       1.7
debt             NaN
Name: 1, dtype: object

In [64]:

frame2.iloc[2]

year            2002
city          Mumbai
population       3.6
debt             NaN
Name: 2, dtype: object

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;"><strong>Columns can be modified by assignment.</strong> &nbsp;For example, the empty &nbsp;<code style="background-color: #ffead5;">debt</code>&nbsp; column could be assigned a <span style="background-color: #ffead5; color: #f76607;"> &nbsp;scalar value </span> &nbsp;or <span style="background-color: #ffead5; color: #f76607;"> &nbsp;an array of values </span> &nbsp;:</span>

<span style="color: #a245ff; margin-left: 42px;">Assigning a <strong>scalar</strong> to a column :</span>

In [65]:

frame2["debt"] = 16.5

frame2

   year    city  population  debt
0  2000  Mumbai         1.5  16.5
1  2001  Mumbai         1.7  16.5
2  2002  Mumbai         3.6  16.5
3  2001   Delhi         2.4  16.5
4  2002   Delhi         2.9  16.5
5  2003   Delhi         3.2  16.5


<span style="color: #a245ff; margin-left: 42px;">Assigning a <strong>vector</strong> (array of values) to a column :</span>

In [66]:

frame2["debt"] = np.arange(6.)                 #  np.arange(6.)  =  [0., 1., 2., 3., 4., 5.]
                                               #  np.arange(6)   =  [0, 1, 2, 3, 4, 5]


frame2

   year    city  population  debt
0  2000  Mumbai         1.5   0.0
1  2001  Mumbai         1.7   1.0
2  2002  Mumbai         3.6   2.0
3  2001   Delhi         2.4   3.0
4  2002   Delhi         2.9   4.0
5  2003   Delhi         3.2   5.0

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;"><strong>When you are assigning lists or arrays to a column</strong>, <u>the value’s length must <strong>match</strong> the length of the DataFrame</u>.</span>

<div style="margin-left: 80px;">

![](../media/pandas_dataframe_5.PNG)

</div>

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<br>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;"><strong>If you assign a Series</strong>, its labels will be <strong>realigned exactly</strong> to the DataFrame’s index, <strong>inserting missing values if any index values not present</strong> :</span>

In [67]:

val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])

frame2["debt"] = val

frame2

   year    city  population  debt
0  2000  Mumbai         1.5   NaN
1  2001  Mumbai         1.7   NaN
2  2002  Mumbai         3.6  -1.2
3  2001   Delhi         2.4   NaN
4  2002   Delhi         2.9  -1.5
5  2003   Delhi         3.2  -1.7

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Assigning a column that <u>doesn’t exist</u> will create a <strong>new column</strong>.</span>


<code style="background-color: black; color: white;">Example - 1</code>

In [68]:

frame2["gdp_growth_rate_in_percentage"] = pd.Series([5.5, 7.6, 6.3, 6.2, 7.9, 7.0])

frame2

   year    city  population  debt  gdp_growth_rate_in_percentage
0  2000  Mumbai         1.5   NaN                            5.5
1  2001  Mumbai         1.7   NaN                            7.6
2  2002  Mumbai         3.6  -1.2                            6.3
3  2001   Delhi         2.4   NaN                            6.2
4  2002   Delhi         2.9  -1.5                            7.9
5  2003   Delhi         3.2  -1.7                            7.0

<code style="background-color: black; color: white;">Example - 2</code>

In [69]:

frame2["city"] == "Mumbai"

0     True
1     True
2     True
3    False
4    False
5    False
Name: city, dtype: bool

In [70]:

frame2["western"] = frame2["city"] == "Mumbai"                       # adds a new column of Boolean values where the city column equals "Mumbai"

frame2

   year    city  population  debt  gdp_growth_rate_in_percentage  western
0  2000  Mumbai         1.5   NaN                            5.5     True
1  2001  Mumbai         1.7   NaN                            7.6     True
2  2002  Mumbai         3.6  -1.2                            6.3     True
3  2001   Delhi         2.4   NaN                            6.2    False
4  2002   Delhi         2.9  -1.5                            7.9    False
5  2003   Delhi         3.2  -1.7                            7.0    False


<span style="color: #a245ff;">However it is important to note here that <u>new columns</u> <strong>cannot be created</strong> with the <strong>dot attribute</strong> notation.</span>

In [71]:

frame2.northern = frame2["city"] == "Delhi"

C:\Users\user\AppData\Local\Temp\ipykernel_9012\3821651426.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  frame2.northern = frame2["city"] == "Delhi"

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">The &nbsp;<code style="background-color: #ffff62;">del</code>&nbsp; keyword will <strong>delete columns</strong> like with a dictionary.</span>

In [72]:

del frame2["western"]

frame2.columns

Index(['year', 'city', 'population', 'debt', 'gdp_growth_rate_in_percentage'], dtype='object')

In [73]:

frame2

   year    city  population  debt  gdp_growth_rate_in_percentage
0  2000  Mumbai         1.5   NaN                            5.5
1  2001  Mumbai         1.7   NaN                            7.6
2  2002  Mumbai         3.6  -1.2                            6.3
3  2001   Delhi         2.4   NaN                            6.2
4  2002   Delhi         2.9  -1.5                            7.9
5  2003   Delhi         3.2  -1.7                            7.0

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<div style="display: flex;">
<div><span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span>&nbsp;&nbsp;&nbsp;</div>
<div><span style="color: #f76607;">The column returned from indexing a DataFrame <u>is a <strong>view</strong></u> on the underlying data, <u>not a <strong>copy</strong></u>. &nbsp;Thus, <strong>any in-place modifications to the Series will be reflected in the DataFrame</strong>. &nbsp;The column can be explicitly copied with the Series’s &nbsp;<code style="background-color: #ffff62;">copy</code>&nbsp; method.</span></div>
</div>

In [74]:

frame2["gdp_growth_rate_in_percentage"][2] = 8.0            # overwrites the gdp growth rate in the 3rd row

frame2                                                      # the modification is reflected in the gdp column of the 3rd row

C:\Users\user\AppData\Local\Temp\ipykernel_9012\2669856102.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  frame2["gdp_growth_rate_in_percentage"][2] = 8.0            # overwrites the gdp growth rate in the 3rd row

   year    city  population  debt  gdp_growth_rate_in_percentage
0  2000  Mumbai         1.5   NaN                            5.5
1  2001  Mumbai         1.7   NaN                            7.6
2  2002  Mumbai         3.6  -1.2                            8.0
3  2001   Delhi         2.4   NaN                            6.2
4  2002   Delhi         2.9  -1.5                            7.9
5  2003   Delhi         3.2  -1.7                            7.0

<br>

<div style="display: flex; margin-left: 45px;">
<div><font size=+1>⭐</font>&nbsp;&nbsp;&nbsp;</div>
<div><span style="color: #f76607;"><span style="color: #a245ff;">Although each record of a column can be accessed like &nbsp;<code style="background-color: #f1d9ff; font-size: 0.8rem;">df['column_name'][index]</code> , but it's <strong>not recommended</strong> to access it like this specially while assigning a scalar value to it. &nbsp;Because <u>Chaining indexing operations</u>, like &nbsp;<code style="background-color: #f1d9ff; font-size: 0.8rem;">df['column_name'][index]</code> , can lead to <strong>ambiguity</strong> about whether you're working with a <span style="color: red;">copy</span> or a <span style="color: red;">view</span>. &nbsp;<span style="color: red;"><strong>Always avoid this</strong></span></span></div>
</div>

<br>

<div style="margin-left: 180px;">

![](../media/pandas_dataframe_6.PNG)

</div>

<br>

<span style="margin-left: 52px; color: #a245ff;"><font size="+1">↳</font> &nbsp;Use &nbsp;<code style="background-color: #ffff62; font-size: 0.9rem;"><span style="color: #a245ff; font-size: 0.8rem;">df</span>.<span style="font-size: 1rem;"><strong>loc[</strong></span>row_index, column_name<span style="font-size: 1rem;"><strong>]</strong></span></code>&nbsp; when working with <span style="color: red;">view</span></span>

<div style="border-radius: 8px; padding: 10px; background-color: #ffdef5; color: black; width:690px; margin-left: 190px;">

<pre> 
    
 df.loc[row_selection, column_selection]

</pre>

<div style="margin-left: 20px;">
    
- <strong>row_selection</strong> &nbsp;&nbsp;=====> &nbsp;Specifies which rows to select &nbsp;<span style="font-size: 1rem;">(</span> can be <span style="color: blue;"><u>labels</u></span> , <span style="color: blue;"><u>slices</u></span> , or <span style="color: blue;"><u>boolean masks</u></span> <span style="font-size: 1rem;">)</span>

- <strong>column_selection</strong> &nbsp;&nbsp;==>&nbsp;&nbsp; Specifies which columns to select &nbsp;<span style="font-size: 1rem;">(</span> can be <span style="color: blue;"><u>labels</u></span> , <span style="color: blue;"><u>slices</u></span> , or <span style="color: blue;"><u>boolean masks</u></span> <span style="font-size: 1rem;">)</span>

</div>

</div>

In [75]:

frame2.loc[2, "gdp_growth_rate_in_percentage"] = 8.1

frame2

   year    city  population  debt  gdp_growth_rate_in_percentage
0  2000  Mumbai         1.5   NaN                            5.5
1  2001  Mumbai         1.7   NaN                            7.6
2  2002  Mumbai         3.6  -1.2                            8.1
3  2001   Delhi         2.4   NaN                            6.2
4  2002   Delhi         2.9  -1.5                            7.9
5  2003   Delhi         3.2  -1.7                            7.0

<br>


<span style="margin-left: 52px; color: #a245ff;"><font size="+1">↳</font> &nbsp;However if you deliberately want to work with a <span style="color: red;">copy</span> of a DataFrame slice, use the &nbsp;<code style="background-color: #ffff62;">.copy()</code>&nbsp; method to make it <strong>explicit</strong> :</span>

<div style="margin-left: 170px;">

![](../media/pandas_dataframe_7.PNG)

</div>

<span style="color: #1bb80e; font-size: 0.8rem;">METHOD - 1</span>

In [76]:

series = frame2["gdp_growth_rate_in_percentage"].copy()

series[2] = 9.0                                                          #  frame2["gdp_growth_rate_in_percentage"].copy()[2]  =  9.0

frame2

   year    city  population  debt  gdp_growth_rate_in_percentage
0  2000  Mumbai         1.5   NaN                            5.5
1  2001  Mumbai         1.7   NaN                            7.6
2  2002  Mumbai         3.6  -1.2                            8.1
3  2001   Delhi         2.4   NaN                            6.2
4  2002   Delhi         2.9  -1.5                            7.9
5  2003   Delhi         3.2  -1.7                            7.0


<span style="color: #1bb80e; font-size: 0.8rem;">METHOD - 2</span> &nbsp;<span style="color: blue;">(preferred)</span>

In [77]:

df_slice = frame2[["gdp_growth_rate_in_percentage"]].copy()

df_slice.loc[2, "gdp_growth_rate_in_percentage"] = 10.0

frame2

   year    city  population  debt  gdp_growth_rate_in_percentage
0  2000  Mumbai         1.5   NaN                            5.5
1  2001  Mumbai         1.7   NaN                            7.6
2  2002  Mumbai         3.6  -1.2                            8.1
3  2001   Delhi         2.4   NaN                            6.2
4  2002   Delhi         2.9  -1.5                            7.9
5  2003   Delhi         3.2  -1.7                            7.0

<br>

<code style="background-color: black; color: white;">Best Practices</code>

- Always use &nbsp;<code style="background-color: #ffff62;">.loc[]</code>&nbsp; or &nbsp;<code style="background-color: #ffff62;">.iloc[]</code>&nbsp; for <u>safe & explicit modifications</u>.
- Avoid chained indexing.
- Use &nbsp;<code style="background-color: #ffff62;">.copy()</code>&nbsp; when working with <u>slices that should be independent</u>.



<br>

<span style="color: blue;"><strong>NOTE &nbsp;&nbsp;- </strong></span> &nbsp;&nbsp;The ambiguity stems from how Pandas handles slicing.</span> <br>
<span style="margin-left: 67px;">We will cover this <strong>slicing</strong> technique in more details in the section &nbsp;<code style="background-color: blue; color: white;">Indexing, Selection, and Filtering</code>&nbsp; later on.

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Another common form of data is a <strong>nested dictionary of dictionaries</strong> :</span>

In [78]:

populations = {"Mumbai": {2000: 1.5, 2001: 1.7, 2002: 3.6}, 
               "Delhi": {2001: 2.4, 2002: 2.9}}

<br>

<span style="color: #a245ff; margin-left: 40px;">If the <strong>nested dictionary</strong> is passed to the DataFrame ,</span> <br>
<span style="color: #a245ff; margin-left: 90px;">pandas will interpret <code style="background-color: #f1ddff;">the <span style="color: red;">outer</span> dictionary keys as the <span style="color: red;">columns</span></code> , and <code style="background-color: #f1ddff;">the <span style="color: red;">inner</span> keys as the <span style="color: red;">row indices</span></code> :</span>

In [79]:

frame3 = pd.DataFrame(populations)

frame3

      Mumbai  Delhi
2000     1.5    NaN
2001     1.7    2.4
2002     3.6    2.9

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">You can <strong>transpose</strong> the DataFrame (swap rows and columns) with similar syntax to a NumPy array :</span>

In [80]:

frame3.T                                            # Method - 1

        2000  2001  2002
Mumbai   1.5   1.7   3.6
Delhi    NaN   2.4   2.9

In [81]:

np.transpose(frame3)                                # Method - 2

        2000  2001  2002
Mumbai   1.5   1.7   3.6
Delhi    NaN   2.4   2.9

<br>

<div style="display: flex;">

<div><code style="background-color: #ff4423; color: white;">Warning</code>&nbsp;&nbsp;&nbsp;<span style="color: #a245ff;">===></span>&nbsp;&nbsp;&nbsp;</div>

<div><span style="color: black?;">Note that <strong>transposing discards the column data types if all the columns do not have the same data type</strong> , so transposing and then transposing back may lose the previous type information. &nbsp;The columns become arrays of pure Python objects <span style="font-size: 1rem;">(</span> <code style="background-color: #9bfff1; font-size: 0.75rem;">dtype('O')</code> <span style="font-size: 1rem;">)</span> in this case. &nbsp;<u>This happens because of how Pandas handles heterogeneous data when rearranging it</u>.</span></div>

</div>


<div style="margin-left: 127px;">

In a DataFrame, each column typically has a consistent data type ( e.g., &nbsp;<code>int64</code> , <code>float64</code> , <code>object</code> ). 

When you transpose, columns become rows, and if the original columns have different types, Pandas cannot maintain their individual data types in the transposed structure. &nbsp;<u>The transposed DataFrame rows are forced into a single data type to ensure consistency</u>. &nbsp;<span style="background-color: #ffefc4; padding: 4px;">This type is <code style="background-color: #9bfff1; font-size: 0.8rem;">object</code> because Python objects can represent any data type</span>

<span style="color: red;">Transposing back does not restore the original types, as the type information is lost when the columns become <code style="background-color: #9bfff1; font-size: 0.8rem;">arrays of objects</code></span>

</div>

<br>

<span style="color: #1ec410;">If the columns have <strong>mixed data types :</strong></span>

In [82]:

data = {
    "int_column": [1, 2, 3],
    "float_column": [1.1, 2.2, 3.3],
    "string_column": ["a", "b", "c"]
}


df = pd.DataFrame(data)
print(df.dtypes)

int_column         int64
float_column     float64
string_column     object
dtype: object

In [83]:

print(df.T.dtypes)

0    object
1    object
2    object
dtype: object

In [84]:

print(df.T.T.dtypes)

int_column       object
float_column     object
string_column    object
dtype: object


<span style="color: #a245ff;">Once data types of the columns of a dataframe are changed to enforce a first time transposition, transposing it back does not restore original types of those columns.</span>

<br>

<span style="color: #1ec410;">If the columns have <strong>same data types :</strong></span>

In [85]:

data = {
    "int_column1": [1, 2, 3],
    "int_column2": [4, 5, 6],
    "int_column3": [7, 8, 9],
}


df = pd.DataFrame(data)
print(df.dtypes)

int_column1    int64
int_column2    int64
int_column3    int64
dtype: object

In [86]:

print(df.T.dtypes)

0    int64
1    int64
2    int64
dtype: object

In [87]:

print(df.T.T.dtypes)

int_column1    int64
int_column2    int64
int_column3    int64
dtype: object

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">The keys in the inner dictionaries are combined to form the index in the result. &nbsp;This isn’t true if an explicit index is specified :</span>

In [88]:

populations = {"Mumbai": {2000: 1.5, 2001: 1.7, 2002: 3.6}, 
               "Delhi": {2001: 2.4, 2002: 2.9}}

frame3 = pd.DataFrame(populations)

frame3

      Mumbai  Delhi
2000     1.5    NaN
2001     1.7    2.4
2002     3.6    2.9

In [89]:

frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [90]:

pd.DataFrame(populations, index=[2001, 2002, 2003])

      Mumbai  Delhi
2001     1.7    2.4
2002     3.6    2.9
2003     NaN    NaN

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Dictionaries of Series are treated in much the same way :</span>

In [91]:

frame3

      Mumbai  Delhi
2000     1.5    NaN
2001     1.7    2.4
2002     3.6    2.9


<div style="margin-left: 170px;">

![](../media/pandas_dataframe_8.PNG)

</div>

In [92]:

pdata = {"Mumbai": frame3["Mumbai"][:-1], 
         "Delhi": frame3["Delhi"][:2]}


pd.DataFrame(pdata)

      Mumbai  Delhi
2000     1.5    NaN
2001     1.7    2.4

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">List of all possible data inputs to the <strong>DataFrame</strong> constructor :</span>

<span style="color: blck; margin-left: 70px;">The Pandas DataFrame constructor can accept a wide variety of input data structures and formats to create a DataFrame.</span> <br>
<span style="color: black; margin-left: 70px;">Here’s a detailed breakdown of the possible data inputs :</span>


###### <span style="color: blue; font-size: 1rem;"><strong>1. &nbsp;Dictionaries</strong></span>


<span style="margin-left: 70px;">Dictionaries are the most common input for creating a DataFrame.</span>

<span style="color: red;">a. &nbsp;<u>Dictionary of Lists</u></span> <br> 
<span style="color: #a245ff; margin-left: 70px;">Each key represents a column name, and the corresponding list represents column values.</span>

In [93]:

data = {"col1": [1, 2, 3], "col2": [4, 5, 6]}

df = pd.DataFrame(data)

df

   col1  col2
0     1     4
1     2     5
2     3     6

In [206]:

df = pd.DataFrame({'col1': [1, 2, 3], 
                   'col2': [10, 20, 30]}, index=['a', 'b', 'c'])


df

   col1  col2
a     1    10
b     2    20
c     3    30


<span style="color: red;">b. &nbsp;<u>Dictionary of Arrays</u></span> <br>
<span style="color: #a245ff; margin-left: 70px;">Similar to lists, but values can be NumPy arrays.</span>

In [94]:

data = {"col1": np.array([1, 2, 3]), 
        "col2": np.array([4, 5, 6])}

df = pd.DataFrame(data)

df

   col1  col2
0     1     4
1     2     5
2     3     6

<span style="color: red;">c. &nbsp;<u>Dictionary of Series</u></span> <br>
<span style="color: #a245ff; margin-left: 70px;">Each key is a column name, and the corresponding value is a Pandas Series.</span>

In [95]:

data = {"col1": pd.Series([1, 2, 3]), 
        "col2": pd.Series([4, 5, 6])}

df = pd.DataFrame(data)

df

   col1  col2
0     1     4
1     2     5
2     3     6


<span style="color: red;">d. &nbsp;<u>Dictionary of Dictionaries</u></span> <br>
<span style="color: #a245ff; margin-left: 70px;">Inner dictionaries represent rows, with keys as column names</span> &nbsp;&nbsp;&nbsp;=======>&nbsp;&nbsp;&nbsp; <code style="background-color: #f2d2ff;">Outer keys  ➜  column names</code> &nbsp;, &nbsp;<code style="background-color: #f2d2ff;">Inner keys  ➜  index</code>

In [96]:

data = {"col1": {"row1": 1, "row2": 4}, 
        "col2": {"row1": 2, "row2": 5}}

df = pd.DataFrame(data)

df

      col1  col2
row1     1     2
row2     4     5

In [97]:

data = {"row1": {"col1": 1, "col2": 4}, 
        "row2": {"col1": 2, "col2": 5}}

df = pd.DataFrame(data).T

df

      col1  col2
row1     1     4
row2     2     5

<br>

###### <span style="color: blue; font-size: 1rem;"><strong>2. &nbsp;Lists</strong></span>

<br>

<span style="color: red;">a. &nbsp;<u>List of Lists</u></span> <br>
<span style="color: #a245ff; margin-left: 70px;">Each inner list represents a row. &nbsp;Column names can be specified separately.</span>

In [98]:

data = [[1, 2, 3], 
        [4, 5, 6]]

df = pd.DataFrame(data, columns=["col1", "col2", "col3"])

df

   col1  col2  col3
0     1     2     3
1     4     5     6

<br>

<span style="color: red;">b. &nbsp;<u>List of Dictionaries</u></span> <br>
<span style="color: #a245ff; margin-left: 70px;">Each dictionary represents a row, with keys as column names.</span>

In [99]:

data = [{"col1": 1, "col2": 4}, 
        {"col1": 2, "col2": 5}]

df = pd.DataFrame(data)

df

   col1  col2
0     1     4
1     2     5

<br>

###### <span style="color: blue; font-size: 1rem;"><strong>3. &nbsp;Arrays</strong></span>


<span style="margin-left: 70px;">NumPy arrays can be directly passed to the constructor. &nbsp;Specify column names separately if needed.</span>

<br>

<span style="color: red;">a. &nbsp;<u>2D Array</u></span> <br> 
<span style="color: #a245ff; margin-left: 70px;">Each row in the array represents a row in the DataFrame.</span>

In [100]:

data = np.array([[1, 2, 3], 
                 [4, 5, 6]])

df = pd.DataFrame(data, columns=["col1", "col2", "col3"])

df

   col1  col2  col3
0     1     2     3
1     4     5     6

<br>

<span style="color: red;">b. &nbsp;<u>Structured / Record Array</span> <br>
<span style="color: #a245ff; margin-left: 70px;">Structured NumPy arrays can also be used.</span>

In [101]:

data = np.array([(1, 4), 
                 (2, 5)], dtype=[("col1", "int32"), ("col2", "int32")])

df = pd.DataFrame(data)

df

   col1  col2
0     1     4
1     2     5

<br>

###### <span style="color: blue; font-size: 1rem;"><strong>4. &nbsp;Series</strong></span>


<span style="margin-left: 70px;">A Pandas Series can be used to create a one-column DataFrame.</span>

In [102]:

data = pd.Series([1, 2, 3], name="col1")

df = pd.DataFrame(data)

df

   col1
0     1
1     2
2     3

<br>

###### <span style="color: blue; font-size: 1rem;"><strong>5. &nbsp;Scalar Values</strong></span>


<span style="margin-left: 70px;">If a scalar value is passed, it must be combined with the &nbsp;<code>index</code>&nbsp; and &nbsp;<code>columns</code>&nbsp; parameters <u>to create a DataFrame of constants</u>.</span>

In [103]:

df = pd.DataFrame(5,  index=range(3), columns=["col1", "col2"])

df

   col1  col2
0     5     5
1     5     5
2     5     5

<br>

###### <span style="color: blue; font-size: 1rem;"><strong>6. &nbsp; DataFrame</strong></span>


<span style="margin-left: 70px;">Passing an existing DataFrame creates a <span style="color: blue;"><strong>view</strong></span> (also known as <span style="color: blue;">shallow copy</span>) of it.</span>

<span style="color: #1ec410;">Create &nbsp;a &nbsp;<strong>view</strong> &nbsp;&nbsp;(<u>shallow &nbsp;copy</u>)</span>

In [104]:

original_df = pd.DataFrame({"col1": [1, 2, 3]})

new_df = pd.DataFrame(original_df)

new_df.loc[0, 'col1'] = 10

In [105]:

new_df

   col1
0    10
1     2
2     3

In [106]:

original_df

   col1
0    10
1     2
2     3


<span style="color: #1ec410;">Create &nbsp;a &nbsp;<strong>copy</strong> &nbsp;&nbsp;(<u>deep &nbsp;copy</u>)</span>

In [107]:

original_df = pd.DataFrame({"col1": [1, 2, 3]})

new_df = original_df.copy()

new_df.loc[0, 'col1'] = 10

In [108]:

new_df

   col1
0    10
1     2
2     3

In [109]:

original_df

   col1
0     1
1     2
2     3

<br>

###### <span style="color: blue; font-size: 1rem;"><strong>7. &nbsp; Other Inputs</strong></span>

<br>

<span style="color: red;">a. &nbsp;<u>Iterable</u></span> <br>
<span style="color: #a245ff; margin-left: 70px;">Any iterable that can be converted into a DataFrame. For example, a generator.</span>

In [110]:

data = ((i, i * 2) for i in range(3))                          # <generator object <genexpr> at 0x0000014F078103C0>

df = pd.DataFrame(data, columns=["col1", "col2"])

df

   col1  col2
0     0     0
1     1     2
2     2     4


<span style="color: red;">b. &nbsp;<u>Records</u></span> <br>
<span style="color: #a245ff; margin-left: 70px;">A list of tuples, with each tuple representing a row.</span>

In [111]:

data = [(1, "Alice"), 
        (2, "Bob"), 
        (3, "Charlie")]

df = pd.DataFrame(data, columns=["id", "name"])

df

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie


<span style="color: red;">c. &nbsp;<u>Zip</u></span> <br>
<span style="color: #a245ff; margin-left: 70px;">Combine multiple sequences into a DataFrame using zip.</span>

In [112]:

data = zip([1, 2, 3], ["Alice", "Bob", "Charlie"])

df = pd.DataFrame(data, columns=["id", "name"])

df

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie

<br>

###### <span style="color: blue; font-size: 1rem;"><strong>8. &nbsp; From Files or External Data</strong></span>

<br>

<span style="color: red;">a. &nbsp;&nbsp;CSV , &nbsp;Excel , &nbsp;JSON , etc.</span> <br>


<div style="margin-left: 80px;">

![](../media/pandas_dataframe_9.PNG)

</div>

<strong>Key &nbsp;Points</strong>
1. &nbsp;<span style="color: blue;"><strong>Data Alignment</strong></span> &nbsp;&nbsp;========>&nbsp;&nbsp; Pandas aligns data by index if dictionaries or Series are used, filling missing values with &nbsp;<code>NaN</code>
2. &nbsp;&nbsp;<span style="color: blue;"><strong>Column Names</strong></span> &nbsp;&nbsp;&nbsp;========>&nbsp; If not provided, columns will default to integers (&nbsp;<code>0, 1, 2, ...</code> )
3. &nbsp;&nbsp;<span style="color: blue;"><strong>Index</strong></span> &nbsp;&nbsp;===============>&nbsp; The &nbsp;<code>index</code>&nbsp; parameter can be used to set custom row labels.

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: red;">If a DataFrame’s &nbsp;<code style="background-color: #fdf0d2;">index</code>&nbsp; and &nbsp;<code style="background-color: #fdf0d2;">columns</code>&nbsp; have their &nbsp;<code style="background-color: #fdf0d2;">name</code>&nbsp; attributes set , these will also be displayed :</span>

In [113]:

frame3

      Mumbai  Delhi
2000     1.5    NaN
2001     1.7    2.4
2002     3.6    2.9

In [114]:

print(frame3.index.name)                          # None         <-------         Int64Index([2000, 2001, 2002], dtype='int64')

print(frame3.columns.name)                        # None         <-------         Index(['Mumbai', 'Delhi'], dtype='object')

None
None

In [115]:

frame3.index.name = "year"

frame3.columns.name = "state"

frame3

state  Mumbai  Delhi
year
2000      1.5    NaN
2001      1.7    2.4
2002      3.6    2.9

In [116]:

print(frame3.index.name)                          # year         <-------         Int64Index([2000, 2001, 2002], dtype='int64', name='year')

print(frame3.columns.name)                        # state        <-------         Index(['Mumbai', 'Delhi'], dtype='object', name='state')

year
state

<br>

<strong>Note</strong> &nbsp;&nbsp;-&nbsp;&nbsp; <span style="color: #a245ff;"> Unlike Series , DataFrame does not have a name attribute </span>

In [117]:

frame3.name

AttributeError: 'DataFrame' object has no attribute 'name'

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">DataFrame's &nbsp;<code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">df</span>.to_numpy()</code>&nbsp; method returns the data contained in the DataFrame as a <strong>two-dimensional ndarray</strong> :</span>

In [118]:

frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

<br>

<span style="color: #a245ff;">If the DataFrame’s columns are <strong>different data types</strong>, the data type of the returned array will be chosen <strong>to accommodate all of the columns</strong> :</span>

In [119]:

frame2.to_numpy()

array([[2000, 'Mumbai', 1.5, nan, 5.5],
       [2001, 'Mumbai', 1.7, nan, 7.6],
       [2002, 'Mumbai', 3.6, -1.2, 8.1],
       [2001, 'Delhi', 2.4, nan, 6.2],
       [2002, 'Delhi', 2.9, -1.5, 7.9],
       [2003, 'Delhi', 3.2, -1.7, 7.0]], dtype=object)

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Difference between &nbsp;<code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">series</span>.map()</code>&nbsp; & &nbsp;<code style="background-color: #ffff62;"><span style="color: #a245ff; font-size: 0.8rem;">dataframe</span>.applymap()</code>&nbsp; :</span>


###### &nbsp;

&nbsp;<code style="background-color: blue; color: white;">map()</code> &nbsp;&nbsp;<span style="color: blue;">works on series , not dataframe</span>


<pre style="font-size: 0.8rem; color: #aaaaa9; margin-left: 68px;">
A DataFrame doesn't directly support element-wise lookups for a single column using <code style="background-color: #fff2a7;">.map()</code>. When you pass a DataFrame to <code style="background-color: #fff2a7;">.map()</code>, pandas tries to interpret the DataFrame as a single value or function, which leads to confusion and results in the <span style="color: red;">ambiguous truth-value error</span>.

Specifically, <code style="background-color: #fff2a7;">.map()</code> doesn't know how to process a DataFrame directly, as it is neither a callable function nor a dictionary-like object.
</pre>

<div style="margin-left: 154px;">

![](../media/pandas_dataframe_23.PNG)

</div>

<span style="font-size: 0.7rem; color: red;">■</span> &nbsp;<span style="color: red;">Using &nbsp;a &nbsp;<strong>Function</strong> &nbsp;:</span> &nbsp;&nbsp;<span style="color: #a245ff;">Apply a <strong>lambda</strong> or <strong>custom function</strong> to <u>each element</u> in a series</span>


<pre style="background-color: #fffbc5; width: 400px; font-size: 0.82rem; margin-left: 155px; color: #abb2b9;">

  pd.Series([1, 2, 3, 4, 5]).<span style="color: red;">map(</span><span style="color: black;">lambda x: x * 2</span><span style="color: red;">)</span>
    
</pre>

In [39]:

data = pd.Series([1, 2, 3, 4, 5])                       # Sample data

data.map(lambda x: x * 2)                                 # Multiply each element by 2
                                                          # pd.Series([1, 2, 3, 4, 5]).map(lambda x: x * 2)

0     2
1     4
2     6
3     8
4    10
dtype: int64

<br>

<span style="font-size: 0.7rem; color: red;">■</span> &nbsp;<span style="color: red;">Using &nbsp;a &nbsp;<strong>Dictionary</strong> &nbsp;:</span> &nbsp;&nbsp;<span style="color: #a245ff;">Map specific values to new ones</span>

<pre style="background-color: #fffbc5; width: 500px; font-size: 0.82rem; margin-left: 167px; color: #abb2b9;">
    
  pd.Series([1, 2, 3, 4, 5]).<span style="color: red;">map(</span><span style="color: black;">{1: 'One', 2: 'Two', 3: 'Three'}</span><span style="color: red;">)</span>
    
</pre>

In [31]:

# Sample data
data = pd.Series([1, 2, 3, 4, 5])                         


# Map values based on a dictionary
mapping = {1: 'One', 2: 'Two', 3: 'Three'}                
data.map(mapping)                                         # pd.Series([1, 2, 3, 4, 5]).map({1: 'One', 2: 'Two', 3: 'Three'})

0      One
1      Two
2    Three
3      NaN
4      NaN
dtype: object

<br>

<span style="font-size: 0.7rem; color: red;">■</span> &nbsp;<span style="color: red;">Using &nbsp;another &nbsp;<strong>Series</strong> &nbsp;:</span> &nbsp;&nbsp;<span style="color: #a245ff;">Map using another Series (index-based mapping)</span>

<pre style="background-color: #fffbc5; width: 540px; font-size: 0.82rem; margin-left: 180px; color: #abb2b9;">
    
  pd.Series([1, 2, 3]).<span style="color: red;">map(</span><span style="color: black;">pd.Series(['A', 'B', 'C'], index=[1, 2, 3])</span><span style="color: red;">)</span>
    
</pre>

In [42]:

# Sample data
data = pd.Series([1, 2, 3])
mapping_series = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])


# Map values from the other Series
data.map(mapping_series)                                  # pd.Series([1, 2, 3]).map(pd.Series(['A', 'B', 'C'], index=[1, 2, 3]))

0    A
1    B
2    C
dtype: object


<div style="margin-left: 180px;">

![](../media/pandas_dataframe_24.PNG)

</div>


<span style="font-size: 0.7rem; color: red;">■</span> &nbsp;<span style="color: red;">Ignore &nbsp;<code>NaN</code> &nbsp;values &nbsp;:</span> &nbsp;&nbsp;<span style="color: #a245ff;">If the Series contains <code>NaN</code> , you can choose to skip mapping them.</span>

<pre style="background-color: #fffbc5; width: 700px; font-size: 0.82rem; margin-left: 168px; color: #abb2b9;">
    
  pd.Series([1, 2, <span style="color: #04d007;"><strong>None</strong></span>, 4]).<span style="color: red;">map(</span><span style="color: black;">lambda x: x * 2 if x is not None else x<span style="color: red; font-size: 1rem;">,</span> <span style="color: #04d007;"><strong>na_action='ignore'</strong></span></span><span style="color: red;">)</span>
    
</pre>

In [45]:

data = pd.Series([1, 2, None, 4])                                                  # Sample data with NaN

data.map(lambda x: x * 2 if x is not None else x, na_action='ignore')              # Map values and ignore NaN while multiplying every element by 2

0    2.0
1    4.0
2    NaN
3    8.0
dtype: float64

In [47]:

pd.Series([1, 2, None, 4]).map(lambda x: x * 2 if x is not None else x, na_action='ignore')

0    2.0
1    4.0
2    NaN
3    8.0
dtype: float64


<br>

<strong><u>Key Use Cases</u></strong>
- <span style="color: #04ce07;">Data Transformation &nbsp;===<span style="font-size: 1rem;">&nbsp;</span>===>&nbsp;</span> Modify or scale data using a function
- <span style="color: #04ce07;">Value Mapping  &nbsp;==========>&nbsp;</span> Replace values based on a dictionary or another Series
- <span style="color: #04ce07;">Handling Missing Values  &nbsp;====>&nbsp;</span> Apply transformations while ignoring <code>NaN</code>


###### &nbsp;

&nbsp;<code style="background-color: blue; color: white;">applymap()</code> &nbsp;&nbsp;<span style="color: blue;">works on dataframe , not series</span>


<br>

<div style="margin-left: 154px;">

![](../media/pandas_dataframe_25.PNG)

</div>

<br>

<span style="font-size: 0.7rem; color: red;">■</span> &nbsp;<span style="color: red;">Basic &nbsp;Example &nbsp;:</span> &nbsp;&nbsp;<span style="color: #a245ff;">Apply a function to transform each element</span>

In [57]:

df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})                                                  # Sample DataFrame


df.applymap(lambda x: x * 2)                        # Multiply each element by 2

   A   B   C
0  2   8  14
1  4  10  16
2  6  12  18


<span style="font-size: 0.7rem; color: red;">■</span> &nbsp;<span style="color: red;">Apply &nbsp;a &nbsp;String &nbsp;Function &nbsp;:</span> &nbsp;&nbsp;<span style="color: #a245ff;">Transform string values in a DataFrame</span>

In [58]:

df = pd.DataFrame({
    'A': ['alice', 'bob', 'charlie'],
    'B': ['david', 'eve', 'frank']
})                                        

df                                                  # Sample dataframe

         A      B
0    alice  david
1      bob    eve
2  charlie  frank

In [59]:

df.applymap(str.capitalize)                         # Capitalize each string

         A      B
0    Alice  David
1      Bob    Eve
2  Charlie  Frank


<span style="font-size: 0.7rem; color: red;">■</span> &nbsp;<span style="color: red;">Conditional &nbsp;Transformation &nbsp;:</span> &nbsp;&nbsp;<span style="color: #a245ff;">Apply logic to transform elements</span>

In [64]:

df = pd.DataFrame({
    'A': [1, -2, 3],
    'B': [-4, 5, -6]
})


df                                                  # Sample DataFrame

   A  B
0  1 -4
1 -2  5
2  3 -6

In [63]:

df.applymap(lambda x: x if x > 0 else 0)            # Replace negatives with 0

   A  B
0  1  0
1  0  5
2  3  0


<strong><u>Key Use Cases</u></strong>
- <span style="color: #04ce07;">Element-wise Operations &nbsp;====>&nbsp;</span> Apply a transformation to each element of a DataFrame
- <span style="color: #04ce07;">Data Cleaning  &nbsp;===========>&nbsp;</span> Replace, transform, or format specific data elements
- <span style="color: #04ce07;">Custom Logic  &nbsp;=====<span style="font-size: 1rem;">=</span>=====>&nbsp;</span> Apply conditional transformations or custom functions


###### &nbsp;

<code style="background-color: black; color: white; font-size: 0.82rem; padding: 2px;"> Example </code> &nbsp;&nbsp;<span style="color: #ff00dc;">Filter groups based on a condition</span> &nbsp;<span style="color: #a245ff;"> - &nbsp;&nbsp;Retain &nbsp;only &nbsp;groups &nbsp;where &nbsp;<code>average salary > 55000</code></span>

In [104]:

df = pd.DataFrame({
    'Department': ['HR', 'Finance', 'HR', 'Finance', 'HR'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 60000, 45000, 70000, 52000],
    'Years': [3, 4, 2, 5, 3]
})


df                                                                                 # Example dataset

  Department Employee  Salary  Years
0         HR    Alice   50000      3
1    Finance      Bob   60000      4
2         HR  Charlie   45000      2
3    Finance    David   70000      5
4         HR      Eve   52000      3

<code style="background-color: black; color: white;  font-size: 0.82rem; padding: 2px;"> Solution </code>

In [106]:

df[df['Department'].map(df.groupby('Department')['Salary'].mean() > 55000)]

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5


<code style="color: white; background-color: #c64dff;  font-size: 0.82rem; padding: 2px;">Explaination</code>

<code style="color: #c64dff; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u><strong>Step-1</strong></u></code>

In [19]:

df.groupby('Department')['Salary'].mean()                                               # returns a series  ====>  group wise mean salary

Department
Finance    65000.0
HR         49000.0
Name: Salary, dtype: float64


<code style="color: #c64dff; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u><strong>Step-2</strong></u></code>

In [18]:

df.groupby('Department')['Salary'].mean() > 55000                                       # filter groups based on a condition
                                                                                        # series1

Department
Finance     True
HR         False
Name: Salary, dtype: bool


<code style="color: #c64dff; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u><strong>Step-3</strong></u></code>

In [17]:

df['Department']                                                                        # series2

0         HR
1    Finance
2         HR
3    Finance
4         HR
Name: Department, dtype: object


<code style="color: #c64dff; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u><strong>Step-4</strong></u></code>


<pre style="color: #ff41f1; font-size: 0.84rem; margin-top: -1px; margin-left: 50px;">
<font size="+2">⭐</font>&nbsp;<code style="background-color: #fff1bd; padding: 2px;">series2<span style="color: red;">.map(</span>series1<span style="color: red;">)</span></code>  ===>  maps results (<span style="color: black;">series1</span>) back to the original index (<span style="color: black;">series2</span>)

</pre>

In [16]:

df['Department'].map(df.groupby('Department')['Salary'].mean() > 55000)                 # index based mapping
                                                                                        # series2.map(series1)

0    False
1     True
2    False
3     True
4    False
Name: Department, dtype: bool


<pre style="font-size: 0.8rem; color: #ff41f1; margin-left: 25px;">
    <font size="+2">⭐</font>&nbsp;<code style="background-color: #fffbc5; padding-top: 2px; padding-bottom: 2px;">series2.<span style="color: red;">map(</span>series1<span style="color: red;">)</span></code>  ===>  the length of the <span style="color: black;">series1</span> is <span style="color: black;"><u><span style="color: #ff41f1;">not same</span></u></span> as that of the <span style="color: black;">series2</span>
                                <span style="margin-left: -3px;">===></span>  <span style="margin-left: 2px;">however, it returns a series of the <span style="color: black;"><u><span style="color: #ff41f1;">length same as that of <span style="color: black;">series2</span></span></u></span> and <span style="color: black;"><u><span style="color: #ff41f1;">values same as that of the <span style="color: black;">series1</span></span></u></span></span>
</pre>

<br>

<code style="color: #c64dff; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u><strong>Step-5</strong></u></code>  <span style="color: #03dc24;"><strong>(solution)</strong></span>

In [15]:

df[df['Department'].map(df.groupby('Department')['Salary'].mean() > 55000)]             # df[boolean_series]  --->  filtering rows based on a condition

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5


<span style="color: blue;"><strong><u>Note</u></strong></span>


<div style="margin-left: 10px;">

![](../media/pandas_dataframe_26.PNG)

</div>

<strong>Key Difference</strong>
- <code style="background-color: yellow;">.map()</code> &nbsp;operates &nbsp;on &nbsp;a &nbsp;<span style="color: blue;">Series</span>, &nbsp;transforming &nbsp;its &nbsp;values &nbsp;based &nbsp;on &nbsp;a &nbsp;function, &nbsp;dictionary, &nbsp;or &nbsp;Series.
- <code style="background-color: yellow;">.applymap()</code> &nbsp;operates &nbsp;on &nbsp;each &nbsp;element &nbsp;of &nbsp;a &nbsp;<span style="color: blue;">DataFrame</span> &nbsp;independently, &nbsp;and &nbsp;is &nbsp;not &nbsp;designed &nbsp;to &nbsp;work &nbsp;with &nbsp;mappings &nbsp;or &nbsp;lookups &nbsp;or &nbsp;groupby &nbsp;functions.


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Different ways of <strong>selecting a list of specific columns&nbsp; :</strong></span>

In [57]:

df = pd.DataFrame({
    'Department': ['HR', 'Finance', 'HR', 'Finance', 'HR'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 60000, 45000, 70000, 52000],
    'Years': [3, 4, 2, 5, 3]
})


df                                                                      # Example dataset

  Department Employee  Salary  Years
0         HR    Alice   50000      3
1    Finance      Bob   60000      4
2         HR  Charlie   45000      2
3    Finance    David   70000      5
4         HR      Eve   52000      3


###### <span style="color: #ff06f0; font-size: 0.9rem;">Selecting &nbsp;all &nbsp;columns</span>

In [74]:

df                                                                    # Method-1      recommended
df[['Department', 'Employee', 'Salary', 'Years']]                     # Method-2      using double square brackets
df[df.columns]                                                        # Method-3      using df.columns
df.loc[:, df.columns]                                                 # Method-4      using  loc[]  and  df.columns
df.loc[:, :]                                                          # Method-5      using loc[]
df.iloc[:, :]                                                         # Method-6      using iloc[]
df.apply(lambda row : row, axis=1)                                    # Method-7      using apply() ---------------->  prints each row one by one
df.apply(lambda column : column, axis=0)                              # Method-8      using apply() ---------------->  prints each column one by one
df.filter(items=df.columns)                                           # Method-9      using filter()
df[[col for col in df.columns if col in df.columns]]                  # Method-10     using List Comprehension  ---->  case-insensitive selection

  Department Employee  Salary  Years
0         HR    Alice   50000      3
1    Finance      Bob   60000      4
2         HR  Charlie   45000      2
3    Finance    David   70000      5
4         HR      Eve   52000      3


###### <span style="color: #ff06f0; font-size: 0.9rem;">Selecting &nbsp;a &nbsp;specific &nbsp;list &nbsp;of &nbsp;columns</span> &nbsp;&nbsp;&nbsp;<span style="color: #8f0cfd;">===>&nbsp;&nbsp;&nbsp; "Salary" &nbsp;& &nbsp;"Years"</span>

In [76]:

df[['Salary', 'Years']]                                               # Method - 1    using  double brackets  ------------->  recommended
df.loc[:, ['Salary', 'Years']]                                        # Method - 2    using  loc[]
df.iloc[:, [2, 3]]                                                    # Method - 3    using  iloc[]  with  Index  Positions
df.filter(items=['Salary', 'Years'])                                  # Method - 4    using  filter()
df.apply(lambda row : row[['Salary', 'Years']], axis=1)               # Method - 5    using  apply()
df[[col for col in df.columns if col in ['Salary', 'Years']]]         # Method - 6    using  List  Comprehension  --------->  case-insensitive selection


df.select_dtypes(include='number')                                    # Method - 7    using  select_dtypes()   ------------>  select all numeric columns
df.loc[:, df.select_dtypes(include='number').columns]                 # Method - 8    using  loc[]  &  select_dtypes()  --->  select all numeric columns

   Salary  Years
0   50000      3
1   60000      4
2   45000      2
3   70000      5
4   52000      3

In [80]:

df.select_dtypes(exclude='number')                                    # select all non-numeric columns

  Department Employee
0         HR    Alice
1    Finance      Bob
2         HR  Charlie
3    Finance    David
4         HR      Eve

In [79]:

df.select_dtypes(include='object')                                    # by default, string columns in a DataFrame have the 'dtype' object

  Department Employee
0         HR    Alice
1    Finance      Bob
2         HR  Charlie
3    Finance    David
4         HR      Eve

In [81]:

df['Employee'] = df['Employee'].astype('string')                      # Convert Object Column to String Dtype
df['Department'] = df['Department'].astype('string')                  # same as above


df.select_dtypes(include='string')                                    # Select Columns with String Dtype

  Department Employee
0         HR    Alice
1    Finance      Bob
2         HR  Charlie
3    Finance    David
4         HR      Eve

In [82]:

df.select_dtypes(include='object')                                    # now that object type columns are converted to string type, 
                                                                      # there is no object type column anymore

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]


###### <span style="color: #ff06f0; font-size: 0.9rem;">Selecting columns whose names contain the substring &nbsp;<code>'Sa'</code></span>

In [83]:

df.filter(like='Sa', axis=1)                                          # Select columns whose names contain the substring 'Sa'

   Salary
0   50000
1   60000
2   45000
3   70000
4   52000


<span style="color: blue;"><strong>NOTE</strong> &nbsp;-&nbsp; Syntax &nbsp;of &nbsp;all &nbsp;these &nbsp;methods &nbsp;will &nbsp;covered &nbsp;in &nbsp;subsequent &nbsp;sections</span>

<br>

### <div style="color: black; background-color: #ffe9c8; padding-top: 10px; padding-bottom: 10px; padding-right: 10px;"> <code style="font-size: 1.3rem; background-color: #ffe9c8; color: red;"><strong>Index Objects</strong></code></div>

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<div style="display: flex;">
<div><span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span>&nbsp;&nbsp;&nbsp;</div>
<div><span style="color: #f76607;">pandas’s Index objects are responsible for holding the <u>axis labels</u> <span style="font-size: 1rem;">(</span> including a <strong>DataFrame's column names</strong> <span style="font-size: 1rem;">)</span> and other <u>metadata</u> <span style="font-size: 1rem;">(</span> like the axis name or names <span style="font-size: 1rem;">)</span>. <br>
Any array or other sequence of labels you use when constructing a Series or DataFrame is <u>internally converted to an Index</u> :</span></div>
</div>

In [120]:

obj = pd.Series(np.arange(3), index=["a", "b", "c"])

obj

a    0
b    1
c    2
dtype: int32

In [121]:

index = obj.index

index

Index(['a', 'b', 'c'], dtype='object')

In [122]:

index[1:]

Index(['b', 'c'], dtype='object')

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Index objects are <strong>immutable</strong> and thus <u>can’t be modified</u> by the user :</span>

In [125]:

index[1] = "d"

TypeError: Index does not support mutable operations


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;"><strong>Immutability</strong> <u>makes it safer to share Index objects</u> among data structures :</span>

In [5]:

labels = pd.Index(np.arange(3))

labels

Int64Index([0, 1, 2], dtype='int64')

In [127]:

obj2 = pd.Series([1.5, -2.5, 0], index=labels)

obj2

0    1.5
1   -2.5
2    0.0
dtype: float64


<br>

<div style="padding: 10px; background-color: #fff6f6; color: #a245ff;">
Some users will not often take advantage of the capabilities provided by an Index, but because some operations will yield results containing indexed data, it's important to understand how they work .
</div>

<span style="color: #a245ff;"></span>


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">In addition to being array-like, an Index also behaves like a fixed-size set :</span>

In [128]:

frame3

state  Mumbai  Delhi
year
2000      1.5    NaN
2001      1.7    2.4
2002      3.6    2.9

In [129]:

frame3.columns

Index(['Mumbai', 'Delhi'], dtype='object', name='state')

In [130]:

"Mumbai" in frame3.columns

True

In [131]:

2003 in frame3.index

False


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Unlike Python sets , a pandas Index <u>can contain <strong>duplicate labels</strong></u> :</span>

In [132]:

pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Selections with duplicate index labels will select <strong>all occurrences</strong> of that label :</span>

<br>

<span style="background-color: #1ec410; color: white; padding:5px;"> <font size="+1">↳</font> &nbsp;<strong>Series</strong> &nbsp;with &nbsp;duplicate &nbsp;index &nbsp;labels</span>

In [133]:

data = pd.Series([10, 20, 30, 40], index=["a", "b", "a", "c"])                         # Creating a Series with duplicate index labels

print(data)

a    10
b    20
a    30
c    40
dtype: int64


<span style="color: #a245ff;">Notice that the label &nbsp;<code style="background-color: #f5d2fd;">"a"</code>&nbsp; is duplicated.</span>

In [134]:

print(data["a"])                                                                       # Selecting the duplicate label 'a'

a    10
a    30
dtype: int64


<span style="color: #a245ff;">Here, both values corresponding to the label &nbsp;<code style="background-color: #f5d2fd;">"a"</code>&nbsp; are included in the result.</span>

<br>

<span style="background-color: #1ec410; color: white; padding:5px;"> <font size="+1">↳</font> &nbsp;<strong>Dataframe</strong> &nbsp;with &nbsp;duplicate &nbsp;index &nbsp;labels</span>

In [26]:

df = pd.DataFrame({"col1": [1, 2, 3, 4], 
                   "col2": [10, 20, 30, 40]
                  }, index=["a", "b", "a", "c"])                                       # Creating a DataFrame with duplicate index labels


df

   col1  col2
a     1    10
b     2    20
a     3    30
c     4    40


<span style="color: #a245ff;">Notice that the label &nbsp;<code style="background-color: #f5d2fd;">"a"</code>&nbsp; is duplicated.</span>

In [27]:

df.loc["a"]

   col1  col2
a     1    10
a     3    30


<span style="color: #a245ff;">Here, both values corresponding to the label &nbsp;<code style="background-color: #f5d2fd;">"a"</code>&nbsp; are included in the result.</span>

<br>

<span style="background-color: #1ec410; color: white; padding:5px;"> <font size="+1">↳</font> &nbsp;Key &nbsp;Implications &nbsp;of &nbsp;Duplicate &nbsp;Index &nbsp;Labels</span>

<div style="margin-left: 30px;">
    
1. &nbsp;<span style="color: blue;"><strong>Selection Behavior</strong></span> :

<div style="margin-left: 40px;">
    
- Duplicate index labels return <span style="color: red;">all matching rows or elements</span>
- This contrasts with sets or dictionaries, which enforce uniqueness and overwrite duplicate keys

</div>

2. &nbsp;<span style="color: blue;"><strong>Operations on Duplicate Index</strong></span> :

<div style="margin-left: 40px;">

- Some operations <span style="font-size: 1rem;">( </span>e.g., &nbsp;<code style="background-color: #ffff62;">.groupby()</code> , &nbsp;<code style="background-color: #ffff62;">.reset_index()</code> , &nbsp;<code style="background-color: #ffff62;">.reindex()</code> <span style="font-size: 1rem;">)</span> may be impacted by duplicate index labels. 

</div>

</div>

In [28]:

print(df.index.is_unique)

False

In [29]:

grouped = df.groupby(df.index).sum()

grouped

   col1  col2
a     4    40
b     2    20
c     4    40

In [30]:

df = df.reset_index(drop=False)           # drop = False   ---->   default   ---->   to retain the current index as a column in the resulting DataFrame

df

  index  col1  col2
0     a     1    10
1     b     2    20
2     a     3    30
3     c     4    40


<br>

<span style="background-color: #1ec410; color: white; padding:5px;"> <font size="+1">↳</font> &nbsp;Ensuring &nbsp;Unique &nbsp;Index &nbsp;Labels</span>

<div style="margin-left: 40px;">

To drop rows with duplicate index labels :

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Method - 1 &nbsp;&nbsp;<span style="font-size: 1rem;">➜</span>&nbsp;&nbsp; <code style="padding: 7px; background-color: #cdffc2;">df.<span style="color: red;">reset_index()</span>.<span style="color: red;">drop_duplicates(</span>subset="index"<span style="color: red;">)</span>.set_index("index")</code>

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Method - 2 &nbsp;&nbsp;<span style="font-size: 1rem;">➜</span>&nbsp;&nbsp; <code style="padding: 7px; background-color: #cdffc2;">df.loc[~df.index.<span style="color: red;">duplicated(</span>keep='first'<span style="color: red;">)</span>]                         </code>

</div>

In [140]:

df = pd.DataFrame({"col1": [1, 2, 3, 4], 
                   "col2": [10, 20, 30, 40]
                  }, index=["a", "b", "a", "c"])                                       # Creating a DataFrame with duplicate index labels

df

   col1  col2
a     1    10
b     2    20
a     3    30
c     4    40


<div style="margin-left: 40px;">

1. &nbsp;&nbsp;<code style="background-color: #ffff62;">.drop_duplicates()</code>  &nbsp;&nbsp;&  &nbsp;&nbsp;<code style="background-color: #ffff62;">.reset_index()</code>

<div style="margin-left: 60px;">
<code>drop_duplicates()</code>&nbsp; can't be used directly in isolation because it operates on the data, <strong>not the index</strong>. <br>
<code>drop_duplicates()</code>&nbsp; is <span style="color: red;">primarily used to <strong>remove duplicate rows</strong> based on the data content</span> of the DataFrame or Series, not on the index.

</div>

</div>

In [141]:
# STEP-1

df.drop_duplicates()                       # cannot remove duplicates based on index

   col1  col2
a     1    10
b     2    20
a     3    30
c     4    40

In [142]:
# STEP-2

df.reset_index()                           # converts the index into a new column named "index" (lowercase)
                                           # Column names are case-sensitive in Pandas
                                           # df.reset_index(names="Index")     ------------------------------------>     custom name of the index column

  index  col1  col2
0     a     1    10
1     b     2    20
2     a     3    30
3     c     4    40

In [143]:
# STEP-3

df.reset_index().drop_duplicates(subset="index")

  index  col1  col2
0     a     1    10
1     b     2    20
3     c     4    40

In [144]:
# STEP-4

df.reset_index().drop_duplicates(subset="index").set_index("index")                # If you want to restore the index after removing duplicates

       col1  col2
index
a         1    10
b         2    20
c         4    40


<div style="margin-left: 40px;">

2. &nbsp;&nbsp;<code style="background-color: #ffff62;">.duplicated(keep="False")</code>

<div style="margin-left: 50px;">

- <code>keep = <span style="color: red;">'first'</span></code> &nbsp;&nbsp;:&nbsp;&nbsp; Keeps &nbsp;the &nbsp;<strong>first</strong> &nbsp;occurrence <br>
- <code>keep = <span style="color: red;">'last'</span> </code> &nbsp;&nbsp;:&nbsp;&nbsp; Keeps &nbsp;the &nbsp;<strong>last</strong> &nbsp;occurrence
- <code>keep =  <span style="color: red;">False</span> </code> &nbsp;&nbsp;:&nbsp;&nbsp; Removes &nbsp;<strong>all</strong> &nbsp;duplicates

</div>

</div>

In [145]:

df.index

Index(['a', 'b', 'a', 'c'], dtype='object')

In [146]:

df.index.duplicated(keep='first')

array([False, False,  True, False])

In [147]:

~df.index.duplicated(keep='first')

array([ True,  True, False,  True])

In [148]:

df.loc[~df.index.duplicated(keep='first')]

   col1  col2
a     1    10
b     2    20
c     4    40

In [370]:

# Drop rows with duplicate index labels

print("\nDataFrame after removing duplicate index labels (keeping the first) :\n")
df.loc[~df.index.duplicated(keep='first')]

DataFrame after removing duplicate index labels (keeping the first) :

   col1  col2
a     1    10
b     2    20
c     3    30


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;"><strong>Pandas Index <u>Methods</u></strong> and <strong>Properties :</strong></span> &nbsp;&nbsp;&nbsp;<font size="+1">⭐</font>

<span style="color: #a245ff; margin-left: 42px;">Pandas Index provides a variety of methods and properties to <strong>manipulate</strong> , <strong>query</strong> , and <strong>modify</strong> <u>index objects</u></span> <br>

<br>

<span style="color: black; margin-left: 370px;">Table &nbsp;-&nbsp; Some <u>important</u> Index methods and properties</span>

| Method / Property | Description |
|-------------------|-------------|
| <code style="background-color: yellow;">append()      </code>	| &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Concatenate with additional Index objects, producing a new Index |
| <code style="background-color: yellow;">difference()  </code> | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Compute set difference as an Index |
| <code style="background-color: yellow;">intersection()</code> | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Compute set intersection  |
| <code style="background-color: yellow;">union()       </code> | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Compute set union  |
| <code style="background-color: yellow;">isin()        </code> | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Compute Boolean array indicating whether each value is contained in the passed collection |
| <code style="background-color: yellow;">delete()      </code> | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Compute new Index with element at Index &nbsp;<code style="background-color: #56dbff;"> i </code>&nbsp; deleted   |
| <code style="background-color: yellow;">drop()        </code> | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Compute new Index by deleting passed values   |
| <code style="background-color: yellow;">insert()      </code> | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Compute new Index by inserting element at Index &nbsp;<code style="background-color: #56dbff;"> i </code>    |
| <code style="background-color: yellow;">is_monotonic()</code> | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Returns &nbsp;<code style="background-color: #56dbff;">True</code>&nbsp; if each element is greater than or equal to the previous element |
 <code style="background-color: yellow;">is_unique()   </code> | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Returns True if the Index has no duplicate values  |
|<code style="background-color: yellow;">unique()      </code> | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Compute the array of unique values in the Index |

<span style="color: #a245ff; margin-left: 42px;">Here's a categorized list of the most commonly used ones :</span>

<br>

<span style="color: blue; margin-left: 42px;"><strong>1. &nbsp;Basic &nbsp;Properties</strong></span>

<div style="margin-left: 150px;">

![](../media/pandas_dataframe_10.PNG)

</div>

In [366]:

index = pd.Index([10, 20, 30, 40, 50], name="numbers")


print(".name  -------------------------> ", index.name)
print(".dtype  ------------------------> ", index.dtype)
print(".nlevels  ----------------------> ", index.nlevels)
print(".size  -------------------------> ", index.size)
print(".shape  ------------------------> ", index.shape)
print(".is_unique  --------------------> ", index.is_unique)
print(".has_duplicates  ---------------> ", index.has_duplicates)
print(".empty  ------------------------> ", index.empty)

.name  ------------------------->  numbers
.dtype  ------------------------>  int64
.nlevels  ---------------------->  1
.size  ------------------------->  5
.shape  ------------------------>  (5,)
.is_unique  -------------------->  True
.has_duplicates  --------------->  False
.empty  ------------------------>  False

<br>

<span style="color: blue; margin-left: 42px;"><strong>2. &nbsp;Selection &nbsp;and &nbsp;Query &nbsp;Methods</strong></span>

<div style="margin-left: 150px;">

![](../media/pandas_dataframe_11.PNG)

</div>

In [368]:

index = pd.Index([10, 20, 30, 40, 50], name="numbers")


print(".get_loc(30)  ---------------------------> ", index.get_loc(30))
print(".get_indexer([10, 30, 100])  ------------> ", index.get_indexer([10, 30, 40, 100]))
print(".get_level_values(0)  -------------------> ", index.get_level_values(0))
print(".slice_locs(1, 3)  ----------------------> ", index.slice_locs(1, 3))
print(".where(index > 20)  ---------------------> ", index.where(index > 20))

.get_loc(30)  --------------------------->  2
.get_indexer([10, 30, 100])  ------------>  [ 0  2  3 -1]
.get_level_values(0)  ------------------->  Int64Index([10, 20, 30, 40, 50], dtype='int64', name='numbers')
.slice_locs(1, 3)  ---------------------->  (0, 0)
.where(index > 20)  --------------------->  Float64Index([nan, nan, 30.0, 40.0, 50.0], dtype='float64', name='numbers')

<br>

<span style="color: blue; margin-left: 42px;"><strong>3. &nbsp;Transformation &nbsp;Methods</strong></span>

<div style="margin-left: 150px;">

![](../media/pandas_dataframe_12.PNG)

</div>

In [387]:

index = pd.Index([10, 20, 30, 40, 50], name="numbers")

print(".append(pd.Index([60, 70, 80, 90]))  ------> ", index.append(pd.Index([60, 70, 80, 90])))
print(".astype(float)  ---------------------------> ", index.astype(float))
print(".sort_values()  ---------------------------> ", index.sort_values())
print(".sortlevel(0)  ----------------------------> ", index.sortlevel())
print(".to_list()  -------------------------------> ", index.to_list())
print(".to_numpy()  ------------------------------> ", index.to_numpy())

.append(pd.Index([60, 70, 80, 90]))  ------>  Int64Index([10, 20, 30, 40, 50, 60, 70, 80, 90], dtype='int64')
.astype(float)  --------------------------->  Float64Index([10.0, 20.0, 30.0, 40.0, 50.0], dtype='float64', name='numbers')
.sort_values()  --------------------------->  Int64Index([10, 20, 30, 40, 50], dtype='int64', name='numbers')
.sortlevel(0)  ---------------------------->  (Int64Index([10, 20, 30, 40, 50], dtype='int64', name='numbers'), array([0, 1, 2, 3, 4], dtype=int64))
.to_list()  ------------------------------->  [10, 20, 30, 40, 50]
.to_numpy()  ------------------------------>  [10 20 30 40 50]

In [298]:

index.to_frame()

         numbers
numbers
10            10
20            20
30            30
40            40
50            50

<br>

<code style="background-color: #ffff62; margin-left: 155px;">Index.<span style="font-size: 1rem;"><strong>map</strong>(</span><span style="color: #a245ff; font-size: 0.8rem;">func</span><span style="font-size: 1rem;">)</span></code>

<div style="margin-left: 190px;">

- <code style="background-color: #ffff62;">func</code> &nbsp;➜&nbsp; A function, dictionary, or Series.
- This &nbsp;<code style="background-color: #f3d7ff;">index.map(func)</code>&nbsp; method applies a function (&nbsp;<code style="background-color: #f3d7ff;">func</code>&nbsp;) <span style="color: blue;"><strong>element-wise to each value</strong></span> in the index of a Pandas Series or DataFrame. <br>
- This is a versatile method <span style="color: blue;"><strong>for transforming or mapping the values</strong></span> in an index.
- <code style="background-color: #f3d7ff;">Inplace Update</code> &nbsp;:&nbsp; To permanently update the index , you need to reassign the result back to the index.

</div>

In [63]:
# Basic Transformation


df = pd.DataFrame({'value': [10, 20, 30]}, index=['a', 'b', 'c'])
df.index = df.index.map(str.upper)
df

   value
A     10
B     20
C     30

In [70]:
# Using a Custom Function


df = pd.DataFrame({'value': [10, 20, 30]}, index=['a', 'b', 'c'])
df.index = df.index.map(lambda x: f"index_{x.upper()}")                                    # adds a prefix to each index
df

         value
index_A     10
index_B     20
index_C     30

In [65]:
# Mapping with a dictionary


mapping = {'index_A': 'Alpha', 'index_B': 'Beta', 'index_C': 'Gamma'}
df.index = df.index.map(mapping)
df

       value
Alpha     10
Beta      20
Gamma     30

In [66]:
# Mapping with a Series


map_series = pd.Series({'Alpha': 'A1', 'Beta': 'B1', 'Gamma': 'C1'})                       # creates a Series for mapping
df.index = df.index.map(map_series)                                                        # maps using a Series
df

    value
A1     10
B1     20
C1     30

In [67]:
# Applying Mathematical Operations


df_numeric = pd.DataFrame({'value': [10, 20, 30]}, index=[1, 2, 3])                        # creates a Dataframe
df_numeric.index = df_numeric.index.map(lambda x: x ** 2)                                  # squares the index values
df_numeric

   value
1     10
4     20
9     30

In [68]:
# Filtering or Conditional Mapping


df.index = df.index.map(lambda x: x if 'A' in x else 'Other')                              # conditionally rename index values
df

       value
A1        10
Other     20
Other     30


<span style="color: blue; margin-left: 42px;"><strong>4. &nbsp;Boolean &nbsp;/ &nbsp;Logical &nbsp;Methods</strong></span>

<div style="margin-left: 150px;">

![](../media/pandas_dataframe_13.PNG)

</div>

In [45]:

index = pd.Index([10, 20, 30, 40, 50], name="numbers")


print(".isin([20, 40, 60, 80, 100])  ----------------------------------> ", index.isin([20, 40, 60, 80, 100]))
print(".duplicated(keep='first')  -------------------------------------> ", index.duplicated(keep="first"))
print(".equals(pd.Index([10, 20, 30, 40, 50], name='numbers'))  -------> ", index.equals(pd.Index([10, 20, 30, 40, 50], name="numbers")))

.isin([20, 40, 60, 80, 100])  ---------------------------------->  [False  True False  True False]
.duplicated(keep='first')  ------------------------------------->  [False False False False False]
.equals(pd.Index([10, 20, 30, 40, 50], name='numbers'))  ------->  True

<br>

<span style="color: blue; margin-left: 42px;"><strong>5. &nbsp;String &nbsp;Operations &nbsp;(For &nbsp;String-Based &nbsp;Index)</strong></span>

<span style="color: #a245ff; margin-left: 62px;">String methods can be accessed using &nbsp;<code style="background-color: #b6fffe;">.str</code>&nbsp; on the index.</span>

<div style="margin-left: 150px;">

![](../media/pandas_dataframe_14.PNG)

</div>

In [42]:

index = pd.Index(["Apple", "Banana", "Cherry"], name="fruits")


print("index.str.lower() --------------> ", index.str.lower())
print("index.str.upper() --------------> ", index.str.upper())
print("index.str.len() ----------------> ", index.str.len())

index.str.lower() -------------->  Index(['apple', 'banana', 'cherry'], dtype='object', name='fruits')
index.str.upper() -------------->  Index(['APPLE', 'BANANA', 'CHERRY'], dtype='object', name='fruits')
index.str.len() ---------------->  Int64Index([5, 6, 6], dtype='int64', name='fruits')

<br>

<code style="background-color: yellow; margin-left: 155px;">.str.contains(<span style="color: #a245ff; font-size: 0.7rem;">pattern</span>)</code>

<br>

<div style="margin-left: 190px;">

![](../media/pandas_dataframe_18.PNG)

</div>

<br>

<div style="margin-left: 500px;">
    
<code style="background-color: #f2d2ff;">Index.str.contains()</code> works similar to <code style="background-color: #f2d2ff;">Series.str.contains()</code>
- <code style="background-color: #f2d2ff;">Index.str.contains() </code> &nbsp;operates directly on Index objects
- <code style="background-color: #f2d2ff;">Series.str.contains()</code> &nbsp;works on the Series values

</div>

<br>

<span style="color: #2da6fa; margin-left: 155px;"><strong><u>Example - 1</u></strong>   &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;➜&nbsp;&nbsp;&nbsp;&nbsp; Basic Substring Search</span>

In [34]:

df = pd.DataFrame({'count': [10, 20, 30]}, index=['apple', 'banana', 'cherry'])
df

        count
apple      10
banana     20
cherry     30

In [5]:

df.index.str.contains('app')

array([ True, False, False])

<br>

<span style="color: #2da6fa; margin-left: 155px;"><strong><u>Example - 2</u></strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;➜&nbsp;&nbsp;&nbsp;&nbsp; Case-Insensitive Matching</span>

In [19]:

index = pd.Index(['apple', 'banana', 'cherry'], name="fruits")
index.str.contains('app')

array([ True, False, False])


<br>

<span style="color: #2da6fa; margin-left: 155px;"><u><strong>Example - 3</u></strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;➜&nbsp;&nbsp;&nbsp;&nbsp; Using Regular Expressions</span>

In [28]:

df = pd.DataFrame({'count': [10, 20, 30]}, index=['apple', 'banana', 'cherry'])
df.index.str.contains(r'a$', regex=True)                                                  # Match strings ending with 'a'

array([False,  True, False])

<br>

<span style="color: #2da6fa; margin-left: 155px;"><u><strong>Example - 4</strong></u> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;➜&nbsp;&nbsp;&nbsp;&nbsp; Handling Missing Data (&nbsp;<code style="background-color: #a2fff4;">NaN</code>&nbsp;)</span>

In [21]:

index_with_nan = pd.Index(['apple', 'banana', None, 'cherry'])
index_with_nan.str.contains('app', na=None)

Index([True, False, None, False], dtype='object')

<br>

<span style="color: #2da6fa; margin-left: 250px;">Specify &nbsp;<code style="background-color: #a2fff4;">na=False</code>&nbsp; to treat &nbsp;<code style="background-color: #a2fff4;">NaN</code>&nbsp; as <strong>not containing the pattern</strong> :</span>

In [13]:

index_with_nan.str.contains('app', na=False)

array([ True, False, False, False])

<br>

<span style="color: #2da6fa; margin-left: 155px;"><strong><u>Example - 5</u></strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;➜&nbsp;&nbsp;&nbsp;&nbsp; Filtering Rows Based on Index</span>

In [31]:

df = pd.DataFrame({'count': [10, 20, 30]}, index=['apple', 'banana', 'cherry'])
df[df.index.str.contains('app')]                                                           # Filter rows where index contains 'app'

       count
apple     10

<br>

<code style="background-color: yellow; margin-left: 155px;">.str.replace(<span style="color: #a245ff; font-size: 0.7rem;">old</span>, <span style="color: #a245ff; font-size: 0.7rem;">new</span>)</code>

<br>

<span style="color: #2da6fa; margin-left: 155px;"><strong><u>Example - 1</u></strong></span>

In [32]:

df = pd.DataFrame({'count': [10, 20, 30]}, index=['apple', 'banana', 'cherry'])
df.index.str.replace('apple', 'avocado')

Index(['avocado', 'banana', 'cherry'], dtype='object')

In [33]:

df

        count
apple      10
banana     20
cherry     30

<span style="color: #2da6fa; margin-left: 155px;"><strong><u>Example - 2</u></strong></span>

In [30]:

index = pd.Index(["ten", "20", "30", "40"], name="numbers")
index.str.replace("ten", "10")

Index(['10', '20', '30', '40'], dtype='object', name='numbers')

<br>

<span style="color: blue; margin-left: 42px;"><strong>6. &nbsp;Numeric &nbsp;and &nbsp;Statistical &nbsp;Methods</strong></span>

<div style="margin-left: 150px;">

![](../media/pandas_dataframe_15.PNG)

</div>

In [47]:

index = pd.Index([10, 20, 30, 40, 50], name="numbers")

print(".min()  -------------------------> ", index.min())
print(".max()  -------------------------> ", index.max())
print(".unique()  ----------------------> ", index.unique())


print("\n\n.value_counts()  ----------------> ")
print(index.value_counts())


print("\n\n.argmin()  ----------------------> ", index.argmin())
print(".argmax()  ----------------------> ", index.argmax())

print(".sortlevel(0)  ------------------> ", index.sortlevel(0))

.min()  ------------------------->  10
.max()  ------------------------->  50
.unique()  ---------------------->  Int64Index([10, 20, 30, 40, 50], dtype='int64', name='numbers')


.value_counts()  ---------------->
10    1
20    1
30    1
40    1
50    1
Name: numbers, dtype: int64


.argmin()  ---------------------->  0
.argmax()  ---------------------->  4
.sortlevel(0)  ------------------>  (Int64Index([10, 20, 30, 40, 50], dtype='int64', name='numbers'), array([0, 1, 2, 3, 4], dtype=int64))

<br>

<span style="color: blue; margin-left: 42px;"><strong>7. &nbsp;Utility &nbsp;Methods</strong></span>

<div style="margin-left: 150px;">

![](../media/pandas_dataframe_16.PNG)

</div>

<br>

<code style="background-color: #ffff82; margin-left: 155px;">Index.where(<span style="color: red; font-size: 0.8rem;">condition</span>, <span style="color: #a245ff; font-size: 0.8rem;"><span style="color: red;">other</span>=nan</span>)</code>

<div style="margin-left: 180px;">

- <code style="background-color: #ffff82; font-size: 0.8rem; color: red;">condition</code> &nbsp;&nbsp;:&nbsp;&nbsp; A boolean array or condition that determines which values to keep

- <code style="background-color: #ffff82; font-size: 0.8rem; color: red;">other    </code> &nbsp;&nbsp;:&nbsp;&nbsp; The value to replace the elements that do not satisfy the condition. Default is &nbsp;<code style="background-color: #f8ebff;">NaN</code>

- <span style="color: #a245ff;">Similar to &nbsp;<code style="background-color: #a2fff4; font-size: 0.8rem; color: black;">Series.where()</code> &nbsp; & &nbsp; <code style="background-color: #a2fff4; font-size: 0.8rem; color: black;">Dataframe.where()</code></span>

- <span style="color: #a245ff;">It doesn't modify the original &nbsp;<code style="background-color: #f8ebff;">Index</code> ; &nbsp;instead, it returns a new &nbsp;<code style="background-color: #f8ebff;">Index</code>&nbsp; object with the applied changes</span>

- <span style="background-color: #f8ebff;"><strong>&nbsp;.where( )&nbsp;</strong></span> &nbsp;<span style="color: #a245ff;">is not supported for</span> <strong>MultiIndex</strong> <span style="color: #a245ff;">operations</span>

</div>

<br>

In [68]:

index = pd.Index([10, 15, 20, 25, 30])
index.where(index > 20)                                                 # Apply a condition to keep only values greater than 20

Float64Index([nan, nan, nan, 25.0, 30.0], dtype='float64')

In [69]:

index = pd.Index([10, 15, 20, 25, 30])
index.where(index > 20, other=0)                                        # Replace values that do not meet the condition with 0

Int64Index([0, 0, 0, 25, 30], dtype='int64')

In [70]:

index = pd.Index([5, 10, 15, 20, 25])
condition = [True, False, True, False, True]                            # Boolean array
index.where(condition)                                                  # Apply the condition array to filter values

Float64Index([5.0, nan, 15.0, nan, 25.0], dtype='float64')

<br>

<span style="color: blue; margin-left: 42px;"><strong>8. &nbsp;MultiIndex &nbsp;Methods</strong></span>

<div style="margin-left: 155px;">
    
A &nbsp;<code style="background-color: #f3d7ff;">MultiIndex</code>&nbsp; in Pandas is a <strong>hierarchical index</strong> that allows you to have <span style="color: red;">multiple levels (or tiers) of indexing</span> in your DataFrame or Series. <br>
This is particularly useful for working with <strong>high-dimensional data</strong> in a compact and intuitive way.

</div>

<span style="color: #09cc2c; background-color: white; margin-left: 156px;"><strong><u>Creating &nbsp;a &nbsp;MultiIndex</u></strong> &nbsp;<font size="+1">↴</font></span>

In [4]:
# from Lists or Arrays


arrays = [['A', 'A', 'B', 'B'], 
          [1, 2, 1, 2]]
multi_index = pd.MultiIndex.from_arrays(arrays, names=('letter', 'number'))
multi_index

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2)],
           names=['letter', 'number'])

In [5]:
# from Tuples


tuples = [('A', 1), 
          ('A', 2), 
          ('B', 1), 
          ('B', 2)]
multi_index = pd.MultiIndex.from_tuples(tuples, names=('letter', 'number'))
multi_index

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2)],
           names=['letter', 'number'])

In [6]:
# from Cartesian Product


letters = ['A', 'B']
numbers = [1, 2]
multi_index = pd.MultiIndex.from_product([letters, numbers], names=('letter', 'number'))
multi_index

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2)],
           names=['letter', 'number'])

In [7]:
# from DataFrame


data = {'letter': ['A', 'A', 'B', 'B'], 
        'number': [1, 2, 1, 2]
       }
df = pd.DataFrame(data)
multi_index = pd.MultiIndex.from_frame(df)
multi_index

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2)],
           names=['letter', 'number'])

<br>

<span style="color: #09cc2c; background-color: white; margin-left: 156px;"><strong><u>Using &nbsp;MultiIndex &nbsp;in &nbsp;DataFrame</u></strong> &nbsp;<font size="+1">↴</font></span>

In [8]:
# Creating a DataFrame with MultiIndex


index = pd.MultiIndex.from_product([['A', 'B'], [1, 2]], names=['letter', 'number'])           #  [('A', 1),
                                                                                               #   ('A', 2),
                                                                                               #   ('B', 1),
                                                                                               #   ('B', 2)]

data = np.arange(1, 5).reshape(4, 1)                                                           #  array([[1]
                                                                                               #         [2]
                                                                                               #         [3]
                                                                                               #         [4]])

df = pd.DataFrame(data, index=index, columns=['value'])
df

               value
letter number
A      1           1
       2           2
B      1           3
       2           4


<span style="color: #09cc2c; background-color: white; margin-left: 156px;"><strong><u>Accessing &nbsp;Data &nbsp;in &nbsp;MultiIndex</u></strong> &nbsp;<font size="+1">↴</font></span>

<span style="color: blue; margin-left: 158px;"><font size="+1">↳</font> &nbsp;using &nbsp;<code style="color: black; background-color: yellow;">.loc</code></span>

In [15]:

df.loc['A']                              # Access rows for letter 'A'    <-----------     df.loc[group]

        value
number
1           1
2           2

In [16]:

df.loc[('A', 1)]                         # Access specific cell      <---------------     df.loc[group, subgroup]

value    1
Name: (A, 1), dtype: int32

<br>

<span style="color: blue; margin-left: 158px;"><font size="+1">↳</font> &nbsp;Indexing &nbsp;Specific &nbsp;Levels</span>

In [13]:

df.xs(1, level='number')                 # Access all rows where the second level (number) is 1

        value
letter
A           1
B           3


<span style="color: blue; margin-left: 158px;"><font size="+1">↳</font> &nbsp;Slicing</span>

In [14]:

df.loc['A':'B']                          # Slice for rows from 'A' to 'B'

               value
letter number
A      1           1
       2           2
B      1           3
       2           4

<div style="margin-left: 150px;">

![](../media/pandas_dataframe_20.PNG)

</div>

<span style="color: #09cc2c; background-color: white; margin-left: 156px;"><strong><u>MultiIndex &nbsp;Operations</u></strong> &nbsp;<font size="+1">↴</font></span>

<span style="color: blue; margin-left: 158px;"><font size="+1">↳</font> &nbsp;Dropping a Level</span>

In [114]:

df.droplevel('letter')

        value
number
1           1
2           2
1           3
2           4


<span style="color: blue; margin-left: 158px;"><font size="+1">↳</font> &nbsp;Swapping Levels</span>

In [115]:

df.swaplevel('letter', 'number')

               value
number letter
1      A           1
2      A           2
1      B           3
2      B           4


<span style="color: blue; margin-left: 158px;"><font size="+1">↳</font> &nbsp;Getting Values of a Level</span>

In [116]:

df.index.get_level_values('letter')

Index(['A', 'A', 'B', 'B'], dtype='object', name='letter')

<br>

<span style="color: #09cc2c; background-color: white; margin-left: 156px;"><strong><u>Why &nbsp;use &nbsp;MultiIndex</u></strong> &nbsp;<font size="+1">↴</font></span>

<div style="margin-left: 190px;">

- <strong>Hierarchical Data Representation</strong> : MultiIndex allows organizing data hierarchically, making it easier to model datasets with multiple dimensions (e.g., time series across multiple locations).

- <strong>Enhanced Grouping</strong> : MultiIndex works seamlessly with operations like &nbsp;<code style="background-color: yellow;">.groupby()</code>&nbsp; and &nbsp;<code style="background-color: yellow;">.pivot_table()</code> , making advanced data aggregation intuitive.

- <strong>Compact Representation</strong> : Saves space and provides a clearer representation compared to a flat structure.

</div>

<br>

<span style="color: #09cc2c; background-color: white; margin-left: 156px;"><strong><u>Using &nbsp;MultiIndex &nbsp;for &nbsp;Enhanced &nbsp;Grouping &nbsp;in &nbsp;Pandas</u></strong> &nbsp;<font size="+1">↴</font></span>

<span style="margin-left: 200px;">A MultiIndex allows hierarchical organization of data, enabling <strong>grouping</strong> and <strong>aggregation</strong> at different levels of granularity.</span>

<span style="margin-left: 200px; color: blue;"><u>Example 1</u> &nbsp;: &nbsp;&nbsp;Grouping with MultiIndex</span>

<code style="background-color: #11e2bf; color: white; padding: 3px; margin-left: 288px; font-size: 1rem;"> <font size="+1">↳</font>  <strong>DATA SETUP</strong>  ====>  Create a DataFrame with a MultiIndex </code>

In [20]:

# Create a DataFrame with a MultiIndex

arrays = [
            ['A', 'A', 'A', 'B', 'B', 'C', 'C', 'C'],                                   # First level
            [1, 2, 3, 1, 2, 1, 2, 3],                                                   # Second level
         ]

multi_index = pd.MultiIndex.from_arrays(arrays, names=('Group', 'Subgroup'))

data = {
        'Value': [10, 20, 30, 15, 25, 5, 10, 15]
       }


df = pd.DataFrame(data, index=multi_index)
print("Original DataFrame:\n")
print(df)

Original DataFrame:

                Value
Group Subgroup
A     1            10
      2            20
      3            30
B     1            15
      2            25
C     1             5
      2            10
      3            15

<br>

<code style="background-color: #11e2bf; color: white; padding: 3px; margin-left: 287px;"> <font size="+1">↳</font>  <span style="font-size: 1rem;">Grouping at the Top Level</span> </code> &nbsp;<span style="font-size: 1rem;">(</span> <code style="background-color: #43d7ff;">Group</code> <span style="font-size: 1rem;">)</span></span>

In [21]:

grouped_df = df.groupby(level='Group').sum()
print("Sum of Values by Group:\n")
print(grouped_df)

Sum of Values by Group:

       Value
Group
A         60
B         40
C         30

<br>

<code style="background-color: #11e2bf; color: white; padding: 3px; margin-left: 287px; font-size: 1rem;"> <font size="+1">↳</font>  Grouping at the Second Level </code> &nbsp;<span style="font-size: 1rem;">(</span> <code style="background-color: #43d7ff;">Subgroup</code> <span style="font-size: 1rem;">)</span>

In [22]:

subgrouped_df = df.groupby(level='Subgroup').sum()
print("Sum of Values by Subgroup:\n")
print(subgrouped_df)

Sum of Values by Subgroup:

          Value
Subgroup
1            30
2            55
3            45

<br>

<code style="background-color: #11e2bf; color: white; padding: 3px; margin-left: 287px; font-size: 1rem;"> <font size="+1">↳</font>  Aggregating with Multiple Functions </strong></code>

In [23]:

aggregated = df.groupby(level='Group').agg(['sum', 'mean', 'count'])
print("Aggregated Statistics by Group:\n")
print(aggregated)

Aggregated Statistics by Group:

      Value
        sum  mean count
Group
A        60  20.0     3
B        40  20.0     2
C        30  10.0     3

<br>

<code style="background-color: #11e2bf; color: white; padding: 3px; margin-left: 287px; font-size: 1rem;"> <font size="+1">↳</font>  Combining MultiIndex Grouping with Columns </code>

<span style="color: #a245ff; margin-left: 335px;">If your DataFrame has additional columns, MultiIndex allows grouping both by index levels and columns</span>

In [25]:

df['Weight'] = [1, 2, 3, 1, 1, 1, 2, 3]                                # Add another column for weights
print(df)

                Value  Weight
Group Subgroup
A     1            10       1
      2            20       2
      3            30       3
B     1            15       1
      2            25       1
C     1             5       1
      2            10       2
      3            15       3

In [60]:

weighted_avg = df.groupby(level='Group').apply(
    lambda g: np.average(g['Value'], weights=g['Weight'])
)
print("Weighted Average by Group:\n")
print(weighted_avg)

Weighted Average by Group:

Group
A    23.333333
B    20.000000
C    11.666667
dtype: float64


<div style="margin-left: 150px;">

![](../media/pandas_dataframe_21.PNG)

&nbsp;&nbsp;&nbsp;&nbsp;<strong>Note</strong> &nbsp;: &nbsp;&nbsp;&nbsp;&nbsp;<code style="background-color: yellow;"><span style="color: #a245ff; font-size: 0.8rem;">df</span>.groupby(<span style="color: #a245ff; font-size: 0.8rem;">level</span>)</code> &nbsp;&nbsp;&nbsp;====>&nbsp;&nbsp;&nbsp; <span style="color: #14dd0b;">Groups the DataFrame by a specific level in the MultiIndex</span>

</div>

<br>

<code style="background-color: #11e2bf; color: white; padding: 3px; margin-left: 287px; font-size: 1rem;"> <font size="+1">↳</font>  Grouping with a Flat Index </code>

<span style="color: #a245ff; margin-left: 335px;">If you don't need hierarchical grouping after aggregation, you can reset the index.</span>

In [73]:

print(df)

                Value  Weight
Group Subgroup
A     1            10       1
      2            20       2
      3            30       3
B     1            15       1
      2            25       1
C     1             5       1
      2            10       2
      3            15       3

In [71]:

df.groupby(level='Group')

In [72]:

df.groupby(level='Group').sum()

       Value  Weight
Group
A         60       6
B         40       2
C         30       6

In [84]:

df.groupby(level='Group').sum().reset_index()                                   # Flat Index after Grouping on DataFrame "df"

  Group  Value  Weight
0     A     60       6
1     B     40       2
2     C     30       6


<span style="color: #a245ff;">We will cover this &nbsp;<code style="background-color: #a1ffef;">multi index</code>&nbsp; and &nbsp;<code style="background-color: yellow;">groupby()</code>&nbsp; in more details in subsequent sections later on.</span>


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Different methods of <strong>renaming indexes</strong> in a Pandas dataframe</span>


<div style="margin-left: 35px;">

Renaming the indexes of a DataFrame in Pandas can be done in multiple ways depending on whether you want to rename&nbsp; :

1. &nbsp;<strong>Individual Index Values</strong>
2. &nbsp;<strong>Index Levels</strong> &nbsp;(in case of MultiIndex)
3. &nbsp;<strong>Entire Index at Once</strong>

</div>


###### <code style="background-color: #07c92a; color: white; font-size: 0.82rem; padding: 6px; margin-left: -2px;">Using  <code style="background-color: yellow; padding: 2px;">.rename()</code></code>


<span style="color: #a245ff;">The &nbsp;<code style="background-color: #f6deff;">.rename()</code>&nbsp; method allows you to rename index labels individually or with a mapping function.</span>

In [19]:

data = {'col1': [1, 2, 3], 
        'col2': [4, 5, 6]
       }
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'])
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6


<span style="color: blue; background-color: white;"><u><strong>Example</strong></u> &nbsp;:&nbsp; </span> <code style="color: #ff188c; background-color: white; font-size: 0.82rem;">Rename Specific Index Values</code>

In [5]:

renamed_df = df.rename(index={'row1': 'index1', 'row2': 'index2'})            # Rename specific indexes
renamed_df

        col1  col2
index1     1     4
index2     2     5
row3       3     6


<span style="color: blue; background-color: white;"><u><strong>Example</strong></u> &nbsp;:&nbsp; </span> <code style="color: #ff188c; background-color: white; font-size: 0.82rem;">Rename Using a Function</code>

In [6]:

renamed_df = df.rename(index=lambda x: x.upper())                             # Apply a function to modify all index labels
renamed_df

      col1  col2
ROW1     1     4
ROW2     2     5
ROW3     3     6


###### &nbsp;

<code style="background-color: #07c92a; color: white; font-size: 0.82rem; padding: 6px;">Assigning  To  <code style="background-color: yellow; padding: 2px;">.index</code>  Directly</code>


<span style="color: #a245ff;">You can directly assign a <strong>new list</strong> to the &nbsp;<code style="background-color: #f6deff; ">.index</code>&nbsp; property.</span>

<span style="color: blue; background-color: white;"><u><strong>Example</strong></u> &nbsp;:&nbsp; </span> <code style="color: #ff188c; background-color: white; font-size: 0.82rem;">Replace Entire Index</code>

In [8]:

df.index = ['index1', 'index2', 'index3']                                     # Replace index with a new list
df

        col1  col2
index1     1     4
index2     2     5
index3     3     6


###### &nbsp;

<code style="background-color: #07c92a; color: white; font-size: 0.82rem; padding: 6px;">Renaming  MultiIndex  Levels</code>


<span style="color: #a245ff;">For a MultiIndex DataFrame, use &nbsp;<code style="background-color: yellow;">.rename()</code>&nbsp; with the &nbsp;<code>level</code>&nbsp; parameter.</span>

<span style="color: blue; background-color: white;"><u><strong>Example</strong></u> &nbsp;:&nbsp; </span> <code style="color: #ff188c; background-color: white; font-size: 0.82rem;">Rename Specific Levels in MultiIndex</code>

In [13]:

# MultiIndex DataFrame

arrays = [['A', 'A', 'B'], ['one', 'two', 'one']]
index = pd.MultiIndex.from_arrays(arrays, names=('outer', 'inner'))
df = pd.DataFrame({'col1': [1, 2, 3]}, index=index)
df

             col1
outer inner
A     one       1
      two       2
B     one       3

In [12]:

# Rename specific levels

renamed_df = df.rename(index={'A': 'Alpha', 'B': 'Beta'}, level='outer')
renamed_df

             col1
outer inner
Alpha one       1
      two       2
Beta  one       3


###### &nbsp;

<code style="background-color: #07c92a; color: white; font-size: 0.82rem; padding: 6px;">Using  <code style="background-color: yellow; padding: 2px;">.set_index()</code></code>


<span style="color: #a245ff;">If your DataFrame has <strong>columns</strong> you want <strong>to turn into a new index</strong> , you can use &nbsp;<code style="background-color: #f6deff;">.set_index()</code></span>

<span style="color: blue; background-color: white;"><u><strong>Example</strong></u> &nbsp;:&nbsp; </span> <code style="color: #ff188c; background-color: white; font-size: 0.82rem;">Replace Index with Column Values</code>

In [16]:

df = pd.DataFrame({'col1': ['A', 'B', 'C'], 'col2': [1, 2, 3]})
df

  col1  col2
0    A     1
1    B     2
2    C     3

In [17]:

# Set a column as the new index

df = df.set_index('col1')
df

      col2
col1
A        1
B        2
C        3


###### &nbsp;

<code style="background-color: #07c92a; color: white; font-size: 0.82rem; padding: 6px;">Reset Index and Rename</code>


<span style="color: #a245ff;">You can <strong>reset the index</strong> (i.e, <u>make index the first column</u>) and then <strong>rename</strong> it when setting it back.</span>

In [18]:

df = pd.DataFrame({'col1': [1, 2, 3]}, index=['row1', 'row2', 'row3'])
df

      col1
row1     1
row2     2
row3     3

In [22]:

# Reset

df_reset = df.reset_index()
df_reset

  index  col1
0  row1     1
1  row2     2
2  row3     3

In [23]:

# Rename 

df_reset.rename(columns={'index': 'new_index'}, inplace=True)
df_reset

  new_index  col1
0      row1     1
1      row2     2
2      row3     3


###### &nbsp;

<code style="background-color: #07c92a; color: white; font-size: 0.82rem; padding: 6px;">Key Takeaways</code>


<span style="color: #00b832;">Let's &nbsp;symmarize &nbsp;different &nbsp;ways &nbsp;of &nbsp;renaming &nbsp;indexes :</span>

| Method | Use Case | Example |
|--------|----------|---------|
| <br><code style="background-color: #ffefcf; padding: 4px;"><span style="color: red; font-size: 1rem;"><strong>.rename(</strong></span>index=...<span style="color: red; font-size: 1rem;"><strong>)</span></strong>      </code> <br>&nbsp; | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Rename &nbsp;specific &nbsp;or &nbsp;all &nbsp;index &nbsp;labels | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<code style="background-color: #ffd6a8; color: black; padding: 4px;">df.rename(index={'old': 'new'})         </code> |
| <br><code style="background-color: #ffefcf; padding: 4px;"><span style="color: red; font-size: 1rem;"><strong>.index</span></strong> = new_index_list  </code> <br>&nbsp; | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Replace &nbsp;entire &nbsp;index | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<code style="background-color: #ffd6a8; color: black; padding: 4px;">df.index = ['new1', 'new2']             </code> |
| <br><code style="background-color: #ffefcf; padding: 4px;"><span style="color: red; font-size: 1rem;"><strong>.rename(</strong></span>level=...<span style="color: red; font-size: 1rem;"><strong>)</strong></span>      </code> <br>&nbsp; | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Rename &nbsp;MultiIndex &nbsp;levels | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<code style="background-color: #ffd6a8; color: black; padding: 4px;">df.rename(index={'old': 'new'}, level=1)</code> |
| <br><code style="background-color: #ffefcf; padding: 4px;"><span style="color: red; font-size: 1rem;"><strong>.set_index(</strong></span>column_name<span style="color: red; font-size: 1rem;"><strong>)</strong></span></code> <br>&nbsp; | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Replace &nbsp;index &nbsp;with &nbsp;column &nbsp;values | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<code style="background-color: #ffd6a8; color: black; padding: 4px;">df.set_index('col_name')                </code> |
| <br><code style="background-color: #ffefcf; padding: 4px;"><span style="color: red; font-size: 1rem;"><strong>.reset_index()</strong></span>         </code> <br>&nbsp; | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Reset &nbsp;index &nbsp;and &nbsp;rename &nbsp;as &nbsp;needed | &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<code style="background-color: #ffd6a8; color: black; padding: 4px;">df.reset_index()                        </code> |

<br>

<span style="color: #00b832;"><strong><u>Note</u></strong> &nbsp;-&nbsp; to &nbsp;rename &nbsp;all &nbsp;columns &nbsp;of &nbsp;a &nbsp;DataFrame, &nbsp;just &nbsp;use &nbsp;<code style="background-color: yellow;">.columns</code>&nbsp; like &nbsp;the &nbsp;following :</span>

In [22]:

data = {'col1': [1, 2, 3], 
        'col2': [4, 5, 6],
        'col3': [7, 8, 9]
       }
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'])
df

      col1  col2  col3
row1     1     4     7
row2     2     5     8
row3     3     6     9

In [29]:

df.columns = ['col1_new', 'col2_new', 'col3']                                                                   # Rename all columns
df

      col1_new  col2_new  col3
row1         1         4     7
row2         2         5     8
row3         3         6     9


<span style="color: #00b832;"><strong><u>Note</u></strong> &nbsp;-&nbsp; to &nbsp;rename &nbsp;specific &nbsp;columns &nbsp;of &nbsp;a &nbsp;DataFrame, &nbsp;use &nbsp;<code style="background-color: yellow;">.rename()</code>&nbsp; like &nbsp;the &nbsp;following :</span>

In [30]:

renamed_df = df.rename(columns={'col1_new': 'col1_updated', 'col2_new': 'col2_updated'})                        # Rename specific columns
renamed_df

      col1_updated  col2_updated  col3
row1             1             4     7
row2             2             5     8
row3             3             6     9


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Let now see how to <u><strong>reset</strong> an index</u> in a dataframe</span>





&nbsp;<span style="color: #b90cff;">The &nbsp;<code style="background-color: yellow; font-size: 0.84rem;">reset_index()</code>&nbsp; method in Pandas is used to <strong>reset the index</strong> of a DataFrame, &nbsp;<u>turning the current index into columns</u> &nbsp;and&nbsp; <u>replacing it with a default integer index</u></span>

<div style="margin-left: 30px;">

![](../media/pandas_dataframe_22.PNG)

</div>

<br>


###### <span style="background-color: blue; color: white; padding: 4px; font-size: 0.82rem;">Reset &nbsp;Index &nbsp;of &nbsp;a &nbsp;Simple &nbsp;DataFrame</span>

In [9]:

data = {'A': [10, 20, 30],
        'B': [40, 50, 60]
       }
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'])
df                                                            # Original DataFrame

       A   B
row1  10  40
row2  20  50
row3  30  60

<span style="color: red;">Reset &nbsp;index</span>

In [92]:

df_reset = df.reset_index()                
df_reset                                                      # After reset index

    Group   Subgroup  col1  col2
0  Group1  Subgroup1     1     5
1  Group1  Subgroup2     2     6
2  Group2  Subgroup1     3     7
3  Group2  Subgroup2     4     8

&nbsp;

###### <span style="background-color: blue; color: white; padding: 4px; font-size: 0.82rem;">Drop &nbsp;the &nbsp;Index &nbsp;Instead &nbsp;of &nbsp;Adding &nbsp;as &nbsp;a &nbsp;Column</span>

In [10]:

df_reset = df.reset_index(drop=True)
df_reset

    A   B
0  10  40
1  20  50
2  30  60

&nbsp;

###### <span style="background-color: blue; color: white; padding: 4px; font-size: 0.82rem;">Reset &nbsp;Specific &nbsp;Levels &nbsp;of &nbsp;a &nbsp;MultiIndex</span>

In [12]:

data = {'col1': [1, 2, 3, 4], 'col2': [5, 6, 7, 8]}

index = pd.MultiIndex.from_tuples(
                                    [('Group1', 'Subgroup1'), ('Group1', 'Subgroup2'), ('Group2', 'Subgroup1'), ('Group2', 'Subgroup2')],
                                    names=['Group', 'Subgroup']
                                 )

df = pd.DataFrame(data, index=index)
df                                                            # Original DataFrame

                  col1  col2
Group  Subgroup
Group1 Subgroup1     1     5
       Subgroup2     2     6
Group2 Subgroup1     3     7
       Subgroup2     4     8

<span style="color: red;">Reset &nbsp;only &nbsp;the &nbsp;'Subgroup' &nbsp;level</span>

In [13]:

df_reset = df.reset_index(level='Subgroup')
df_reset                                                      # After resetting 'Subgroup' level

         Subgroup  col1  col2
Group
Group1  Subgroup1     1     5
Group1  Subgroup2     2     6
Group2  Subgroup1     3     7
Group2  Subgroup2     4     8

&nbsp;

###### <span style="background-color: blue; color: white; padding: 4px; font-size: 0.82rem;">Reset &nbsp;All &nbsp;Levels &nbsp;of &nbsp;a &nbsp;MultiIndex</span>

In [14]:

df_reset_all = df.reset_index()
df_reset_all                                                  # After resetting all levels

    Group   Subgroup  col1  col2
0  Group1  Subgroup1     1     5
1  Group1  Subgroup2     2     6
2  Group2  Subgroup1     3     7
3  Group2  Subgroup2     4     8

&nbsp;

###### <span style="background-color: blue; color: white; padding: 4px; font-size: 0.82rem;">Using &nbsp;the &nbsp;<code style="background-color: white;">names</code> &nbsp;parameter</span>

The &nbsp;<code>names</code>&nbsp; parameter assigns <strong>custom names</strong> to the new columns resulting from the index.

In [15]:

result = df.reset_index(names=['Category', 'Subcategory'])
result

  Category Subcategory  col1  col2
0   Group1   Subgroup1     1     5
1   Group1   Subgroup2     2     6
2   Group2   Subgroup1     3     7
3   Group2   Subgroup2     4     8

&nbsp;

###### <code style="background-color: blue; color: white; padding: 5px; font-size: 0.82rem;">col_level</code> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="color: blue; font-size: 0.9rem;">&</span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <code style="background-color: blue; color: white; padding: 5px; font-size: 0.82rem;">col_fill</code>

<br>

The &nbsp;<code style="font-size: 0.82rem;">col_level</code>&nbsp; and &nbsp;<code style="font-size: 0.8rem;">col_fill</code>&nbsp; parameters of the &nbsp;<code style="background-color: yellow; font-size: 0.8rem;">reset_index()</code>&nbsp; method in Pandas are used in the context of <u>DataFrames with <strong>MultiIndex columns</strong></u>

<br>

<code style="background-color: #b90cff; color: white; font-size: 0.8rem; padding: 4px;">DataFrame &nbsp;with &nbsp;MultiIndex &nbsp;Columns</code>

In [98]:

data = {
    ('A', 'X'): [1, 2, 3],
    ('A', 'Y'): [4, 5, 6],
    ('B', 'Z'): [7, 8, 9]
}
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'])
df                                                              # Original DataFrame

      A     B
      X  Y  Z
row1  1  4  7
row2  2  5  8
row3  3  6  9


<code style="background-color: #b90cff; color: white; font-size: 0.8rem; padding: 4px;">Reset &nbsp;Index &nbsp;Without &nbsp;<code style="background-color: white; color: black;">col_level</code> &nbsp;or &nbsp;<code style="background-color: white; color: black;">col_fill</code></code>

In [99]:

df_reset = df.reset_index()                                     # After resetting index
df_reset

  index  A     B
         X  Y  Z
0  row1  1  4  7
1  row2  2  5  8
2  row3  3  6  9


<code style="background-color: #b90cff; color: white; font-size: 0.8rem; padding: 4px;">Using &nbsp;<code style="background-color: white; color: black;">col_level</code> &nbsp;to &nbsp;Place &nbsp;Index &nbsp;in &nbsp;a &nbsp;<u>Specific &nbsp;Column &nbsp;Level</u></code>

In [100]:

df_reset = df.reset_index(col_level=1)                          # After resetting index with col_level=1
df_reset

         A     B
  index  X  Y  Z
0  row1  1  4  7
1  row2  2  5  8
2  row3  3  6  9

In [102]:

df_reset = df.reset_index(col_level=0)                          # After resetting index with col_level=0
df_reset

  index  A     B
         X  Y  Z
0  row1  1  4  7
1  row2  2  5  8
2  row3  3  6  9


<code style="background-color: #b90cff; color: white; font-size: 0.8rem; padding: 4px;">Using &nbsp;<code style="background-color: white; color: black;">col_fill</code> &nbsp;to &nbsp;Fill &nbsp;Missing &nbsp;Levels</u></code>

In [103]:

df_reset = df.reset_index(col_level=1, col_fill="New_Level")
df_reset

  New_Level  A     B
      index  X  Y  Z
0      row1  1  4  7
1      row2  2  5  8
2      row3  3  6  9

<br>

## <code style="background-color: black; color: white; padding: 10px;">Essential Functionality</code>

<br>

### <div style="color: black; background-color: #ffe9c8; padding-top: 10px; padding-bottom: 10px; padding-right: 10px;"> <code style="font-size: 1.3rem; background-color: #ffe9c8; color: red;"><strong>Reindexing</strong></code></div>


<div style="margin-left: 60px;">

![](../media/pandas_reindex_1.PNG)

</div>

<br>

<code style="color: white; background-color: #abb2b9; margin-left: 150px; padding: 3px;">parameters :</code>

| Argument | Description |
|----------|-------------|
| <code style="background-color: #ffcd6f;">labels</code>       |   <br>&nbsp;&nbsp;&nbsp;&nbsp;New sequence to use as an index. Can be Index instance or any other sequence-like Python data structure. <br> &nbsp;&nbsp;&nbsp;&nbsp;An Index will be used exactly as is without any copying.  <br><br>|
| <code style="background-color: #ffcd6f;">index</code>	       |   <br>&nbsp;&nbsp;&nbsp;&nbsp;Use the passed sequence as the new index labels.     <br><br>|
| <code style="background-color: #ffcd6f;">columns</code>      |   <br>&nbsp;&nbsp;&nbsp;&nbsp;Use the passed sequence as the new column labels.    <br><br>|
| <code style="background-color: #ffcd6f;">axis</code>	       |   <br>&nbsp;&nbsp;&nbsp;&nbsp;The axis to reindex, whether &nbsp;<code style="background-color: #2cf718;">"index"</code>&nbsp; (rows) or "columns". The default is &nbsp;<code style="background-color: #2cf718;">"index"</code> <br> &nbsp;&nbsp;&nbsp;&nbsp;You can alternately do &nbsp;<code style="background-color: #51d2ff;">reindex(index=new_labels)</code>&nbsp; or &nbsp;<code style="background-color: #51d2ff;">reindex(columns=new_labels)</code>    <br><br>|
| <code style="background-color: #ffcd6f;">method</code>       |	<br>&nbsp;&nbsp;&nbsp;&nbsp;Interpolation (fill) method ; &nbsp;<code style="background-color: #2cf718;">"ffill"</code> <span style="color: red;">fills forward</span>, while &nbsp;<code style="background-color: #2cf718;">"bfill"</code> <span style="color: red;">fills backward</span>.     <br><br>|
| <code style="background-color: #ffcd6f;">fill_value</code>   | <br>&nbsp;&nbsp;&nbsp;&nbsp;Substitute value to use when introducing missing data by reindexing. <br> &nbsp;&nbsp;&nbsp;&nbsp;Use &nbsp;<code style="background-color: #2cf718;">fill_value="missing"</code>&nbsp; (the default behavior) when you want absent labels to have null values in the result. <br><br>     |
| <code style="background-color: #ffcd6f;">limit</code>	       |    <br>&nbsp;&nbsp;&nbsp;&nbsp;When forward filling or backfilling, the maximum size gap (in number of elements) to fill. <br><br>|
| <code style="background-color: #ffcd6f;">tolerance</code>    |	<br>&nbsp;&nbsp;&nbsp;&nbsp;When forward filling or backfilling, the maximum size gap (in absolute numeric distance) to fill for inexact matches. <br><br>|
| <code style="background-color: #ffcd6f;">level</code>        |    <br>&nbsp;&nbsp;&nbsp;&nbsp;Match simple Index on level of MultiIndex ; otherwise select subset of.  <br><br>|
| <code style="background-color: #ffcd6f;">copy</code>         |	<br>&nbsp;&nbsp;&nbsp;&nbsp;If &nbsp;<code style="background-color: #2cf718;">True</code> , always copy underlying data even if the new index is equivalent to the old index <br> &nbsp;&nbsp;&nbsp;&nbsp;If &nbsp;<code style="background-color: #2cf718;">False</code> , do not copy the data when the indexes are equivalent <br><br>|

<br>

<code style="background-color: yellow; padding: 3px; margin-left: 60px;"> <span style="color: #a245ff; font-size: 0.7rem;">obj</span>.reindex() </code>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;=====>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;To create a new object with the <strong>values rearranged to align with the new index</strong>

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607; font-size: 1rem;">Reindexing &nbsp;Series</span>

<div style="color: #a245ff; margin-left: 45px;">Calling &nbsp;<code style="background-color: #f0caff; padding: 2px;"><span style="color: #a245ff; font-size: 0.7rem;">obj</span>.reindex()</code>&nbsp; on a Series rearranges the data according to the new index, introducing <strong>missing values</strong> if any index values were not already present :</div>

In [44]:

series1 = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
print("Original Series :")
print(series1)


# Reindex with additional and missing labels
series2 = series1.reindex(["a", "b", "c", "d", "e"])                      # series1.reindex(index=["a", "b", "c", "d", "e"])
print("\n\nReindexed DataFrame:")
print(series2)

Original Series :
d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64


Reindexed DataFrame:
a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607; font-size: 1rem;">Reindexing &nbsp;DataFrame</span>


<div style="color: #a245ff; margin-left: 50px;">

- With DataFrame, &nbsp;<code style="background-color: #fffa63; padding: 2px;"><span style="color: #a245ff; font-size: 0.7rem;">obj</span>.reindex()</code>&nbsp; can alter the <strong>(row) index</strong> , <strong>columns</strong> , or <strong>both</strong>.

- Calling it on a DataFrame rearranges the data according to the new index, introducing <strong>missing values</strong> if any index values were not already present :

</div>

In [100]:

df = pd.DataFrame({'col1': [1, 2, 3]}, index=['a', 'b', 'c'])
print("Original DataFrame :")
print(df)


# Reindex with additional and missing labels
df_reindexed = df.reindex(['a', 'b', 'd'])                                #  df.reindex(index=['a', 'b', 'd'])
print("\n\nReindexed DataFrame :")
print(df_reindexed)

Original DataFrame :
   col1
a     1
b     2
c     3


Reindexed DataFrame :
   col1
a   1.0
b   2.0
d   NaN

<br>

###### <code style="color: white; background-color: #16ca27; font-size: 1rem; padding: 1px;">&nbsp;▷ &nbsp;Reindexing <u>rows</u>&nbsp;</code>

In [28]:

df = pd.DataFrame(np.arange(9).reshape((3, 3)), index=["a", "c", "d"], columns=["Delhi", "Mumbai", "Bangalore"])
df

   Delhi  Mumbai  Bangalore
a      0       1          2
c      3       4          5
d      6       7          8


<div style="color: #14bf02; margin-left: 50px;">When passed only a sequence</u>, it reindexes the <strong>rows</strong> in the result.<br>Or you can explicitly pass the &nbsp;<code style="background-color: #ffcd6f;;">index</code>&nbsp; parameter to index the <strong>rows</strong> of the dataframe.</div>

In [19]:

df_row_reindexed = df.reindex(index=["a", "b", "c", "d"])                   #   --------->   df1.reindex(["a", "b", "c", "d"])
df_row_reindexed

   Delhi  Mumbai  Bangalore
a    0.0     1.0        2.0
b    NaN     NaN        NaN
c    3.0     4.0        5.0
d    6.0     7.0        8.0

<br>

###### <code style="color: white; background-color: #16ca27; font-size: 1rem; padding: 1px;">&nbsp;▷ &nbsp;Reindexing <u>columns</u>&nbsp;</code>

In [24]:

df

   Delhi  Mumbai  Bangalore
a      0       1          2
c      3       4          5
d      6       7          8


<span style="margin-left: 50px; color: #44d611;">The <strong>columns</strong> can be reindexed with the &nbsp;<code style="background-color: #ffcd6f;">columns</code>&nbsp; keyword :</span>

In [20]:

states = ["Mumbai", "Kolkata", "Bangalore"]
df_column_reindexed = df.reindex(columns=states)
df_column_reindexed

   Mumbai  Kolkata  Bangalore
a       1      NaN          2
c       4      NaN          5
d       7      NaN          8


<span style="color: #a245ff; margin-left: 50px;">Because &nbsp;<code style="background-color: #f1d3ff;">"Kolkata"</code>&nbsp; was not in &nbsp;<code style="background-color: #f1d3ff;">states</code> , the data for that column is dropped from the result.</span>

<br>

###### <code style="color: white; background-color: #16ca27; font-size: 1rem; padding: 1px;">&nbsp;▷ &nbsp;Reindexing both <u>rows</u> & <u>columns</u>&nbsp;</code>

In [25]:

df

   Delhi  Mumbai  Bangalore
a      0       1          2
c      3       4          5
d      6       7          8

In [27]:

df_row_column_reindexed = df.reindex(index=['d', 'c', 'b','a'], columns=['Delhi', 'Mumbai', 'Kolkata', 'Bangalore'])
df_row_column_reindexed

   Delhi  Mumbai  Kolkata  Bangalore
d    6.0     7.0      NaN        8.0
c    3.0     4.0      NaN        5.0
b    NaN     NaN      NaN        NaN
a    0.0     1.0      NaN        2.0


<br>

###### <code style="color: white; background-color: #16ca27; font-size: 1rem; padding: 1px;">&nbsp;▷ &nbsp;Reindexing through <u>axis</u>&nbsp;</code>


<span style="margin-left: 41px; color: #44d611;">Another way to <strong>reindex a particular axis</strong> is to pass the new axis labels as a positional argument and then specify the axis to reindex with the axis keyword :</span> 

<span style="color:red; margin-left: 43px;"><font size="+1">↳</font> &nbsp;reindexing &nbsp;the &nbsp;<strong>rows</strong> &nbsp;axis</span>

In [38]:

print('Original DataFrame -------> ')
print(df)


indices = ["a", "b", "c", "d"]
df_row_reindexed = df.reindex(indices, axis="rows")
print('\n\nRowwise Reindexed DataFrame -------> ')
print(df_row_reindexed)

Original DataFrame ------->
   Delhi  Mumbai  Bangalore
a      0       1          2
c      3       4          5
d      6       7          8


Rowwise Reindexed DataFrame ------->
   Delhi  Mumbai  Bangalore
a    0.0     1.0        2.0
b    NaN     NaN        NaN
c    3.0     4.0        5.0
d    6.0     7.0        8.0

<br>

<span style="color:red; margin-left: 43px;"><font size="+1">↳</font> &nbsp;reindexing &nbsp;the &nbsp;<strong>columns</strong> &nbsp;axis</span>

In [43]:

print('Original DataFrame -------> ')
print(df)


states = ["Mumbai", "Kolkata", "Bangalore"]
df_reindexed = df.reindex(states, axis="columns")
print('\n\nColumnwise Reindexed DataFrame -------> ')
print(df_reindexed)

Original DataFrame ------->
   Delhi  Mumbai  Bangalore
a      0       1          2
c      3       4          5
d      6       7          8


Columnwise Reindexed DataFrame ------->
   Mumbai  Kolkata  Bangalore
a       1      NaN          2
c       4      NaN          5
d       7      NaN          8

<BR>

<div style="margin-left: 50px;">

&nbsp;<span style="color: blue;"><strong>NOTE &nbsp;-</strong></span> 

![](../media/pandas_reindex_2.PNG)

</div>


<br>

###### <code style="color: white; background-color: #16ca27; font-size: 1rem; padding: 1px;">&nbsp;▷ &nbsp;Reindexing with intepolation (<u>fill</u>) methods&nbsp;</code>


<div style="color: #44d611; margin-left: 41px;">

For ordered data like time series, you may want to do some interpolation or filling of values when reindexing. 
<br> The &nbsp;<code style="background-color: #ffcd6f;">method</code>&nbsp; option allows us to do this, using a method such as &nbsp;<code style="background-color: #ffcd6f;">ffill</code> , which <strong>forward-fills</strong> the values :</span>

</div>

<br>

<code style="background-color: #eed4ff; margin-left: 45px;">Example - 1</code> &nbsp;&nbsp;<span style="color: red;">(dataframe)</span>

In [73]:

df = pd.DataFrame({'A': [1, np.nan, 3]}, index=['a', 'b', 'c'])
df

     A
a  1.0
b  NaN
c  3.0

In [74]:

df_reindexed = df.reindex(['a', 'b', 'd'], method='ffill')          # Reindex with a missing row and forward fill
print("Reindexed DataFrame with Forward Fill:")
df_reindexed

Reindexed DataFrame with Forward Fill:

     A
a  1.0
b  NaN
d  3.0

<code style="background-color: #eed4ff; margin-left: 45px;">Example - 2</code> &nbsp;&nbsp;<span style="color: red;">(series)</span>

In [53]:

obj = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj

0      blue
2    purple
4    yellow
dtype: object

In [68]:

obj.reindex(np.arange(6), method="ffill")                             # ffill  ------>  forward fill missing values

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [69]:

obj.reindex(np.arange(6), method="bfill")                             # bfill  ------>  backward fill missing values

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object


<br>

###### <code style="color: white; background-color: #16ca27; font-size: 1rem; padding: 1px;">&nbsp;▷ &nbsp;Reindexing with <u>loc</u> operator&nbsp;</code>

<br>

<div style="margin-left: 41px; color: #a245ff;">As we'll explore later in &nbsp;<code style="background-color: blue; color: white;">Selection on DataFrame with loc and iloc</code> , &nbsp;you can also reindex by using the &nbsp;<code style="background-color: yellow;">loc</code>&nbsp; operator, and many users prefer to always do it this way. &nbsp;<br><br><span style="color: #44d611;">⭐ &nbsp;However this works only if all of the new index labels <strong>already exist</strong> in the DataFrame ( whereas <u>reindex will insert missing data for new labels</u> )</span></div>

In [3]:

df = pd.DataFrame(np.arange(9).reshape((3, 3)), index=["a", "c", "d"], columns=["Delhi", "Mumbai", "Bangalore"])
df

   Delhi  Mumbai  Bangalore
a      0       1          2
c      3       4          5
d      6       7          8

In [4]:

df.loc[["d", "c", "a"], ["Bangalore", "Mumbai"]]                           #  df.loc[[row_array],[column_array]]

   Bangalore  Mumbai
d          8       7
c          5       4
a          2       1


<br>

###### <code style="color: white; background-color: #16ca27; font-size: 1rem; padding: 1px;">&nbsp;▷ &nbsp;Reindexing with <u>MultiIndex</u>&nbsp;</code>

In [26]:

letter_number_array = [['A', 'A', 'B'], [1, 2, 1]]
index = pd.MultiIndex.from_arrays(letter_number_array, names=('Group', 'Subgroup'))
index

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1)],
           names=['Group', 'Subgroup'])

In [28]:

df = pd.DataFrame({"Value": [10, 20, 30]}, index=index)
df                                                                                                      # Original MultiIndex DataFrame

                Value
Group Subgroup
A     1            10
      2            20
B     1            30

In [29]:

# Reindex MultiIndex

new_letter_number_array = [['A', 'A', 'B'], [1, 3, 2]]
new_index = pd.MultiIndex.from_arrays(new_letter_number_array, names=('Group', 'Subgroup'))
new_df = df.reindex(new_index)
new_df                                                                                                  # Reindexed MultiIndex DataFrame

                Value
Group Subgroup
A     1          10.0
      3           NaN
B     2           NaN

<span style="color: red;">Let's &nbsp;summarise &nbsp;it :</span>

In [36]:

index = pd.MultiIndex.from_arrays([['A', 'A', 'B'], [1, 2, 1]], names=('Group', 'Subgroup'))


df = pd.DataFrame({"Value": [10, 20, 30]}, index=index)
print("Original MultiIndex DataFrame:\n", df)


# Reindex MultiIndex
new_index = pd.MultiIndex.from_arrays([['A', 'A', 'B'], [1, 3, 2]], names=('Group', 'Subgroup'))
new_df = df.reindex(new_index)
print("\n\nReindexed MultiIndex DataFrame:\n", new_df)

Original MultiIndex DataFrame:
                 Value
Group Subgroup
A     1            10
      2            20
B     1            30


Reindexed MultiIndex DataFrame:
                 Value
Group Subgroup
A     1          10.0
      3           NaN
B     2           NaN


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Difference between &nbsp;<code style="background-color: yellow; padding: 2px;"><span style="font-size: 0.7rem; color: #85929e;">dataframe</span>.reindex()</code>&nbsp; and &nbsp;<code style="background-color: yellow; padding: 2px;"><span style="font-size: 0.7rem; color: #85929e;">index</span>.reset_index()</code></span>


<div style="margin-left: 80px;">

![](../media/pandas_reindex_3.PNG)

</div>

<br>

### <div style="color: black; background-color: #ffe9c8; padding-top: 10px; padding-bottom: 10px; padding-right: 10px;"> <code style="font-size: 1.3rem; background-color: #ffe9c8; color: red;"><strong>Dropping Entries from an Axis</strong></code></div>


Dropping one or more entries from an axis is simple <u>if you <strong>already have</strong> an index array or list without those entries</u> , since you can use the &nbsp;<code style="background-color: #9fefff;">reindex method</code>&nbsp; or &nbsp;<code style="background-color: #9fefff;">.loc-based indexing</code> <br>

As that can require a bit of munging and set logic , <span style="color: blue;">dropping entries from an axis (rows or columns) in a pandas <strong>Series</strong> or <strong>DataFrame</strong> can be done using the &nbsp;<code style="background-color: yellow;">drop()</code>&nbsp; method. </span> &nbsp;However it is important to note that <u>this method returns a <strong>new object</strong> with indicated value(s) deleted from an axis</u>.


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Dropping one or more entry in a <strong>Series</strong></span>

In [60]:

obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [61]:

new_obj = obj.drop("c")                                     # dropping one entry
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [62]:

obj.drop(["d", "c"])                                        # dropping more than one entry

a    0.0
b    1.0
e    4.0
dtype: float64

In [63]:

obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Dropping one or more entry in a <strong>DataFrame</strong></span>


<div style="margin-left: 75px;">

![](../media/pandas_drop_2.PNG)

</div>

<br>

<span style="color: #07d129;">With DataFrame, index values can be deleted from either axis.</span> &nbsp;To illustrate this, consider the following dataframe for an example :

In [64]:

df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                    index=["Mumbai", "Delhi", "Bangalore", "Kolkata"], 
                    columns=["one", "two", "three", "four"])

df

           one  two  three  four
Mumbai       0    1      2     3
Delhi        4    5      6     7
Bangalore    8    9     10    11
Kolkata     12   13     14    15

<br>

![](../media/pandas_drop_3.PNG)

<span style="color: #a245ff;">However the original &nbsp;<code style="background-color: #f3d6ff;">df</code>&nbsp; remains unchanged.</span>


<br>

![](../media/pandas_drop_4.PNG)

<span style="color: #a245ff;">However the original &nbsp;<code style="background-color: #f3d6ff;">df</code>&nbsp; remains unchanged.</span>


<br>

![](../media/pandas_drop_5.PNG)

<span style="color: #a245ff;">As you can see the original &nbsp;<code style="background-color: #f3d6ff;">df</code>&nbsp; is changed.</span>


<br>

![](../media/pandas_drop_6.PNG)

In [65]:

arrays = [
    ["Group1", "Group1", "Group2", "Group2"],
    ["A", "B", "A", "B"]
]

index = pd.MultiIndex.from_arrays(arrays, names=["Group", "Subgroup"])

df = pd.DataFrame({"Value": [10, 20, 30, 40]}, index=index)

df                                                                              # Original MultiIndex DataFrame

                 Value
Group  Subgroup
Group1 A            10
       B            20
Group2 A            30
       B            40

In [66]:

new_df = df.drop(labels="A", level="Subgroup")                                  # Drop a specific level

new_df                                                                          # After dropping 'A' in Subgroup level

                 Value
Group  Subgroup
Group1 B            20
Group2 B            40

<br>

<code style="background-color: black; color: white; padding: 5px;">Example</code>

In [67]:

# create this dataframe everytime you drop in-place

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
})

df                                                   # Original DataFrame

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

<br>

<span style="color: blue;"><strong>Dropping &nbsp;rows</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;=================>&nbsp;&nbsp;&nbsp;&nbsp; To drop the 2nd row of the dataframe</span>

In [68]:

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
})


# new_df = df.drop(index=1, axis=0)                  # new_df = df.drop(index=1)            # new_df = df.drop(1)           ------>         METHOD 1   
new_df = df.drop(index=[1], axis=0)                  # new_df = df.drop(index=[1])          # new_df = df.drop([1])         ------>         METHOD 2  
new_df

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

<br>

<span style="color: blue;"><strong>Dropping &nbsp;rows &nbsp;in-place</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;===========>&nbsp;&nbsp;&nbsp;&nbsp; To drop the 2nd row of the dataframe in-place</span>

In [69]:

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
})


# df.drop(index=1, axis=0, inplace=True)             # df.drop(1, inplace=True)            --------------------------------------->         METHOD 1
df.drop(index=[1], axis=0, inplace=True)             # df.drop([1], inplace=True)          --------------------------------------->         METHOD 2
df

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

<br>

<span style="color: blue;"><strong>Dropping &nbsp;columns</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;===============>&nbsp;&nbsp;&nbsp;&nbsp; To drop the 2nd column of the dataframe</span>

In [70]:

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
})


# new_df = df.drop(columns='Age', axis=1)                       # new_df = df.drop(columns='Age')            --------------------->         METHOD 1
new_df = df.drop(columns=['Age'], axis=1)                       # new_df = df.drop(columns=["Age"])          --------------------->         METHOD 2
new_df

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

<br>

<span style="color: blue;"><strong>Dropping &nbsp;columns &nbsp;in-place</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;=========>&nbsp;&nbsp;&nbsp;&nbsp; To drop the 2nd column of the dataframe in-place</span>

In [71]:

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
})


# df.drop(columns='Age', axis=1, inplace=True)                  # df.drop(columns='Age', inplace=True)          ------------------>         METHOD 1
df.drop(columns=['Age'], axis=1, inplace=True)                  # df.drop(columns=["Age"], inplace=True)        ------------------>         METHOD 2
df

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago


<br>

### <div style="color: black; background-color: #ffe9c8; padding-top: 10px; padding-bottom: 10px; padding-right: 10px;"> <code style="font-size: 1.3rem; background-color: #ffe9c8; color: red;"><strong>Indexing, Selection, and Filtering</strong></code></div>


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607; font-size: 0.904rem;">Series indexing ( <code style="background-color: #ffebcd;">obj[...]</code> ) works analogously to NumPy array indexing, except you can use the Series’s index values instead of only integers :</span>

In [72]:

obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [73]:

obj["b"]

1.0

In [74]:

obj[1]

1.0

In [75]:

obj[2:4]

c    2.0
d    3.0
dtype: float64

In [76]:

obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [77]:

obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [78]:

obj[obj < 2]

a    0.0
b    1.0
dtype: float64


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607; font-size: 0.904rem;">While you can select data by label this way, <strong>the preferred way to select index values is with the special</strong> &nbsp;<code style="background-color: yellow;">loc</code>&nbsp; <strong>operator</strong> &nbsp;:</span>

In [79]:

obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64


<br>

###### <code style="color: white; background-color: #6a7eff; font-size: 0.9rem; padding: 3px;">▷ &nbsp;Reasons to prefer <span style="background-color: white; color: black;">loc</span> </code>

<br>


<div style="color: #4c6dff;">The reason to prefer &nbsp;<code style="background-color: yellow;">loc</code>&nbsp; is because of the different treatment of integers when indexing with &nbsp;<code style="background-color: yellow;">[]</code>&nbsp; <br>
Regular &nbsp;<code style="background-color: yellow;">[]</code>-based indexing will treat <strong>integers as labels</strong> if the index contains integers, so the behavior differs depending on the data type of the index <br>
For example &nbsp;:</div>

In [80]:

obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])


print('------------- obj1 -------------')
print(obj1)
print('\n------------- obj2 -------------')
print(obj2)

------------- obj1 -------------
2    1
0    2
1    3
dtype: int64

------------- obj2 -------------
a    1
b    2
c    3
dtype: int64

In [81]:

obj1[[0, 1, 2]]                                                   # here obj1 takes [0, 1, 2] as a list of row-labels, not as a list of indices

0    2
1    3
2    1
dtype: int64


<div style="color: #37d26d;"><font size="+2">↳</font> &nbsp;Since the index of the pandas object &nbsp;<code>obj1</code>&nbsp; is of <strong>integer</strong> type, therefore it takes &nbsp;<code>[0, 1, 2]</code>&nbsp; as a &nbsp;<code style="background-color: #3cff80;">list of row-labels</code> , <span style="color: red;"><u><span style="color: #1bc25b;"><strong>not as a list of indices</span></strong></u></span></div>

<br>

In [82]:

obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64


<div style="color: #37d26d;"><font size="+2">↳</font> &nbsp;Since the index of the pandas object &nbsp;<code>obj2</code>&nbsp; is of <strong>string</strong> type, therefore it takes &nbsp;<code>[0, 1, 2]</code>&nbsp; as a &nbsp;<code style="background-color: #3cff80;">list of indices</code> only , <span style="color: red;"><u><span style="color: #1bc25b;"><strong>not as a list of row-labels</span></strong></u></span></div>

<br>

<div style="background-color: #c4ffd3; padding: 10px; margin-left: 25px; margin-right: 105px;;">Only when you explicitly define the index of a pandas object as a list of integers, it will consider any list of integers as a &nbsp;<code style="background-color: white;">list of row-labels</code><br>Otherwise it will behave as a normal indexing like that in a numpy array or a Python list
</div>


<br>

###### <code style="color: white; background-color: #6a7eff; font-size: 0.9rem; padding: 3px;">▷ &nbsp;When does <span style="background-color: white; color: black;">loc</span> fail? </code>

<br>

<div style="color: #4c6dff;">When using &nbsp;<code style="background-color: yellow;">loc</code> , the expression &nbsp;<code>obj.loc[[0, 1, 2]]</code>&nbsp; will <span style="color: red;">fail</span> when the index does not contain integers :</div>

In [83]:

obj2.loc[[0, 1, 2]]                                               # throws ERROR because the obj2 has a string type index, not an integer type

KeyError: "None of [Int64Index([0, 1, 2], dtype='int64')] are in the [index]"


<br>

###### <code style="color: white; background-color: #6a7eff; font-size: 0.9rem; padding: 3px;">▷ &nbsp;If <span style="background-color: white; color: black;">loc</span> is already there, then why is <span style="background-color: white; color: black;">iloc</span> introduced? </code>

<br>

<div style="color: #4c6dff;">Since &nbsp;<code style="background-color: yellow;">loc</code>&nbsp; operator indexes <u>exclusively with labels</u> , <span style="background-color: #f2f4f4; padding: 1px;;">&nbsp;there is also an &nbsp;<code style="background-color: yellow;">iloc</code>&nbsp; operator that indexes exclusively with integers to work consistently whether or not the index contains integers : &nbsp;</span></div>

In [84]:

obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [85]:

obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64


<br>

<div style="margin-left: 65px;">

![](../media/pandas_indexing_selecting_filtering_1.PNG)

</div>

In [86]:

obj2.iloc[1:2]                         # row-index  2  is  excluded

b    2
dtype: int64

In [87]:

obj2.loc["b":"c"]                      # row-label  "c"  is  included

b    2
c    3
dtype: int64


<br>

###### <code style="color: white; background-color: #6a7eff; font-size: 0.9rem; padding: 3px;">▷ &nbsp;Assigning values using <span style="background-color: white; color: black;">loc</span> and <span style="background-color: white; color: black;">iloc</span> operator </code>

<br>

<div style="color: #4c6dff;">Assigning values using these &nbsp;<code style="background-color: yellow;">loc</code>&nbsp; & &nbsp;<code style="background-color: yellow;">iloc</code>&nbsp; methods modifies the corresponding section of the Series :</div>

In [88]:

obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])
print('------------- ORIGINAL obj2 -------------')
print(obj2)


obj2.loc["b":"c"] = 5                                             # row-label  "c"  is included     ------>     obj2.loc["c"]  is updated
print('\n------------- MODIFIED obj2 -------------')
obj2

------------- ORIGINAL obj2 -------------
a    1
b    2
c    3
dtype: int64

------------- MODIFIED obj2 -------------

a    1
b    5
c    5
dtype: int64

In [54]:

obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])
print('------------- ORIGINAL obj2 -------------')
print(obj2)


obj2.iloc[1:2] = 6                                                # row-index 2  is  not included     ------>     obj2.loc["c"]  is  not  updated
print('\n------------- MODIFIED obj2 -------------')
obj2

------------- ORIGINAL obj2 -------------
a    1
b    2
c    3
dtype: int64

------------- MODIFIED obj2 -------------

a    1
b    6
c    3
dtype: int64

<br>

<strong>NOTE &nbsp;-</strong>

<div style="margin-left: 60px;">

![](../media/pandas_indexing_selecting_filtering_2.PNG)

</div>


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607; font-size: 0.904rem;">Indexing into a DataFrame retrieves one or more columns either with a single value or sequence :</span>

In [19]:

df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Delhi", "Mumbai", "Bangalore", "Kolkata"],
                    columns=["one", "two", "three", "four"])

df

           one  two  three  four
Delhi        0    1      2     3
Mumbai       4    5      6     7
Bangalore    8    9     10    11
Kolkata     12   13     14    15

In [20]:

df["two"]

Delhi         1
Mumbai        5
Bangalore     9
Kolkata      13
Name: two, dtype: int32

In [21]:

df[["three", "one"]]

           three  one
Delhi          2    0
Mumbai         6    4
Bangalore     10    8
Kolkata       14   12


###### <code style="color: white; background-color: #6a7eff; font-size: 0.9rem; padding: 3px;">▷ Indexing like this has a few special cases </code>

<br>

<div style="color: #4c6dff;"><span style="font-size: 0.8rem; color: #4c6dff;">■</span> &nbsp;The first is slicing or selecting data with a Boolean array :</div>

In [22]:

df[:2]

        one  two  three  four
Delhi     0    1      2     3
Mumbai    4    5      6     7

In [23]:

df["three"] > 5                           # bollean array

Delhi        False
Mumbai        True
Bangalore     True
Kolkata       True
Name: three, dtype: bool

In [24]:

df[df["three"] > 5]

           one  two  three  four
Mumbai       4    5      6     7
Bangalore    8    9     10    11
Kolkata     12   13     14    15


<div style="color: #37d26d;"><font size="+2">↳</font> &nbsp;The row selection syntax &nbsp;<code style="background-color: #6aff7e;">df[:2]</code>&nbsp; is provided as a convenience. &nbsp;Passing a single <span style="color: red;"><u><strong>element</strong> (column)</u></span> or a list to the &nbsp;<code style="background-color: #6aff7e;">[]</code>&nbsp; operator selects columns.</div>


<br>

<div style="margin-left: 17px;">

![](../media/pandas_indexing_selecting_filtering_3.PNG)

</div>

<br>

<div style="display: flex;">
<div><span style="font-size: 0.8rem; color: #4c6dff;">■</span>&nbsp;&nbsp;</div>
<div style="color: #4c6dff;">Another use case is indexing with a Boolean DataFrame, such as one produced by a scalar comparison.</div>
</div>

<span style="color: #e0a9ff; margin-left: 19px;">Consider a DataFrame with all Boolean values produced by comparing with a scalar value :</span>

In [25]:

df < 5

             one    two  three   four
Delhi       True   True   True   True
Mumbai      True  False  False  False
Bangalore  False  False  False  False
Kolkata    False  False  False  False


<div style="color: #37d26d;"><font size="+2">↳</font> &nbsp;We can use this DataFrame to assign the value 0 to each location with the value &nbsp;<code style="background-color: #f5e2ff;">True</code> , like so :</div>

In [26]:

df[df < 5] = 0

df

           one  two  three  four
Delhi        0    0      0     0
Mumbai       0    5      6     7
Bangalore    8    9     10    11
Kolkata     12   13     14    15


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607;">Selection &nbsp;on &nbsp;DataFrame &nbsp;with &nbsp;<code style="background-color: yellow;">loc</code> &nbsp;and &nbsp;<code style="background-color: yellow;">iloc</code></span> &nbsp;&nbsp;&nbsp;&nbsp;<font size="+1">⭐</font>

<br>

<div style="color: #cea3fe; margin-left: 36px;">Like Series, DataFrame has special attributes <code style="background-color: #e1c7ff;">loc</code> and <code style="background-color: #e1c7ff;">iloc</code> for <u>label-based</u> and <u>integer-based</u> <strong>indexing</strong> , respectively. <br>Since DataFrame is <strong>two-dimensional</strong>, you can select a subset of the rows and columns with <u>NumPy-like notation</u> using either <strong>axis labels</strong> ( <code style="background-color: #e1c7ff;">loc</code> ) or <strong>integers</strong> ( <code style="background-color: #e1c7ff;">iloc</code> )</div>

<br>

<div style="margin-left: 100px;">

![](../media/pandas_indexing_selecting_filtering_5.PNG)

</div>


###### <code style="color: white; background-color: #6a7eff; font-size: 0.9rem; padding: 4px;">▷ &nbsp;Selecting a single row by label in a dataframe </code>

In [27]:

df

           one  two  three  four
Delhi        0    0      0     0
Mumbai       0    5      6     7
Bangalore    8    9     10    11
Kolkata     12   13     14    15

In [28]:

df.loc["Mumbai"]                                      # returns a series

one      0
two      5
three    6
four     7
Name: Mumbai, dtype: int32


<span style="color: #4c6dff;"><font size="+2">↳</font> &nbsp;The result of selecting a single row is a Series with an index that contains the DataFrame's column labels .</span>


<font size="+1">⭐</font> &nbsp;<span style="color: red;">However you cannot put a column label like the following :</span>

In [29]:

df.loc["one"]

KeyError: 'one'

<br>

###### <code style="color: white; background-color: #6a7eff; font-size: 0.9rem; padding: 4px;">▷ &nbsp;To select multiple rows, pass a sequence of labels (thus creating a new dataframe) :</code>

In [160]:

df.loc[["Mumbai", "Kolkata"]]

         one  two  three  four
Mumbai     0    5      6     7
Kolkata   12   13     14    15


<br>

<div style="margin-left: 180px;">

![](../media/pandas_indexing_selecting_filtering_4.PNG)

</div>

<span style="color: #4c6dff;"><font size="+2">↳</font> &nbsp;You can combine both <strong>row</strong> and <strong>column</strong> selection in &nbsp;<code style="background-color: yellow;">loc</code>&nbsp; by <span style="color: blue;"><u>separating the selections with a <strong>comma</strong></u></span> :</span>

In [161]:

df.loc["Mumbai", ["two", "three"]]

two      5
three    6
Name: Mumbai, dtype: int32

In [162]:

df.loc[["Mumbai", "Kolkata"], ["two", "three", "four"]]

         two  three  four
Mumbai     5      6     7
Kolkata   13     14    15

<span style="color: #4c6dff;"><font size="+2">↳</font> &nbsp;Similarly, let's now perform some similar selections with <strong>integers</strong> using <code style="background-color: yellow;">iloc</code> :</span>

In [163]:

df.iloc[2]

one       8
two       9
three    10
four     11
Name: Bangalore, dtype: int32

In [164]:

df.iloc[[2, 1]]

           one  two  three  four
Bangalore    8    9     10    11
Mumbai       0    5      6     7

In [165]:

df.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Bangalore, dtype: int32

In [166]:

df.iloc[[1, 2], [3, 0, 1]]

           four  one  two
Mumbai        7    0    5
Bangalore    11    8    9


<br>

###### <code style="color: white; background-color: #6a7eff; font-size: 0.9rem; padding: 4px;">▷ &nbsp;Passing a boolean array into a dataframe</code>

<br>

<div style="margin-left: 100px;">

![](../media/pandas_indexing_selecting_filtering_6.PNG)

</div>

In [167]:

df[[False, True, True, True]]

           one  two  three  four
Mumbai       0    5      6     7
Bangalore    8    9     10    11
Kolkata     12   13     14    15

In [168]:

df.loc[[False, True, True, True]]

           one  two  three  four
Mumbai       0    5      6     7
Bangalore    8    9     10    11
Kolkata     12   13     14    15

In [169]:

df.iloc[[False, True, True, True]]

           one  two  three  four
Mumbai       0    5      6     7
Bangalore    8    9     10    11
Kolkata     12   13     14    15

In [170]:

# summary 

df[[False, True, True, True]]                     # METHOD - 1
df.loc[[False, True, True, True]]                 # METHOD - 2
df.iloc[[False, True, True, True]]                # METHOD - 3

           one  two  three  four
Mumbai       0    5      6     7
Bangalore    8    9     10    11
Kolkata     12   13     14    15

In [171]:

df.three > 5                                           # boolean array

Delhi        False
Mumbai        True
Bangalore     True
Kolkata       True
Name: three, dtype: bool

In [172]:

(df.three > 5).dtype

dtype('bool')

In [173]:

df[df.three > 5]                                       # equivalent to   -------->   df[[False, True, True, True]]

           one  two  three  four
Mumbai       0    5      6     7
Bangalore    8    9     10    11
Kolkata     12   13     14    15

<br>

###### <code style="color: white; background-color: #6a7eff; font-size: 0.9rem; padding: 4px;">▷ &nbsp;Both indexing functions <code style="background-color: white;">loc</code> & <code style="background-color: white;">iloc</code> work with <u><i>slices</i></u> in addition to single labels or lists of labels :</code>

In [174]:

df.loc[:"Bangalore", "two"]

Delhi        0
Mumbai       5
Bangalore    9
Name: two, dtype: int32

In [175]:

df.iloc[:, :3]

           one  two  three
Delhi        0    0      0
Mumbai       0    5      6
Bangalore    8    9     10
Kolkata     12   13     14

In [111]:

df.iloc[:, :3][df.three > 5]

           one  two  three
Mumbai       0    5      6
Bangalore    8    9     10
Kolkata     12   13     14

<br>

###### <code style="color: white; background-color: #6a7eff; font-size: 0.9rem; padding: 4px;">▷ &nbsp;Boolean arrays can be used with <code style="background-color: white;">loc</code> but not <code style="background-color: white;">iloc</code> :</code>

In [112]:

df.loc[df.three >= 2]

           one  two  three  four
Mumbai       0    5      6     7
Bangalore    8    9     10    11
Kolkata     12   13     14    15

In [113]:

df.loc[df.three > 7]

           one  two  three  four
Bangalore    8    9     10    11
Kolkata     12   13     14    15

In [114]:

df.iloc[df.three >= 2]

ValueError: iLocation based boolean indexing cannot use an indexable as a mask

<br>

<div style="margin-left: 30px;">

![](../media/pandas_indexing_selecting_filtering_7.PNG)

</div>

<br>

###### <code style="color: white; background-color: #6a7eff; font-size: 0.9rem; padding: 4px;">▷ &nbsp;Indexing options with DataFrame</code> &nbsp;&nbsp;&nbsp;&nbsp;<font size="+1">⭐</font>

<br>

<div style="color: #0bc413; margin-left: 32px;">

<strong>There are many ways to select and rearrange the data contained in a pandas object.</strong> <br>For DataFrame, the table below provides a short summary of many of them. <br>As you will see later, there are a number of additional options for working with <strong>hierarchical indexes</strong>.

<br>

|    Type    |    Notes    |
|------------|-------------|
| <code style="background-color: yellow;">df[column]         </code> | <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Select single column or sequence of columns from the DataFrame <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;special case conveniences &nbsp;&nbsp;===>&nbsp;&nbsp; <span style="background-color: #ffe8ab;">&nbsp;Boolean array (filter rows)&nbsp;</span> &nbsp;, <span style="background-color: #ffe8ab;">&nbsp;slice (slice rows)&nbsp;</span> &nbsp;, or <span style="background-color: #ffe8ab;">&nbsp;Boolean DataFrame (set values based on some criterion)&nbsp;</span><br>&nbsp; |
| <code style="background-color: yellow;">df.loc[rows]       </code> | <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Select single row or subset of rows from the DataFrame by label<br>&nbsp;   |
| <code style="background-color: yellow;">df.loc[:, cols]    </code> |	<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Select single column or subset of columns by label<br>&nbsp; |
| <code style="background-color: yellow;">df.loc[rows, cols] </code> | <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Select both row(s) and column(s) by label<br>&nbsp;   |
| <code style="background-color: yellow;">df.iloc[rows]      </code> |  <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Select single row or subset of rows from the DataFrame by integer position<br>&nbsp; |
| <code style="background-color: yellow;">df.iloc[:, cols]   </code> | <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Select single column or subset of columns by integer position<br>&nbsp; |
| <code style="background-color: yellow;">df.iloc[rows, cols]</code> | <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Select both row(s) and column(s) by integer position<br>&nbsp; |
| <code style="background-color: yellow;">df.at[row, col]    </code> |	<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Select a single scalar value by row and column label<br>&nbsp;   |
| <code style="background-color: yellow;">df.iat[row, col]   </code> | <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Select a single scalar value by row and column position (integers)<br>&nbsp;  |
| <code style="background-color: yellow;">df.reindex() <span style="color: #aeb6bf;">method</span></code> |	<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Select either rows or columns by labels<br>&nbsp; |

</div>

In [176]:

df.at["Bangalore", "four"]

11

In [177]:

df.iat[2, 3]                         # df.at["Bangalore", "four"]

11


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607; font-size: 0.904rem;">Integer &nbsp;indexing &nbsp;pitfalls</span>

<br>

<div style="color: blue;">Working with pandas objects indexed by integers can be a stumbling block for new users since they work differently from built-in Python data structures like lists and tuples. 

For example, you might not expect the following code to generate an <span style="background-color: #fc9118; color: white;">&nbsp;error&nbsp;</span> :</div>

In [178]:

ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [179]:

ser[-1]

KeyError: -1

<br>

<div style="color: blue;">In this case, pandas could “fall back” on integer indexing, but it is difficult to do this in general without introducing subtle bugs into the user code. <br>Here we have an index containing <code>0</code> , <code>1</code> , and <code>2</code> , but <span style="color: blue;"><strong>pandas does not want to guess what the user wants ( <span style="color: red;"><u><span style="color: blue;">label-based indexing</span></u></span> &nbsp;or&nbsp; <span style="color: red;"><u><span style="color: blue;">position-based</span></u></span> )</strong></span> :</div>

In [180]:

ser

0    0.0
1    1.0
2    2.0
dtype: float64

<br>

<div style="color: blue;">On the other hand , <strong>with a noninteger index, there is no such ambiguity</strong> :</div>

In [181]:

ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [182]:

ser2[-1]                                  # last index

2.0

<br>

<div style="color: blue;">If you have an axis index containing integers, data selection will always be label oriented. <br>As I said above, if you use <code style="background-color: yellow;">loc</code> (for <strong>labels</strong>) or <code style="background-color: yellow;">iloc</code> (for <strong>integers</strong>) you will get exactly what you want :</div>

In [183]:

ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [184]:

ser.iloc[-1]                              # last index

2.0

<br>

<div style="color: blue;">On the other hand, <strong>slicing with integers is always integer oriented</strong> :</div>

In [185]:

ser[:2]

0    0.0
1    1.0
dtype: float64

In [186]:

ser2[:2]

a    0.0
b    1.0
dtype: float64

<br>

<div style="color: blue;">As a result of these pitfalls, it is best to always prefer indexing with <code style="background-color: yellow;">loc</code> and <code style="background-color: yellow;">iloc</code> to avoid ambiguity.</div>


##### <span style="color: #ffb585;">----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<span style="font-size: 0.9rem; color: black; font-size: 1rem;">🔶</span> &nbsp;&nbsp;<span style="color: #f76607; font-size: 0.904rem;">Pitfalls &nbsp;with &nbsp;chained &nbsp;indexing</span>


<div style="color: blue;">In the previous section we looked at how you can do flexible selections on a DataFrame using <code style="background-color: yellow;">loc</code> and <code style="background-color: yellow;">iloc</code> <br>
These indexing attributes can also be used to modify DataFrame objects in place, but doing so requires some care</div>

<br>

<span style="color: #bd6fff;">For example, in the example DataFrame above, we can assign to a column or row by <u>label</u> or <u>integer position</u> :</span>

In [187]:

df

           one  two  three  four
Delhi        0    0      0     0
Mumbai       0    5      6     7
Bangalore    8    9     10    11
Kolkata     12   13     14    15

In [188]:

df.loc[:, "one"] = 1
df

           one  two  three  four
Delhi        1    0      0     0
Mumbai       1    5      6     7
Bangalore    1    9     10    11
Kolkata      1   13     14    15

In [189]:

df.iloc[2] = 5
df

           one  two  three  four
Delhi        1    0      0     0
Mumbai       1    5      6     7
Bangalore    5    5      5     5
Kolkata      1   13     14    15

In [190]:

df["four"] > 5

Delhi        False
Mumbai        True
Bangalore    False
Kolkata       True
Name: four, dtype: bool

In [191]:

df.loc[df["four"] > 5] = 3
df

           one  two  three  four
Delhi        1    0      0     0
Mumbai       3    3      3     3
Bangalore    5    5      5     5
Kolkata      3    3      3     3


<div style="color: blue;">A common gotcha for new pandas users is to <strong>chain selections</strong> when assigning, like this :</div>

In [208]:

df.loc[df.three == 5]["three"] = 6

C:\Users\user\AppData\Local\Temp\ipykernel_11940\3955406236.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[df.three == 5]["three"] = 6


<br>

<div style="color: #bd6fff;">

Depending on the data contents, this may print a special <code style="background-color: #e49bff;">SettingWithCopyWarning</code> , which warns you that you are trying to modify a temporary value (the nonempty result of &nbsp;<code style="background-color: #f1d4ff;">data.loc[data.three == 5]</code> ) instead of the original DataFrame &nbsp;<code style="background-color: #f1d4ff;">df</code> , which might be what you were intending.

Here the dataframe &nbsp;<code style="background-color: #f1d4ff;">df</code>&nbsp; remains unchanged. Let's verify :
</div>

In [209]:

df                                                # the original dataframe remains unchanged

           one  two  three  four
Delhi        1    0      0     0
Mumbai       3    3      3     3
Bangalore    5    5      5     5
Kolkata      3    3      3     3


<div style="color: #bd6fff;">In these scenarios, the fix is to rewrite the chained assignment to use a single &nbsp;<code style="background-color: #e49bff;">loc</code> operation :</div>

In [210]:

df.loc[df.three == 5, "three"] = 6
df

           one  two  three  four
Delhi        1    0      0     0
Mumbai       3    3      3     3
Bangalore    5    5      6     5
Kolkata      3    3      3     3

<br>

<div style="margin-left: 65px;">

<u><span style="color: #08c71f;"><strong>Explaination</strong></span></u>

<br>

![](../media/pandas_indexing_selecting_filtering_8.PNG)

</div>


<div style="color: #bd6fff;"><strong>A good rule of thumb is to avoid chained indexing when doing assignments.</strong> There are other cases where pandas will generate <code style="background-color: #e49bff;">SettingWithCopyWarning</code> that have to do with chained indexing.</div>


#### <br>

<div style="background-color: #ff8b00; color: white; padding: 1px;">&nbsp;&nbsp;INDEXING</div>

<br>

<strong>Indexing in Pandas</strong> refers to selecting and manipulating specific rows, columns, or elements in a DataFrame or Series. &nbsp;It is a fundamental operation for data manipulation, allowing precise and efficient access to subsets of data.


<span style="color: blue;"><u><strong>Types of Indexing in Pandas</strong></u> &nbsp;:</span>
1. &nbsp;&nbsp;<span style="color: red;"><strong>Label</strong>-based indexing</span> &nbsp;<span style="font-size: 1rem;">( </span><code style="background-color: yellow;">.loc</code><span style="font-size: 1rem;"> )</span>
2. &nbsp;&nbsp;<span style="color: red;"><strong>Position</strong>-based indexing</span> &nbsp;<span style="font-size: 1rem;">( </span><code style="background-color: yellow;">.iloc</code><span style="font-size: 1rem;"> )</span>
3. &nbsp;&nbsp;<span style="color: red;"><strong>Mixed</strong> indexing</span> &nbsp;<span style="font-size: 1rem;">( </span><code style="background-color: yellow;">.at</code> , &nbsp;<code style="background-color: yellow;">.iat</code>&nbsp;<span style="font-size: 1rem;">) </span>
4. &nbsp;&nbsp;<span style="color: red;"><strong>Boolean</strong> indexing</span>
5. &nbsp;&nbsp;<span style="color: red;">Advanced indexing with <strong>MultiIndex</strong></span>

<br>

<span style="color: #a4c3ff;">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>


##### <span style="color: black;"><strong>1.</strong></span><code style="color: red; background-color: white; font-size: 0.9rem; padding: 4px;"> Label-Based Indexing with <code style="background-color: yellow;">.loc</code> </code>


<div style="margin-left: 20px;">

- <code style="background-color: yellow;">.loc</code> &nbsp;is &nbsp;used &nbsp;to &nbsp;access &nbsp;data &nbsp;by &nbsp;<strong>label(s)</strong> &nbsp;or &nbsp;<strong>boolean arrays</strong>
- Works &nbsp;with &nbsp;row &nbsp;and &nbsp;column &nbsp;labels
- Explicit &nbsp;Indexing

</div>

<br>
    
<code style="background-color: black; color: white;">Example</code>

In [197]:

data = {
    'col1': [1, 2, 3],
    'col2': [4, 5, 6],
    'col3': [7, 8, 9]
}

df = pd.DataFrame(data, index=['row1', 'row2', 'row3'])
df

      col1  col2  col3
row1     1     4     7
row2     2     5     8
row3     3     6     9


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Accessing &nbsp;Rows</strong></span>

In [98]:

df.loc['row1']                                      # Access  a  single  row  by  label

col1    1
col2    4
col3    7
Name: row1, dtype: int64

In [77]:

df.loc[['row1', 'row3']]                            #  Access  multiple  rows  by  labels

      col1  col2  col3
row1     1     4     7
row3     3     6     9


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Accessing &nbsp;Columns</strong></span>

In [110]:

df.loc[:, 'col2']                                   # Access  a  single  column  by  label

row1    4
row2    5
row3    6
Name: col2, dtype: int64

<br>

<div style="margin-left: 140px;">

![](../media/pandas_indexing_selecting_filtering_9.PNG)

</div>

In [121]:

df.loc[:, ['col1', 'col3']]                         # Access  multiple  columns  by  labels

      col1  col3
row1     1     7
row2     2     8
row3     3     9


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Accessing &nbsp;a &nbsp;Specific &nbsp;Element</strong></span> &nbsp;&nbsp;<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">(at a <u>particular row</u> & a <u>particular column</u>)</code>

In [3]:

df.loc['row1', 'col3']                              # Access  a  specific  element
                                                    # Returns  the  element  at  'row1'  and  'col3'

7


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Accessing &nbsp;a &nbsp;Specific &nbsp;Subset</strong></span> &nbsp;&nbsp;<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">(<u>multiple rows</u> and <u>multiple columns</u>)</code>

In [41]:

df.loc[["row1"], ["col1"]]                          # Access  multiple  row(s)  and  column(s)
                                                    # Returns  a  dataframe  with  a  specific  list  of  row  labels  and  column  labels

      col1
row1     1

In [43]:

df.loc[["row1", "row2"], ["col1", "col2"]]          # Access  multiple  row(s)  and  column(s)
                                                    # Returns  a  dataframe  with  a  specific  list  of  row labels  and  column labels

      col1  col2
row1     1     4
row2     2     5

In [40]:

df.loc[["row1", "row3"], ["col1", "col3"]]          # Access  multiple  rows  &  multiple  columns
                                                    # Returns  a  dataframe  with  a  specific  list  of  row  labels  &  column  labels

      col1  col3
row1     1     7
row3     3     9


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Slicing &nbsp;Rows</strong></span>


<span style="color: blue;">Both &nbsp;startrow &nbsp;& &nbsp;endrow &nbsp;will &nbsp;be &nbsp;included</span>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;">▷ positive slicing of rows :</code>

In [124]:

df.loc['row1':'row3']                               # Slice  rows  using  a  range  of  row  labels
                                                    # Positive  slicing  with  default  step  =  1    ------->    df.loc['row1':'row3' : 1]
                                                    # Includes  both  startrow  "row1"  &  endrow  "row3"

      col1  col2  col3
row1     1     4     7
row2     2     5     8
row3     3     6     9

In [125]:

df.loc['row1':'row3':2]                             # Slice  rows  using  a  range  of  row  labels
                                                    # Positive  slicing  with  step  =  2
                                                    # Includes  both  startrow  "row1"  &  endrow  "row3"

      col1  col2  col3
row1     1     4     7
row3     3     6     9


<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;">▷ Negative slicing of rows :</code>

In [120]:

df.loc['row3' : 'row1' : -1]                        # Slice  rows  using  a  range  of  row  labels
                                                    # Negative  slicing  with  step  =  -1
                                                    # Includes  both  startrow  "row1"  &  endrow  "row3"

      col1  col2  col3
row3     3     6     9
row2     2     5     8
row1     1     4     7


<div style="margin-left: 100px; color: #05c5e7;">

<span style="margin-left: 280px;">In case the range is <strong>not valid</strong>, it returns an <strong>empty frame</strong> :</span>

![](../media/pandas_indexing_selecting_filtering_10.PNG)

</div>


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Slicing &nbsp;Columns</strong></span>


<span style="color: blue;">Both &nbsp;startcolumn &nbsp;& &nbsp;endcolumn &nbsp;will &nbsp;be &nbsp;included</span>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;">▷ positive slicing of columns :</code>

In [150]:

df.loc[ : , 'col1' : 'col3']                        # Slice  columns  using  a  range  of  column  labels
                                                    # Negative  slicing  with  default  step  =  1    ------->    df.loc[ : , 'col1':'col3':1]
                                                    # Includes  both  startcolumn  "col1"  &  endcolumn  "col3"

      col1  col2  col3
row1     1     4     7
row2     2     5     8
row3     3     6     9

In [156]:

df.loc[ : , 'col1' : 'col3' : 2]                    # Positive  slicing  with  step  =  2
                                                    # Includes  both  endcolumns  "col1"  &  "col3"

      col1  col3
row1     1     7
row2     2     8
row3     3     9


<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;">▷ negative slicing of columns :</code>

In [166]:

df.loc[ : , 'col3' : 'col1' : -1]                   # Negative  slicing  with  step  =  -1
                                                    # Includes  both  endcolumns  "col3"  &  "col1"

      col3  col2  col1
row1     7     4     1
row2     8     5     2
row3     9     6     3


<div style="margin-left: 100px; color: #05c5e7;">

<span style="margin-left: 297px;">In case the range is <strong>not valid</strong>, it returns an <strong>empty frame</strong> :</span>

![](../media/pandas_indexing_selecting_filtering_11.PNG)

</div>


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Slicing &nbsp;Rows &nbsp;& &nbsp;Columns &nbsp;together</strong></span> &nbsp;&nbsp;<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">(specific frame)</code>

In [181]:

df.loc["row1" : "row3", "col1" : "col3"]            # Slice  multiple  rows  &  multiple  columns
                                                    # Returns  a  dataframe  with  a  specific  row  range  &  a  specific  column  range
                                                    # Includes  both  row  endrows  "row1"  &  "row3"  and  both  endcolumns  "col1"  &  "col3"

      col1  col2  col3
row1     1     4     7
row2     2     5     8
row3     3     6     9

In [29]:

df.loc['row2':'row3', 'col3':'col2':-1]

      col3  col2
row2     8     5
row3     9     6


##### &nbsp;

<span style="color: black;"><strong>2.</strong></span><code style="color: red; background-color: white; font-size: 0.9rem; padding: 4px;"> Position-Based Indexing with <code style="background-color: yellow;">.iloc</code> </code>


<div style="margin-left: 15px;">

- <code style="background-color: yellow;">.iloc</code> &nbsp;is &nbsp;used &nbsp;to &nbsp;access &nbsp;data &nbsp;by &nbsp;<strong>position &nbsp;(integer &nbsp;index)</strong>
- Rows &nbsp;and &nbsp;columns &nbsp;are &nbsp;both &nbsp;accessed &nbsp;via &nbsp;zero-based &nbsp;indexing
- Implicit &nbsp;Indexing

</div>

<br>
    
<code style="background-color: black; color: white;">Example</code>

In [198]:

df

      col1  col2  col3
row1     1     4     7
row2     2     5     8
row3     3     6     9


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Accessing &nbsp;Rows</strong></span>

In [115]:

df.iloc[0]                                      # Access  a  single  row  by  positional  index  0
                                                # row  index  0   --->   1st row

col1    1
col2    4
col3    7
Name: row1, dtype: int64

In [114]:

df.iloc[[0, 2]]                                 # Access  multiple  rows  by  positional  indices  0  &  2
                                                # row  index  0   --->   1st row
                                                # row  index  2   --->   3rd row

      col1  col2  col3
row1     1     4     7
row3     3     6     9


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Accessing &nbsp;Columns</strong></span>

In [8]:

df.iloc[:, 1]                                       # Access  a  single  column  by  positional  index  1
                                                    # column  index  1   --->   2nd  column

row1    4
row2    5
row3    6
Name: col2, dtype: int64

<br>

<div style="margin-left: 180px; color: #05c5e7;">

![](../media/pandas_indexing_selecting_filtering_12.PNG)

</div>


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Accessing &nbsp;a &nbsp;Specific &nbsp;Element</strong></span> &nbsp;&nbsp;<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">(at a <u>particular row</u> & a <u>particular column</u>)</code>

In [9]:

df.iloc[0, 2]                                       # Access  a  specific  element
                                                    # Returns  the  element  at  row  index  0  and  column  index  2

7


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Accessing &nbsp;a &nbsp;Specific &nbsp;Subset</strong></span> &nbsp;&nbsp;<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">(<u>multiple rows</u> and <u>multiple columns</u>)</code>

In [47]:

df.iloc[[0], [0]]                                  # Access  multiple  row(s)  and  column(s)
                                                   # Returns  a  dataframe  with  a  specific  list  of  row indices [0]  and  column indices [0]

      col1
row1     1

In [48]:

df.iloc[[0, 1], [0, 1]]                            # Access  multiple  row(s)  and  column(s)
                                                   # Returns  a  dataframe  with  a  specific  list  of  row  indices  [0,1]  and column  indices  [0,1]

      col1  col2
row1     1     4
row2     2     5

In [ ]:

df.iloc[[0, 2], [0, 2]]                            # Access  multiple  row(s)  and  column(s)
                                                   # Returns  a  dataframe  with  a  specific  list  of  row  indices  [0,2]  and column  indices  [0,2]


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Slicing &nbsp;Rows</strong></span>


<span style="color: blue;">Unlike label based indexing <code style="background-color: yellow;">.loc[]</code> , the start row will be included but <span style="background-color: #f6edff; padding: 4px;"><strong>the end row will not be included</strong> in the position based indexing <code style="background-color: yellow;">.iloc[]</code></span></span>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;">▷ positive slicing of rows :</code>

In [138]:

df.iloc[0 : 2]                                     # Slice  rows  using  a  range  of  row  indices
                                                   # Positive  slicing  with  default  step  =  1    ----------------------->    df.loc[0 : 2 : 1]
                                                   # Includes  startrow  (row index 0)  but  not  endrow  (row index 2)

      col1  col2  col3
row1     1     4     7
row2     2     5     8

In [137]:

df.iloc[0 : 2 : 2]                                 # Slice  rows  using  a  range  of  row  indices
                                                   # Positive  slicing  with  step  =  2
                                                   # Includes  startrow  (row index 0)  but  not  endrow  (row index  2)

      col1  col2  col3
row1     1     4     7


<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;">▷ Negative slicing of rows :</code>

In [139]:

df.iloc[2 : 0 : -1]                                # Slice  rows  using  a  range  of  row  labels
                                                   # Negative  slicing  with  step  =  -1
                                                   # Includes  startrow  (row index 2)  but  not  endrow  (row index  0)

      col1  col2  col3
row3     3     6     9
row2     2     5     8

In [148]:

df.iloc[-3 : -9 : -2]                              # Slice  rows  using  a  range  of  row  labels
                                                   # Negative  slicing  with  step  =  -1
                                                   # Includes  startrow  (row index =  -3)  but  not  endrow  (row index  =  -9)

      col1  col2  col3
row1     1     4     7


<span style="color: #05c5e7;">In case the range of row indices is <strong>not valid</strong>, it will return an <strong>empty frame</strong></span>

In [143]:

df.iloc[7 : 6]

Empty DataFrame
Columns: [col1, col2, col3]
Index: []


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Slicing &nbsp;Columns</strong></span>


<span style="color: blue;">Both &nbsp;startcolumn &nbsp;& &nbsp;endcolumn &nbsp;will &nbsp;be &nbsp;included</span>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;">▷ positive slicing of columns :</code>

In [161]:

df.iloc[ : , 0 : 2]                                 # Slice  columns  using  a  range  of  column  labels
                                                    # Negative  slicing  with  default  step  =  1    -------------------------->    df.loc[ : , 0:2:1]
                                                    # Includes  startcolumn  (column  index  =  0)  but  not  endcolumn  (column  index  =  2)

      col1  col2
row1     1     4
row2     2     5
row3     3     6

In [162]:

df.iloc[ : , 0 : 2 : 2]                             # Positive  slicing  with  step  =  2
                                                    # Includes  startcolumn  (column  index  =  0)  but  not  endcolumn  (column  index  =  2)

      col1
row1     1
row2     2
row3     3


<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;">▷ negative slicing of columns :</code>

In [167]:

df.iloc[ : , 2 : 0 : -1]                            # Negative  slicing  with  step  =  -1
                                                    # Includes  both  endcolumns  "col3"  &  "col1"

      col3  col2
row1     7     4
row2     8     5
row3     9     6


<span style="color: #05c5e7;">In case the range is <strong>not valid</strong>, it returns an <strong>empty frame</strong> :</span>

In [170]:

df.iloc[ : , 7 : 5 : -1]

Empty DataFrame
Columns: []
Index: [row1, row2, row3]


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Slicing &nbsp;Rows &nbsp;& &nbsp;Columns &nbsp;together</strong></span> &nbsp;&nbsp;<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">(specific frame)</code>

In [35]:

df.iloc[0 : 2 , 0 : 2]                              # Slice  multiple  rows  &  multiple  columns
                                                    # Returns  a  dataframe  with  a  specific  row  range  &  a  specific  column  range
                                                    # Includes  startrow  but  not  endrow  ;  similarly  include  startcolumn   but  not   endcolumn

      col1  col2
row1     1     4
row2     2     5

In [37]:

df.iloc[1:2 , 2:0:-1]

      col3  col2
row2     8     5


##### &nbsp;

<span style="color: black;"><strong>3.</strong></span><code style="color: red; background-color: white; font-size: 0.9rem; padding: 4px;"> Mixed Indexing with <code style="background-color: yellow;">.at</code> and <code style="background-color: yellow;">.iat</code> </code>


<div style="margin-left: 20px;">

- <code style="background-color: yellow;">.at </code> &nbsp;&nbsp; →  &nbsp; Fast &nbsp;access &nbsp;for &nbsp;<strong>single &nbsp;elements</strong> &nbsp;by &nbsp;<strong>label</strong>
- <code style="background-color: yellow;">.iat</code> &nbsp;&nbsp; → &nbsp; Fast &nbsp;access &nbsp;for &nbsp;<strong>single &nbsp;elements</strong> &nbsp;by &nbsp;<strong>position</strong>

</div>

In [200]:

df.at['row1', 'col3']                                            # Access single element by label
                                                                 # element  at  row1  and  col3  by  label

7

In [201]:

df.iat[0, 2]                                                     # Access single element by position
                                                                 # element  at  row1  and  col3  by  position  (index)

7


##### &nbsp;

<span style="color: black;"><strong>4.</strong></span><code style="color: red; background-color: white; font-size: 0.9rem; padding: 4px;"> Boolean Indexing </code>


<span style="color: blue;">Boolean indexing allows <strong>selecting data based on <u>conditions</u></strong></span>

<code style="background-color: black; color: white;">Example</code>


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Filter &nbsp;Rows &nbsp;using &nbsp;single &nbsp;condition</strong></span>

In [4]:

df

      col1  col2  col3
row1     1     4     7
row2     2     5     8
row3     3     6     9

In [5]:

df['col2'] > 5

row1    False
row2    False
row3     True
Name: col2, dtype: bool

In [15]:

df[df['col2'] > 5]                                       # Filter rows where col2 > 5

      col1  col2  col3
row3     3     6     9


###### <span style="color: #2fee00; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<strong>Filter &nbsp;Rows &nbsp;using &nbsp;multiple &nbsp;conditions</strong></span>

In [17]:

df['col1'] > 1

row1    False
row2     True
row3     True
Name: col1, dtype: bool

In [18]:

df['col3'] < 9

row1     True
row2     True
row3    False
Name: col3, dtype: bool

In [16]:

(df['col1'] > 1) & (df['col3'] < 9)                      # Filter rows  where  (col1 > 1)  &  (col3 < 9)

row1    False
row2     True
row3    False
dtype: bool

In [12]:

df[(df['col1'] > 1) & (df['col3'] < 9)]

      col1  col2  col3
row2     2     5     8


##### &nbsp;

<span style="color: black;"><strong>5.</strong></span><code style="color: red; background-color: white; font-size: 0.9rem; padding: 4px;"> Advanced Indexing with MultiIndex </code>


<span style="color: blue; margin-left: 23px;">MultiIndex allows for <strong>hierarchical indexing</strong> in rows and columns.</span>

<span style="color: #2ecc71; background-color: white;"><font size="+2">↳</font>&nbsp;<u>Different &nbsp;Ways of Creating a MultiIndex DataFrame</u> &nbsp;<span style="color: #0cda41;"><font size="+1">↴</font></span>


###### <code style="background-color: #fffa4f; font-size: 0.82rem; margin-left: -4px; padding: 4px;">.from_arrays()     </code>

In [25]:
# Given two arrays

groups = ['Group1', 'Group1', 'Group2', 'Group2']
subgroups = ['Subgroup1', 'Subgroup2', 'Subgroup1', 'Subgroup2']

index = pd.MultiIndex.from_arrays([groups, subgroups], names=['group', 'subgroup'])
df_multi = pd.DataFrame({'col1': [1, 10, 100, 1000],
                         'col2': [2, 20, 200, 2000]
                        }, index=index
                       )

df_multi

                  col1  col2
group  subgroup
Group1 Subgroup1     1     2
       Subgroup2    10    20
Group2 Subgroup1   100   200
       Subgroup2  1000  2000

In [94]:
# Given a list of arrays

arrays = [
    ['Group1', 'Group1', 'Group2', 'Group2'],
    ['Subgroup1', 'Subgroup2', 'Subgroup1', 'Subgroup2']
]

index = pd.MultiIndex.from_arrays(arrays, names=['group', 'subgroup'])
df_multi = pd.DataFrame({'col1': [1, 10, 100, 1000],
                         'col2': [2, 20, 200, 2000]
                        }, index=index)

df_multi

                  col1  col2
group  subgroup
Group1 Subgroup1     1     2
       Subgroup2    10    20
Group2 Subgroup1   100   200
       Subgroup2  1000  2000


###### &nbsp;

<code style="background-color: #fffa4f; font-size: 0.82rem; margin-left: -4px; padding: 4px;">.from_tuples()     </code>

In [39]:
# Given a list of tuples

arrays = [('Group1', 'Subgroup1'),
          ('Group1', 'Subgroup2'),
          ('Group2', 'Subgroup1'),
          ('Group2', 'Subgroup2')]

index = pd.MultiIndex.from_tuples(arrays, names=['group', 'subgroup'])
df_multi = pd.DataFrame({'col1': [1, 10, 100, 1000],
                         'col2': [2, 20, 200, 2000]
                        }, index=index)

df_multi

                  col1  col2
group  subgroup
Group1 Subgroup1     1     2
       Subgroup2    10    20
Group2 Subgroup1   100   200
       Subgroup2  1000  2000

In [40]:
# Given a list of arrays

arrays = [
    ['Group1', 'Group1', 'Group2', 'Group2'],
    ['Subgroup1', 'Subgroup2', 'Subgroup3', 'Subgroup4']
]

index = pd.MultiIndex.from_tuples(zip(*arrays), names=['group', 'subgroup'])
df_multi = pd.DataFrame({'col1': [1, 10, 100, 1000],
                         'col2': [2, 20, 200, 2000]
                        }, index=index)

df_multi

                  col1  col2
group  subgroup
Group1 Subgroup1     1     2
       Subgroup2    10    20
Group2 Subgroup3   100   200
       Subgroup4  1000  2000


###### &nbsp;

<code style="background-color: #fffa4f; font-size: 0.82rem; margin-left: -4px; padding: 4px;">.from_product()    </code>

In [41]:
# Given 2 arrays

group = ["Group1", "Group2"]
subgroup = ["Subgroup1", "Subgroup2"]

index = pd.MultiIndex.from_product([group, subgroup], names=('group', 'subgroup'))         # Cartesian Product

df_multi = pd.DataFrame({'col1': [1, 10, 100, 1000],
                         'col2': [2, 20, 200, 2000]
                        }, index=index)


df_multi

                  col1  col2
group  subgroup
Group1 Subgroup1     1     2
       Subgroup2    10    20
Group2 Subgroup1   100   200
       Subgroup2  1000  2000


###### &nbsp;

<code style="background-color: #fffa4f; font-size: 0.82rem; margin-left: -4px; padding: 4px;">.from_frame()      </code>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">step - 1</code>

In [42]:

group_subgroup_dict = {'group' : ['Group1', 'Group1', 'Group2', 'Group2'], 
                       'subgroup' : ['Subgroup1', 'Subgroup2', 'Subgroup1', 'Subgroup2']
                      }

index_df = pd.DataFrame(data = group_subgroup_dict)                                           # pd.DataFrame(group_subgroup_dict)
index_df

    group   subgroup
0  Group1  Subgroup1
1  Group1  Subgroup2
2  Group2  Subgroup1
3  Group2  Subgroup2

<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">step - 2</code>

In [43]:

multi_index = pd.MultiIndex.from_frame(index_df)
multi_index

MultiIndex([('Group1', 'Subgroup1'),
            ('Group1', 'Subgroup2'),
            ('Group2', 'Subgroup1'),
            ('Group2', 'Subgroup2')],
           names=['group', 'subgroup'])

<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">step - 3</code>

In [44]:

df_multi = pd.DataFrame({'col1': [1, 10, 100, 1000],
                         'col2': [2, 20, 200, 2000]
                        }, index=multi_index)

df_multi

                  col1  col2
group  subgroup
Group1 Subgroup1     1     2
       Subgroup2    10    20
Group2 Subgroup1   100   200
       Subgroup2  1000  2000

<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">▷ solution</code>

In [45]:

group_subgroup_dict = {'group' : ['Group1', 'Group1', 'Group2', 'Group2'], 
                       'subgroup' : ['Subgroup1', 'Subgroup2', 'Subgroup1', 'Subgroup2']
                      }

index_df = pd.DataFrame(data = group_subgroup_dict)                                           # pd.DataFrame(group_subgroup_dict)
multi_index = pd.MultiIndex.from_frame(index_df)
df_multi = pd.DataFrame({'col1': [1, 10, 100, 1000],
                         'col2': [2, 20, 200, 2000]
                        }, index=multi_index)

df_multi

                  col1  col2
group  subgroup
Group1 Subgroup1     1     2
       Subgroup2    10    20
Group2 Subgroup1   100   200
       Subgroup2  1000  2000


###### &nbsp;

<code style="background-color: #fffa4f; font-size: 0.82rem; margin-left: -4px; padding: 4px;">.set_index()       </code> &nbsp;<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">- (most preferred)</code>


<code style="background-color: black; color: white; font-size: 0.7rem;">Example - 1</code>

In [29]:

df_multi = pd.DataFrame(
                {
                    'group' : ['Group1', 'Group1', 'Group2', 'Group2'],
                    'subgroup' : ['Subgroup1', 'Subgroup2', 'Subgroup1', 'Subgroup2'],
                    'col1': [1, 10, 100, 1000],
                    'col2': [2, 20, 200, 2000]
                }
            ).set_index(['group', 'subgroup'])


df_multi

                  col1  col2
group  subgroup
Group1 Subgroup1     1     2
       Subgroup2    10    20
Group2 Subgroup1   100   200
       Subgroup2  1000  2000


<code style="background-color: black; color: white; font-size: 0.7rem;">Example - 2</code>

In [28]:

df_multi = pd.DataFrame(
                {
                    'Region': ['North', 'North', 'South', 'South'],
                    'Category': ['A', 'B', 'A', 'B'],
                    'Sales': [200, 150, 300, 400]
                }
            ).set_index(['Region', 'Category'])


df_multi

                 Sales
Region Category
North  A           200
       B           150
South  A           300
       B           400


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;MultiIndex &nbsp;Dataframe &nbsp;with &nbsp;<span style="color: black;"><strong>more &nbsp;than &nbsp;2 &nbsp;levels</strong></span></span>


<code style="background-color: #ff188c; color: white; font-size: 0.82rem; margin-left: 24px;">Note</code>  <code style="color: #ff188c; background-color: white; font-size: 0.82rem;">&nbsp;-&nbsp; You can have levels of different lengths</code>

In [2]:

df_multi = pd.DataFrame(
                data = {
                        'col1': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
                        'col2': ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't'],
                        'col3': [-1, -2, -3, -4, -5, -6, -7, -8, -9, -10, -11, -12, -13, -14, -15, -16, -17, -18, -19, -20]
                       },
                index = pd.MultiIndex.from_tuples(
                            [('Group1', 'SubGroup1', 'SubSubGroup1'), 
                             ('Group1', 'SubGroup1', 'SubSubGroup2'),
                             ('Group1', 'SubGroup2', 'SubSubGroup1'),
                             ('Group1', 'SubGroup3', 'SubSubGroup1'),
                             ('Group1', 'SubGroup3', 'SubSubGroup2'),
                             ('Group1', 'SubGroup3', 'SubSubGroup3'),
                             ('Group2', 'SubGroup1', 'SubSubGroup1'),
                             ('Group2', 'SubGroup1', 'SubSubGroup2'),
                             ('Group2', 'SubGroup1', 'SubSubGroup3'),
                             ('Group2', 'SubGroup3', 'SubSubGroup1'),
                             ('Group2', 'SubGroup3', 'SubSubGroup3'),
                             ('Group3', 'SubGroup1', 'SubSubGroup1'),
                             ('Group3', 'SubGroup1', 'SubSubGroup2'),
                             ('Group3', 'SubGroup1', 'SubSubGroup3'),
                             ('Group3', 'SubGroup2', 'SubSubGroup1'),
                             ('Group3', 'SubGroup2', 'SubSubGroup2'),
                             ('Group3', 'SubGroup2', 'SubSubGroup3'),
                             ('Group3', 'SubGroup3', 'SubSubGroup1'),
                             ('Group3', 'SubGroup3', 'SubSubGroup2'),
                             ('Group3', 'SubGroup3', 'SubSubGroup3')
                            ], names=['Group', 'SubGroup', 'SubSubGroup']
                        )
            )


df_multi

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
       SubGroup2 SubSubGroup1     3    c    -3
       SubGroup3 SubSubGroup1     4    d    -4
                 SubSubGroup2     5    e    -5
                 SubSubGroup3     6    f    -6
Group2 SubGroup1 SubSubGroup1     7    g    -7
                 SubSubGroup2     8    h    -8
                 SubSubGroup3     9    i    -9
       SubGroup3 SubSubGroup1    10    j   -10
                 SubSubGroup3    11    k   -11
Group3 SubGroup1 SubSubGroup1    12    l   -12
                 SubSubGroup2    13    m   -13
                 SubSubGroup3    14    n   -14
       SubGroup2 SubSubGroup1    15    o   -15
                 SubSubGroup2    16    p   -16
                 SubSubGroup3    17    q   -17
       SubGroup3 SubSubGroup1    18    r   -18
                 SubSubGroup2    19    s   -19
                 SubSubGroup3    20    t   -20


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Access &nbsp;a &nbsp;Specific &nbsp;Group &nbsp;Using &nbsp;<code style="background-color: yellow;">.loc</code></span>

In [150]:

df_multi.loc['Group2']                                                             # access  a  specific  group

                        col1 col2  col3
SubGroup  SubSubGroup
SubGroup1 SubSubGroup1     7    g    -7
          SubSubGroup2     8    h    -8
          SubSubGroup3     9    i    -9
SubGroup3 SubSubGroup1    10    j   -10
          SubSubGroup3    11    k   -11


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Access &nbsp;Multiple &nbsp;Groups &nbsp;Using &nbsp;<code style="background-color: yellow;">.loc</code></span>

In [149]:

df_multi.loc[['Group1', 'Group2']]                                                 # access  multiple  groups

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
       SubGroup2 SubSubGroup1     3    c    -3
       SubGroup3 SubSubGroup1     4    d    -4
                 SubSubGroup2     5    e    -5
                 SubSubGroup3     6    f    -6
Group2 SubGroup1 SubSubGroup1     7    g    -7
                 SubSubGroup2     8    h    -8
                 SubSubGroup3     9    i    -9
       SubGroup3 SubSubGroup1    10    j   -10
                 SubSubGroup3    11    k   -11


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Access &nbsp;a &nbsp; Specific &nbsp;Column</span>

In [151]:

df_multi.loc[ : , 'col2']                                                        # access  the  2nd  column

Group   SubGroup   SubSubGroup
Group1  SubGroup1  SubSubGroup1    a
                   SubSubGroup2    b
        SubGroup2  SubSubGroup1    c
        SubGroup3  SubSubGroup1    d
                   SubSubGroup2    e
                   SubSubGroup3    f
Group2  SubGroup1  SubSubGroup1    g
                   SubSubGroup2    h
                   SubSubGroup3    i
        SubGroup3  SubSubGroup1    j
                   SubSubGroup3    k
Group3  SubGroup1  SubSubGroup1    l
                   SubSubGroup2    m
                   SubSubGroup3    n
        SubGroup2  SubSubGroup1    o
                   SubSubGroup2    p
                   SubSubGroup3    q
        SubGroup3  SubSubGroup1    r
                   SubSubGroup2    s
                   SubSubGroup3    t
Name: col2, dtype: object


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Access &nbsp;Multiple &nbsp;Columns</span>

In [152]:

df_multi.loc[ : , ['col1', 'col3']]                                              # access  the  1st  &  the  3rd  column

                               col1  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    -1
                 SubSubGroup2     2    -2
       SubGroup2 SubSubGroup1     3    -3
       SubGroup3 SubSubGroup1     4    -4
                 SubSubGroup2     5    -5
                 SubSubGroup3     6    -6
Group2 SubGroup1 SubSubGroup1     7    -7
                 SubSubGroup2     8    -8
                 SubSubGroup3     9    -9
       SubGroup3 SubSubGroup1    10   -10
                 SubSubGroup3    11   -11
Group3 SubGroup1 SubSubGroup1    12   -12
                 SubSubGroup2    13   -13
                 SubSubGroup3    14   -14
       SubGroup2 SubSubGroup1    15   -15
                 SubSubGroup2    16   -16
                 SubSubGroup3    17   -17
       SubGroup3 SubSubGroup1    18   -18
                 SubSubGroup2    19   -19
                 SubSubGroup3    20   -20


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Access &nbsp;Groups &nbsp;& &nbsp;Columns &nbsp;Together</span>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -3px;">Access a specific group & a specific column :</code>

In [155]:

df_multi.loc['Group1', 'col2']                                                   # access a specific group & a specific column

SubGroup   SubSubGroup
SubGroup1  SubSubGroup1    a
           SubSubGroup2    b
SubGroup2  SubSubGroup1    c
SubGroup3  SubSubGroup1    d
           SubSubGroup2    e
           SubSubGroup3    f
Name: col2, dtype: object

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -3px;">Access a specific group & multiple columns :</code>

In [157]:

df_multi.loc['Group1', ['col1', 'col3']]                                         # access a specific group & multiple columns

                        col1  col3
SubGroup  SubSubGroup
SubGroup1 SubSubGroup1     1    -1
          SubSubGroup2     2    -2
SubGroup2 SubSubGroup1     3    -3
SubGroup3 SubSubGroup1     4    -4
          SubSubGroup2     5    -5
          SubSubGroup3     6    -6

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -3px;">Access multiple group & a specific column :</code>

In [160]:

df_multi.loc[['Group1', 'Group3'], 'col2']                                       # access multiple groups & a specific column

Group   SubGroup   SubSubGroup
Group1  SubGroup1  SubSubGroup1    a
                   SubSubGroup2    b
        SubGroup2  SubSubGroup1    c
        SubGroup3  SubSubGroup1    d
                   SubSubGroup2    e
                   SubSubGroup3    f
Group3  SubGroup1  SubSubGroup1    l
                   SubSubGroup2    m
                   SubSubGroup3    n
        SubGroup2  SubSubGroup1    o
                   SubSubGroup2    p
                   SubSubGroup3    q
        SubGroup3  SubSubGroup1    r
                   SubSubGroup2    s
                   SubSubGroup3    t
Name: col2, dtype: object

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -3px;">Access multiple groups and multiple columns :</code>

In [161]:

df_multi.loc[['Group1', 'Group3'], ['col2', 'col3']]                             # access multiple groups & multiple columns

                              col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1    a    -1
                 SubSubGroup2    b    -2
       SubGroup2 SubSubGroup1    c    -3
       SubGroup3 SubSubGroup1    d    -4
                 SubSubGroup2    e    -5
                 SubSubGroup3    f    -6
Group3 SubGroup1 SubSubGroup1    l   -12
                 SubSubGroup2    m   -13
                 SubSubGroup3    n   -14
       SubGroup2 SubSubGroup1    o   -15
                 SubSubGroup2    p   -16
                 SubSubGroup3    q   -17
       SubGroup3 SubSubGroup1    r   -18
                 SubSubGroup2    s   -19
                 SubSubGroup3    t   -20


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Access &nbsp;a &nbsp; Specific &nbsp;Row &nbsp;Using &nbsp;<code style="background-color: yellow;">.loc</code> &nbsp;with &nbsp;a &nbsp;<span style="color: black;"><u><strong>Tuple</strong></u></span></span>

In [3]:

df_multi.loc[('Group1', 'SubGroup2', 'SubSubGroup1')]                             # access a specific row of a MultiIndex DataFrame

col1     3
col2     c
col3    -3
Name: (Group1, SubGroup2, SubSubGroup1), dtype: object


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Access &nbsp;Multiple &nbsp;Rows &nbsp;Using &nbsp;<code style="background-color: yellow;">.loc</code> &nbsp;with &nbsp;<span style="color: black;"><u><strong>a &nbsp;list &nbsp;of &nbsp;Tuples</strong></u></span></span>

In [32]:

df_multi.loc[[('Group1', 'SubGroup2', 'SubSubGroup1'), 
              ('Group3', 'SubGroup1', 'SubSubGroup2')]]                           # access multiple rows of a MultiIndex DataFrame

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup2 SubSubGroup1     3    c    -3
Group3 SubGroup1 SubSubGroup2    13    m   -13


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Access &nbsp;Row(s) &nbsp;& &nbsp;Column(s) &nbsp;Together</span>

In [44]:

df_multi.loc[[('Group1', 'SubGroup2', 'SubSubGroup1'), 
              ('Group3', 'SubGroup1', 'SubSubGroup2')], 'col2']                   # access multiple rows of a MultiIndex DataFrame

Group   SubGroup   SubSubGroup
Group1  SubGroup2  SubSubGroup1    c
Group3  SubGroup1  SubSubGroup2    m
Name: col2, dtype: object

In [45]:

df_multi.loc[[('Group1', 'SubGroup2', 'SubSubGroup1'), 
              ('Group3', 'SubGroup1', 'SubSubGroup2')], ['col2', 'col3']]         # access multiple rows of a MultiIndex DataFrame

                              col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup2 SubSubGroup1    c    -3
Group3 SubGroup1 SubSubGroup2    m   -13


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Slicing &nbsp;Groups</span>

In [33]:

df_multi.loc['Group1':'Group3']                                                   # slicing groups

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
       SubGroup2 SubSubGroup1     3    c    -3
       SubGroup3 SubSubGroup1     4    d    -4
                 SubSubGroup2     5    e    -5
                 SubSubGroup3     6    f    -6
Group2 SubGroup1 SubSubGroup1     7    g    -7
                 SubSubGroup2     8    h    -8
                 SubSubGroup3     9    i    -9
       SubGroup3 SubSubGroup1    10    j   -10
                 SubSubGroup3    11    k   -11
Group3 SubGroup1 SubSubGroup1    12    l   -12
                 SubSubGroup2    13    m   -13
                 SubSubGroup3    14    n   -14
       SubGroup2 SubSubGroup1    15    o   -15
                 SubSubGroup2    16    p   -16
                 SubSubGroup3    17    q   -17
       SubGroup3 SubSubGroup1    18    r   -18
                 SubSubGroup2    19    s   -19
                 SubSubGroup3    20    t   -20


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Slicing &nbsp;Columns</span>

In [79]:

df_multi.loc[ : , 'col1' : 'col3']                                                # slicing columns

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
       SubGroup2 SubSubGroup1     3    c    -3
       SubGroup3 SubSubGroup1     4    d    -4
                 SubSubGroup2     5    e    -5
                 SubSubGroup3     6    f    -6
Group2 SubGroup1 SubSubGroup1     7    g    -7
                 SubSubGroup2     8    h    -8
                 SubSubGroup3     9    i    -9
       SubGroup3 SubSubGroup1    10    j   -10
                 SubSubGroup3    11    k   -11
Group3 SubGroup1 SubSubGroup1    12    l   -12
                 SubSubGroup2    13    m   -13
                 SubSubGroup3    14    n   -14
       SubGroup2 SubSubGroup1    15    o   -15
                 SubSubGroup2    16    p   -16
                 SubSubGroup3    17    q   -17
       SubGroup3 SubSubGroup1    18    r   -18
                 SubSubGroup2    19    s   -19
                 SubSubGroup3    20    t   -20


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Slicing &nbsp;Groups &nbsp;& &nbsp;Columns &nbsp;Together</span>

In [35]:

df_multi.loc['Group1' : 'Group2', 'col1']                                         # slicing groups & columns

Group   SubGroup   SubSubGroup
Group1  SubGroup1  SubSubGroup1     1
                   SubSubGroup2     2
        SubGroup2  SubSubGroup1     3
        SubGroup3  SubSubGroup1     4
                   SubSubGroup2     5
                   SubSubGroup3     6
Group2  SubGroup1  SubSubGroup1     7
                   SubSubGroup2     8
                   SubSubGroup3     9
        SubGroup3  SubSubGroup1    10
                   SubSubGroup3    11
Name: col1, dtype: int64

In [36]:

df_multi.loc['Group1' : 'Group2', 'col1' : 'col3']                                # slicing groups & columns

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
       SubGroup2 SubSubGroup1     3    c    -3
       SubGroup3 SubSubGroup1     4    d    -4
                 SubSubGroup2     5    e    -5
                 SubSubGroup3     6    f    -6
Group2 SubGroup1 SubSubGroup1     7    g    -7
                 SubSubGroup2     8    h    -8
                 SubSubGroup3     9    i    -9
       SubGroup3 SubSubGroup1    10    j   -10
                 SubSubGroup3    11    k   -11


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Slicing &nbsp;Rows</span>


<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -3px;">Label based slicing   ====>   both <u>startrow</u> & <u>endrow</u> are included</code>

In [76]:

df_multi.loc[('Group1', 'SubGroup2', 'SubSubGroup2') : ('Group3', 'SubGroup1', 'SubSubGroup2')]                                # slicing rows

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup3 SubSubGroup1     4    d    -4
                 SubSubGroup2     5    e    -5
                 SubSubGroup3     6    f    -6
Group2 SubGroup1 SubSubGroup1     7    g    -7
                 SubSubGroup2     8    h    -8
                 SubSubGroup3     9    i    -9
       SubGroup3 SubSubGroup1    10    j   -10
                 SubSubGroup3    11    k   -11
Group3 SubGroup1 SubSubGroup1    12    l   -12
                 SubSubGroup2    13    m   -13


<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -3px;"><u>NOTE</u> - the starting row <code style="background-color: #ffdef9;">('Group1', 'SubGroup2', 'SubSubGroup2')</code> is not present in the MultiIndex DataFrame here, so not included in the output</code>


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Slicing &nbsp;Rows &nbsp;& &nbsp;Columns &nbsp;Together</span>

In [77]:

df_multi.loc[('Group1', 'SubGroup2', 'SubSubGroup2') : ('Group3', 'SubGroup1', 'SubSubGroup2') , 'col2' : 'col3']              # slicing rows & columns

                              col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup3 SubSubGroup1    d    -4
                 SubSubGroup2    e    -5
                 SubSubGroup3    f    -6
Group2 SubGroup1 SubSubGroup1    g    -7
                 SubSubGroup2    h    -8
                 SubSubGroup3    i    -9
       SubGroup3 SubSubGroup1    j   -10
                 SubSubGroup3    k   -11
Group3 SubGroup1 SubSubGroup1    l   -12
                 SubSubGroup2    m   -13


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Access &nbsp;a &nbsp;Specific &nbsp;SubGroup &nbsp;of &nbsp;a &nbsp;Specific &nbsp;Group &nbsp;Using &nbsp;<code style="background-color: yellow;">.loc</code> &nbsp;with &nbsp;a &nbsp;<span style="color: black;"><u><strong>Tuple</strong></u></span></span>

In [80]:

df_multi.loc[('Group1', 'SubGroup3')]                                             # access a specific SubGroup of a specific Group

              col1 col2  col3
SubSubGroup
SubSubGroup1     4    d    -4
SubSubGroup2     5    e    -5
SubSubGroup3     6    f    -6


<span style="color: #a245ff; background-color: white; font-size: 0.85rem;">However, &nbsp;accessing &nbsp;<strong>multiple &nbsp;subgroups</strong> &nbsp;using &nbsp;<code style="background-color: #fffa56;">.loc</code> &nbsp;with &nbsp;a &nbsp;list &nbsp;of &nbsp;tuples &nbsp;like &nbsp;the &nbsp;following &nbsp;<strong><u>would &nbsp;not &nbsp;work</u></strong> &nbsp;because &nbsp;<span style="background-color: #f6f1ff; color: #a245ff;">using &nbsp;tuples &nbsp;with &nbsp;only &nbsp;two &nbsp;levels &nbsp;(Group & SubGroup) &nbsp;is &nbsp;not &nbsp;sufficient &nbsp;for &nbsp;indexing &nbsp;in &nbsp;a &nbsp;MultiIndex &nbsp;that &nbsp;expects &nbsp;all &nbsp;three &nbsp;levels.</span></span>

<div style="margin-left: -3px;">

![](../media/pandas_indexing_selecting_filtering_20.PNG)

</div>


&nbsp;<span style="color: #a245ff; background-color: white; font-size: 0.85rem;">Therefore &nbsp;if &nbsp;you &nbsp;want &nbsp;to &nbsp;<u>access</u> , &nbsp;<u>filter</u> &nbsp;or &nbsp;<u>slice</u> &nbsp;a &nbsp;multiindex &nbsp;dataframe &nbsp;based &nbsp;on &nbsp; <span style="background-color: #f9e9ff;">&nbsp;<strong>subgroups</strong>&nbsp;</span> , &nbsp;there &nbsp;are &nbsp;basically &nbsp;4 &nbsp;ways &nbsp;to &nbsp;do &nbsp;it :</span>

<div style="color: #a245ff;">

1. &nbsp;&nbsp;<span style="color: white; background-color: #a245ff">&nbsp;partial &nbsp;slicing &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span> &nbsp;&nbsp;using &nbsp;&nbsp;<code style="background-color: #ffe20e; font-size: 0.82rem;">.loc[]</code> &nbsp;&nbsp;& &nbsp;&nbsp;<code style="background-color: #ffe20e; font-size: 0.82rem;">slice(None)</code>                                                 <br>

2. &nbsp;&nbsp;<span style="color: white; background-color: #a245ff">&nbsp;enhanced &nbsp;readability </span> &nbsp;&nbsp;&nbsp;using &nbsp;&nbsp;<code style="background-color: #ffe20e; font-size: 0.82rem;">.loc[]</code> &nbsp;&nbsp;& &nbsp;&nbsp;<code style="background-color: #ffe20e; font-size: 0.82rem;">pd.IndexSlice[]</code>                                             <br>

3. &nbsp;&nbsp;<span style="color: white; background-color: #a245ff">&nbsp;boolean__indexing&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>&nbsp;&nbsp;&nbsp;using &nbsp;&nbsp;<code style="background-color: #ffe20e; font-size: 0.82rem;">df.index.get_level_values()</code>          <br>

4. &nbsp;&nbsp;<span style="color: white; background-color: #a245ff">&nbsp;cross &nbsp;sectioning&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span>&nbsp;&nbsp;&nbsp;using &nbsp;&nbsp;<code style="background-color: #ffe20e; font-size: 0.85rem;">.xs</code>

</div>

<br>


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;<u>Access</u> / <u>Slice</u> / <u>Filter</u> &nbsp;<span style="background-color: #0abd38; color: white; font-size: 0.83rem;"> Multiple &nbsp;SubGroups </span></span>


<code style="color: #ff188c; background-color: white; font-size: 0.85rem; margin-left: -3px;">1. use slicing method <code style="background-color: #ffe20e; font-size: 0.84rem;">slice(None)</code> on <u>partial levels</u> of a MultiIndex DataFrame</code>

<code style="background-color: black; color: white; font-size: 0.8rem; margin-left: 5px;">Example - 1</code>

In [94]:
# EXAMPLE - 1

df_filtered = df_multi.loc[(slice(None), 'SubGroup3', slice(None)), :]                                                  # slicing  with  slice(None)
df_filtered

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup3 SubSubGroup1     4    d    -4
                 SubSubGroup2     5    e    -5
                 SubSubGroup3     6    f    -6
Group2 SubGroup3 SubSubGroup1    10    j   -10
                 SubSubGroup3    11    k   -11
Group3 SubGroup3 SubSubGroup1    18    r   -18
                 SubSubGroup2    19    s   -19
                 SubSubGroup3    20    t   -20

<code style="background-color: black; color: white; font-size: 0.8rem; margin-left: 5px;">Example - 2</code>

In [92]:

df_filtered = df_multi.loc[(slice(None), ['SubGroup1', 'SubGroup2'], slice(None)), :]                                   # slicing with slice(None)
df_filtered

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
       SubGroup2 SubSubGroup1     3    c    -3
Group2 SubGroup1 SubSubGroup1     7    g    -7
                 SubSubGroup2     8    h    -8
                 SubSubGroup3     9    i    -9
Group3 SubGroup1 SubSubGroup1    12    l   -12
                 SubSubGroup2    13    m   -13
                 SubSubGroup3    14    n   -14
       SubGroup2 SubSubGroup1    15    o   -15
                 SubSubGroup2    16    p   -16
                 SubSubGroup3    17    q   -17

<code style="background-color: black; color: white; font-size: 0.8rem; margin-left: 5px;">Example - 3</code>

In [93]:

df_filtered = df_multi.loc[(['Group1', 'Group3'], ['SubGroup1', 'SubGroup2'], slice(None)), 'col1' : 'col3']            # slicing with slice(None)
df_filtered

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
       SubGroup2 SubSubGroup1     3    c    -3
Group3 SubGroup1 SubSubGroup1    12    l   -12
                 SubSubGroup2    13    m   -13
                 SubSubGroup3    14    n   -14
       SubGroup2 SubSubGroup1    15    o   -15
                 SubSubGroup2    16    p   -16
                 SubSubGroup3    17    q   -17

<br>

<code style="color: #ff188c; background-color: white; font-size: 0.85rem; margin-left: -3px;">2. use <code style="background-color: #ffe20e; font-size: 0.84rem;">pd.IndexSlice</code> for <u>Readability</u> &nbsp;-&nbsp; to filter multiple Group and SubGroup combinations :</code>

<code style="background-color: black; color: white; font-size: 0.8rem; margin-left: 5px;">Example - 1</code>

In [95]:

df_filtered = df_multi.loc[pd.IndexSlice[:, ['SubGroup2', 'SubGroup3'], :], :]
df_filtered

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup2 SubSubGroup1     3    c    -3
       SubGroup3 SubSubGroup1     4    d    -4
                 SubSubGroup2     5    e    -5
                 SubSubGroup3     6    f    -6
Group2 SubGroup3 SubSubGroup1    10    j   -10
                 SubSubGroup3    11    k   -11
Group3 SubGroup2 SubSubGroup1    15    o   -15
                 SubSubGroup2    16    p   -16
                 SubSubGroup3    17    q   -17
       SubGroup3 SubSubGroup1    18    r   -18
                 SubSubGroup2    19    s   -19
                 SubSubGroup3    20    t   -20

<code style="background-color: black; color: white; font-size: 0.8rem; margin-left: 5px;">Example - 2</code>

In [96]:

df_filtered = df_multi.loc[pd.IndexSlice[['Group1', 'Group3'], ['SubGroup3', 'SubGroup1'], :], :]
df_filtered

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup3 SubSubGroup1     4    d    -4
                 SubSubGroup2     5    e    -5
                 SubSubGroup3     6    f    -6
       SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
Group3 SubGroup3 SubSubGroup1    18    r   -18
                 SubSubGroup2    19    s   -19
                 SubSubGroup3    20    t   -20
       SubGroup1 SubSubGroup1    12    l   -12
                 SubSubGroup2    13    m   -13
                 SubSubGroup3    14    n   -14

<code style="background-color: black; color: white; font-size: 0.8rem; margin-left: 5px;">Example - 3</code>

In [97]:

df_filtered = df_multi.loc[pd.IndexSlice['Group1' : 'Group2', ['SubGroup3', 'SubGroup1'], :], 'col2']
df_filtered

Group   SubGroup   SubSubGroup
Group1  SubGroup1  SubSubGroup1    a
                   SubSubGroup2    b
        SubGroup3  SubSubGroup1    d
                   SubSubGroup2    e
                   SubSubGroup3    f
Group2  SubGroup1  SubSubGroup1    g
                   SubSubGroup2    h
                   SubSubGroup3    i
        SubGroup3  SubSubGroup1    j
                   SubSubGroup3    k
Name: col2, dtype: object

<br>

<code style="color: #ff188c; background-color: white; font-size: 0.9rem; margin-left: -3px;">3. <code style="font-size: 0.83rem; background-color: #ff188c; color: white;">boolean filtering</code> on specific levels using <code style="background-color: #ffe20e; font-size: 0.84rem;">df.index.get_level_values</code></code>

<code style="background-color: black; color: white; font-size: 0.8rem; margin-left: 5px;">Example - 1</code>

In [103]:

df_multi.index

MultiIndex([('Group1', 'SubGroup1', 'SubSubGroup1'),
            ('Group1', 'SubGroup1', 'SubSubGroup2'),
            ('Group1', 'SubGroup2', 'SubSubGroup1'),
            ('Group1', 'SubGroup3', 'SubSubGroup1'),
            ('Group1', 'SubGroup3', 'SubSubGroup2'),
            ('Group1', 'SubGroup3', 'SubSubGroup3'),
            ('Group2', 'SubGroup1', 'SubSubGroup1'),
            ('Group2', 'SubGroup1', 'SubSubGroup2'),
            ('Group2', 'SubGroup1', 'SubSubGroup3'),
            ('Group2', 'SubGroup3', 'SubSubGroup1'),
            ('Group2', 'SubGroup3', 'SubSubGroup3'),
            ('Group3', 'SubGroup1', 'SubSubGroup1'),
            ('Group3', 'SubGroup1', 'SubSubGroup2'),
            ('Group3', 'SubGroup1', 'SubSubGroup3'),
            ('Group3', 'SubGroup2', 'SubSubGroup1'),
            ('Group3', 'SubGroup2', 'SubSubGroup2'),
            ('Group3', 'SubGroup2', 'SubSubGroup3'),
            ('Group3', 'SubGroup3', 'SubSubGroup1'),
            ('Group3', 'SubGroup3', 'SubSubGroup2'),
            ('Group3', 'SubGroup3', 'SubSubGroup3')],
           names=['Group', 'SubGroup', 'SubSubGroup'])

In [104]:

df_multi.index.get_level_values('SubGroup')

Index(['SubGroup1', 'SubGroup1', 'SubGroup2', 'SubGroup3', 'SubGroup3',
       'SubGroup3', 'SubGroup1', 'SubGroup1', 'SubGroup1', 'SubGroup3',
       'SubGroup3', 'SubGroup1', 'SubGroup1', 'SubGroup1', 'SubGroup2',
       'SubGroup2', 'SubGroup2', 'SubGroup3', 'SubGroup3', 'SubGroup3'],
      dtype='object', name='SubGroup')

In [106]:

df_multi.index.get_level_values('SubGroup').isin(['SubGroup1', 'SubGroup2'])

array([ True,  True,  True, False, False, False,  True,  True,  True,
       False, False,  True,  True,  True,  True,  True,  True, False,
       False, False])

In [105]:

df_filtered = df_multi[df_multi.index.get_level_values('SubGroup').isin(['SubGroup1', 'SubGroup2'])]                 # access multiple SubGroups
df_filtered

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
       SubGroup2 SubSubGroup1     3    c    -3
Group2 SubGroup1 SubSubGroup1     7    g    -7
                 SubSubGroup2     8    h    -8
                 SubSubGroup3     9    i    -9
Group3 SubGroup1 SubSubGroup1    12    l   -12
                 SubSubGroup2    13    m   -13
                 SubSubGroup3    14    n   -14
       SubGroup2 SubSubGroup1    15    o   -15
                 SubSubGroup2    16    p   -16
                 SubSubGroup3    17    q   -17

<code style="background-color: black; color: white; font-size: 0.8rem; margin-left: 5px;">Example - 2</code>

In [98]:

mask = (df_multi.index.get_level_values('Group').isin(['Group1', 'Group3'])) & \
       (df_multi.index.get_level_values('SubGroup').isin(['SubGroup3', 'SubGroup1']))

df_filtered = df_multi[mask]
df_filtered

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
       SubGroup3 SubSubGroup1     4    d    -4
                 SubSubGroup2     5    e    -5
                 SubSubGroup3     6    f    -6
Group3 SubGroup1 SubSubGroup1    12    l   -12
                 SubSubGroup2    13    m   -13
                 SubSubGroup3    14    n   -14
       SubGroup3 SubSubGroup1    18    r   -18
                 SubSubGroup2    19    s   -19
                 SubSubGroup3    20    t   -20


###### <span style="color: #0cda41; font-size: 0.9rem;"><font size="+2">↳</font>&nbsp;&nbsp;Use &nbsp;<code style="background-color: yellow;">.xs</code> &nbsp;for &nbsp;Cross-Section &nbsp;Access</span>


<code style="color: red; background-color: white; font-size: 0.83rem; margin-left: -18px;">  If you want to directly access or filter a specific level (<code style="background-color: #ffdef9;">group</code> / <code style="background-color: #ffdef9;">subgroup</code>) in the MultiIndex :</code>

In [15]:

df_multi.xs('Group1', level='Group')                                   # df_multi.xs(key='Group1',level='group')

                                                                       # access Group1 of the MultiIndex DataFrame

                        col1 col2  col3
SubGroup  SubSubGroup
SubGroup1 SubSubGroup1     1    a    -1
          SubSubGroup2     2    b    -2
SubGroup2 SubSubGroup1     3    c    -3
SubGroup3 SubSubGroup1     4    d    -4
          SubSubGroup2     5    e    -5
          SubSubGroup3     6    f    -6

In [14]:

df_multi.xs('Group2', level='Group')                                   # access Group2 of the MultiIndex DataFrame

                        col1 col2  col3
SubGroup  SubSubGroup
SubGroup1 SubSubGroup1     7    g    -7
          SubSubGroup2     8    h    -8
          SubSubGroup3     9    i    -9
SubGroup3 SubSubGroup1    10    j   -10
          SubSubGroup3    11    k   -11

In [13]:

df_multi.xs('SubGroup1', level='SubGroup')                             # access SubGroup1 of the MultiIndex DataFrame

                     col1 col2  col3
Group  SubSubGroup
Group1 SubSubGroup1     1    a    -1
       SubSubGroup2     2    b    -2
Group2 SubSubGroup1     7    g    -7
       SubSubGroup2     8    h    -8
       SubSubGroup3     9    i    -9
Group3 SubSubGroup1    12    l   -12
       SubSubGroup2    13    m   -13
       SubSubGroup3    14    n   -14

In [12]:

df_multi.xs('SubGroup2', level='SubGroup')                             # access SubGroup2 of the MultiIndex DataFrame

                     col1 col2  col3
Group  SubSubGroup
Group1 SubSubGroup1     3    c    -3
Group3 SubSubGroup1    15    o   -15
       SubSubGroup2    16    p   -16
       SubSubGroup3    17    q   -17


&nbsp;<code style="color: red; background-color: white; font-size: 0.83rem; margin-left: -7px;"><span style="font-size: 1rem;"><strong>Note</strong></span> that you cannot filter multiple keys like the following :</code>

<br>

<div style="margin-left: -5px;">

![](../media/pandas_indexing_selecting_filtering_18.PNG)

</div>

<pre style="font-size: 0.82rem; color: #b83cfe; background-color: white; margin-left: -0.5px;">The error occurs because the xs method in pandas is designed to filter based on a single key. It cannot directly handle multiple keys for filtering.</pre>

<pre style="font-size: 0.82rem; color: #b83cfe; background-color: white; margin-left: -0.5px;">There are few ways around to deal such scenarios :</pre>


<span style="background-color: yellow; padding-top: 4px; padding-bottom: 2px;"> <code style="font-size: 0.84rem; background-color: yellow;">1. using  <code style="background-color: black; color: white;">.xs</code>  (One Key at a Time)  ===>  <span style="color: black;"><i>Cross-section slicing for specific levels</i></span></code></span>


<pre style="font-size: 0.82rem; color: #b83cfe; background-color: white;">Although not recommended, but if you must use <code style="background-color: yellow;"> .xs </code>, you can call it for each key separately and <span style="color: red;"><u><span style="color: #b83cfe;">concatenate the results</span></u></span> :</pre>

In [22]:

filtered_df = pd.concat([
    df_multi.xs(key='SubGroup1', level='SubGroup'),
    df_multi.xs(key='SubGroup2', level='SubGroup')
])

filtered_df

                     col1 col2  col3
Group  SubSubGroup
Group1 SubSubGroup1     1    a    -1
       SubSubGroup2     2    b    -2
Group2 SubSubGroup1     7    g    -7
       SubSubGroup2     8    h    -8
       SubSubGroup3     9    i    -9
Group3 SubSubGroup1    12    l   -12
       SubSubGroup2    13    m   -13
       SubSubGroup3    14    n   -14
Group1 SubSubGroup1     3    c    -3
Group3 SubSubGroup1    15    o   -15
       SubSubGroup2    16    p   -16
       SubSubGroup3    17    q   -17

In [24]:

filtered_df.sort_values(by="col1")

                     col1 col2  col3
Group  SubSubGroup
Group1 SubSubGroup1     1    a    -1
       SubSubGroup2     2    b    -2
       SubSubGroup1     3    c    -3
Group2 SubSubGroup1     7    g    -7
       SubSubGroup2     8    h    -8
       SubSubGroup3     9    i    -9
Group3 SubSubGroup1    12    l   -12
       SubSubGroup2    13    m   -13
       SubSubGroup3    14    n   -14
       SubSubGroup1    15    o   -15
       SubSubGroup2    16    p   -16
       SubSubGroup3    17    q   -17


<span style="background-color: yellow; padding-top: 7px; padding-bottom: 4px;"> <code style="font-size: 0.84rem; background-color: yellow;">2. using  boolean  indexing  <code style="background-color: black; color: white; font-size: 0.78rem;">.get_level_values()</code>  for  flexible  filtering</code></span>

In [18]:

filtered_df = df_multi[df_multi.index.get_level_values('SubGroup').isin(['SubGroup1', 'SubGroup2'])]
filtered_df

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
       SubGroup2 SubSubGroup1     3    c    -3
Group2 SubGroup1 SubSubGroup1     7    g    -7
                 SubSubGroup2     8    h    -8
                 SubSubGroup3     9    i    -9
Group3 SubGroup1 SubSubGroup1    12    l   -12
                 SubSubGroup2    13    m   -13
                 SubSubGroup3    14    n   -14
       SubGroup2 SubSubGroup1    15    o   -15
                 SubSubGroup2    16    p   -16
                 SubSubGroup3    17    q   -17

<br>

<span style="background-color: yellow; padding-top: 3px; padding-bottom: 4px;"> <code style="font-size: 0.84rem; background-color: yellow;">3. using  <code style="background-color: black; color: white; font-size: 0.8rem;">.loc[]</code>  &  <code style="background-color: black; color: white; font-size: 0.8rem;">slice(None)</code>  for  range  slicing</code></span>

<pre style="font-size: 0.82rem; color: #b83cfe; background-color: white; margin-left: 3px;">You can filter using <code style="background-color: yellow;"> .loc </code> by <u>specifying slices</u> or lists for the levels :</pre>

In [19]:

filtered_df = df_multi.loc[(slice(None), ['SubGroup1', 'SubGroup2']), :]
filtered_df

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
       SubGroup2 SubSubGroup1     3    c    -3
Group2 SubGroup1 SubSubGroup1     7    g    -7
                 SubSubGroup2     8    h    -8
                 SubSubGroup3     9    i    -9
Group3 SubGroup1 SubSubGroup1    12    l   -12
                 SubSubGroup2    13    m   -13
                 SubSubGroup3    14    n   -14
       SubGroup2 SubSubGroup1    15    o   -15
                 SubSubGroup2    16    p   -16
                 SubSubGroup3    17    q   -17

<br>

<span style="background-color: yellow; padding-top: 3px; padding-bottom: 4px;"> <code style="font-size: 0.84rem; background-color: yellow;">4. using  <code style="background-color: black; color: white; font-size: 0.8rem;">.loc[]</code>  &  <code style="background-color: black; color: white; font-size: 0.8rem;">pd.IndexSlice</code>  for  complex  slicing  with  <u>enhanced  readability</u></code></span>

<pre style="font-size: 0.82rem; color: #b83cfe; background-color: white; margin-left: 1px;"><u>Enhanced readability</u> for complex slicing</pre>

In [20]:

df_multi.loc[pd.IndexSlice[ : , ['SubGroup1', 'SubGroup2'], : ], : ]

                               col1 col2  col3
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    a    -1
                 SubSubGroup2     2    b    -2
       SubGroup2 SubSubGroup1     3    c    -3
Group2 SubGroup1 SubSubGroup1     7    g    -7
                 SubSubGroup2     8    h    -8
                 SubSubGroup3     9    i    -9
Group3 SubGroup1 SubSubGroup1    12    l   -12
                 SubSubGroup2    13    m   -13
                 SubSubGroup3    14    n   -14
       SubGroup2 SubSubGroup1    15    o   -15
                 SubSubGroup2    16    p   -16
                 SubSubGroup3    17    q   -17

<br>

<span style="color: red; font-size: 0.84rem;"><u>Key Takeaways</u></span>   <br>
&nbsp;&nbsp;<strong>1.</strong> &nbsp;&nbsp;Boolean Indexing is the most flexible and intuitive way to filter multiple keys.   <br>
&nbsp;&nbsp;<strong>2.</strong> &nbsp;&nbsp;<code style="background-color: #ffe20e; font-size: 0.84rem;">.loc</code> is ideal for MultiIndex slicing when working with hierarchical levels. While using <code style="background-color: #ffe20e;  font-size: 0.84rem;">.loc</code>, you can use <code style="background-color: #ffe20e;  font-size: 0.84rem;">slice(None)</code> &nbsp;or&nbsp; <code style="background-color: #ffe20e;  font-size: 0.84rem;">pd.IndexSlice[]</code> for better readability.   <br>
&nbsp;&nbsp;<strong>3.</strong> &nbsp;&nbsp;<code style="background-color: #ffe20e;  font-size: 0.84rem;">.xs</code> is better suited for single-key filtering or accessing cross-sections of the data.   <br>
&nbsp;&nbsp;<strong>4.</strong> &nbsp;&nbsp;For performance, use <code style="background-color: #ffe20e;  font-size: 0.84rem;">.loc</code> or Boolean indexing instead of concatenating results with <code style="background-color: #ffe20e;  font-size: 0.84rem;">.xs</code>


##### &nbsp;

<span style="font-size: 0.7rem; color: blue;">■</span> &nbsp;&nbsp;<code style="color: blue; background-color: white; font-size: 0.9rem; margin-left: -5px;">Key Differences between <code style="background-color: yellow;">.loc</code> & <code style="background-color: yellow;">.iloc</code> </code>

<br>

<div style="margin-left: 100px;">

![](../media/pandas_indexing_selecting_filtering_13.PNG)

</div>


##### &nbsp;

<span style="font-size: 0.7rem; color: blue;">■</span> &nbsp;&nbsp;<code style="color: blue; background-color: white; font-size: 0.9rem; margin-left: -5px;">Filtering or Slicing</code> - &nbsp;<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">what is to be done first when used together?</code>

In [206]:

df

      col1  col2  col3
row1     1     4     7
row2     2     5     8
row3     3     6     9


<span style="color: #ff188c;"><font size="+1">↳</font></span> &nbsp;<code style="color: white; background-color: #ff3c89; font-size: 0.82rem; padding: 2px;">df[slicing][condition]</code>

In [202]:

df['row2':'row3'][ (df['col2'] >= 3) & (df['col3'] > 8) ]

C:\Users\user\AppData\Local\Temp\ipykernel_8708\2630602593.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df['row2':'row3'][ (df['col2'] >= 3) & (df['col3'] > 8) ]

      col1  col2  col3
row3     3     6     9


<span style="color: #ff188c;;"><font size="+1">↳</font></span> &nbsp;<code style="color: white; background-color: #ff3c89; font-size: 0.82rem; padding: 2px;">df[condition][slicing]</code>

In [204]:

df[ (df['col2'] >= 3) & (df['col3'] > 8) ]['row2':'row3']

      col1  col2  col3
row3     3     6     9


<code style="color: white; background-color: black; font-size: 0.82rem;">Key Differences</code>

<div style="margin-left: 20px;">

- <code style="color: white; background-color: #ff3c89; font-size: 0.82rem; padding: 2px;">df[slicing][condition]</code> &nbsp;&nbsp;:&nbsp;&nbsp; Slices first, then applies the condition. <br><span style="margin-left: 190px;">Can result in warnings or misalignment if the condition doesn't align with the sliced DataFrame's index.</span>

- <code style="color: white; background-color: #ff3c89; font-size: 0.82rem; padding: 2px;">df[condition][slicing]</code> &nbsp;&nbsp;:&nbsp;&nbsp; Applies the condition first, reducing the DataFrame to a subset of rows.<br><span style="margin-left: 189px;">Then slices this subset. This <strong>avoids warnings</strong> and ensures <strong>correct results</strong>.</span>

</div>

##### &nbsp;

<span style="font-size: 0.7rem; color: blue;">■</span> &nbsp;&nbsp;<code style="color: blue; background-color: white; font-size: 0.9rem; margin-left: -5px;">Setting and Resetting Index in Pandas</code>


<div style="margin-left: 23px; background-color: #e4fffc; padding-top: 10px;">

1. &nbsp;<code style="background-color: yellow; font-size: 0.8rem;">set_index()</code>     <br>

<div style="margin-left: 60px;">This method allows you to set one or more columns of a DataFrame as the index. <br>By default, this creates a new index while removing the original columns.</div>

2. &nbsp;<code style="background-color: yellow; font-size: 0.8rem;">reset_index()</code>   <br>

<div style="margin-left: 60px;">This method resets the index of a DataFrame, &nbsp;<u>either to the default integer index</u> &nbsp;or&nbsp; by <u>turning the index back into a column</u>.</div>

<br>

</div>


###### &nbsp;

<code style="background-color: yellow; font-size: 0.85rem; margin-left: -4px;"><span style="font-size: 0.72rem; color: #c134ff;">df</span>.set_index()  </code>


<div style="margin-left: 100px;">

![](../media/pandas_indexing_selecting_filtering_14.PNG)

</div>

<div style="margin-left: 132px;">

- <code style="background-color: #efd4ff;">keys   </code> &nbsp;&nbsp;:&nbsp;&nbsp; Column name(s) to set as the index.
- <code style="background-color: #efd4ff;">drop   </code> &nbsp;&nbsp;:&nbsp;&nbsp; If <code>True</code> (default), removes the column(s) used as index from the DataFrame. If False, keeps the column(s) in the DataFrame.
- <code style="background-color: #efd4ff;">inplace</code> &nbsp;&nbsp;:&nbsp;&nbsp; If <code>True</code>, <u>modifies the DataFrame in place</u>. &nbsp;If <code>False</code>, <u>returns a new DataFrame</u>.

</div>

<br>

<span style="color: green;"><strong>Example</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c;">Setting a <span style="color: red;"><u><span style="color: #0cc60c;">Single Column</span></u></span> as Index</span>

In [172]:

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['NY', 'LA', 'SF']
})

df

      Name  Age City
0    Alice   25   NY
1      Bob   30   LA
2  Charlie   35   SF

In [22]:

df_indexed = df.set_index('Name')                        # Set 'Name' as the index   --->   the 'Name' column is dropped from the new dataframe returned
df_indexed

         Age City
Name
Alice     25   NY
Bob       30   LA
Charlie   35   SF


<span style="color: green;"><strong>Example</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c;">Setting <span style="color: red;"><u><span style="color: #0cc60c;">Multiple Columns</span></u></span> as Index</span>

In [23]:

df_multi_index = df.set_index(['City', 'Age'])           # Set ['City', 'Age'] as the index
df_multi_index

             Name
City Age
NY   25     Alice
LA   30       Bob
SF   35   Charlie


<span style="color: green;"><strong>Example</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c;">Keeping the <span style="color: red;"><u><span style="color: #0cc60c;">Original Column</span></u></span></span>

In [24]:

df_kept = df.set_index('Name', drop=False)               # Set 'Name' as the index. Also keep the 'Name' column in the new dataframe returned
df_kept

            Name  Age City
Name
Alice      Alice   25   NY
Bob          Bob   30   LA
Charlie  Charlie   35   SF


<span style="color: green;"><strong>Example</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c;">Modifying the dataframe <span style="color: red;"><u><span style="color: #0cc60c;">inplace</span></u></span></span>

In [32]:

df.set_index('Name', drop=False, inplace=True)
df                                                       # Original DataFrame 'df' is changed

            Name  Age City
Name
Alice      Alice   25   NY
Bob          Bob   30   LA
Charlie  Charlie   35   SF


###### &nbsp;

<code style="background-color: yellow; font-size: 0.85rem; margin-left: -4px;"><span style="font-size: 0.72rem; color: #c134ff;">df</span>.reset_index()</code>

<div style="margin-left: 100px;">

![](../media/pandas_indexing_selecting_filtering_15.PNG)

</div>

<div style="margin-left: 125px;">

- <code style="background-color: #efd4ff;">level  </code> &nbsp;&nbsp;:&nbsp;&nbsp; Level(s) to remove from the index. If <code>None</code> (default), resets the entire index.
- <code style="background-color: #efd4ff;">drop   </code> &nbsp;&nbsp;:&nbsp;&nbsp; If <code>True</code> , removes the index entirely without adding it back as a column.
- <code style="background-color: #efd4ff;">inplace</code> &nbsp;&nbsp;:&nbsp;&nbsp; If <code>True</code> , modifies the DataFrame in place. &nbsp;If <code>False</code> , returns a new DataFrame.

</div>

<br>

<span style="color: green;"><strong>Example</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c;">Resetting the Index</span>

In [28]:

df_indexed

         Age City
Name
Alice     25   NY
Bob       30   LA
Charlie   35   SF

In [33]:

df_reset = df_indexed.reset_index()                               # Resetting the index of the DataFrame back as a column, specifically first column
df_reset

      Name  Age City
0    Alice   25   NY
1      Bob   30   LA
2  Charlie   35   SF


<span style="color: green;"><strong>Example</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c;">Dropping the Index</span>

In [34]:

df_reset_dropped = df_indexed.reset_index(drop=True)              # Reset the index but don't add it back as a column
df_reset_dropped

   Age City
0   25   NY
1   30   LA
2   35   SF


<span style="color: green;"><strong>Example</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c;">Resetting MultiIndex</span>

<span style="color: #d983ff;">For a DataFrame with a MultiIndex , <code style="background-color: yellow; font-size: 0.85rem;">reset_index()</code> moves one or more index levels back to columns.</span>

In [36]:

df_multi_index

             Name
City Age
NY   25     Alice
LA   30       Bob
SF   35   Charlie

In [58]:

df_reset_multi = df_multi_index.reset_index()                                  # Reset the MultiIndex DataFrame
df_reset_multi

  City  Age     Name
0   NY   25    Alice
1   LA   30      Bob
2   SF   35  Charlie


<span style="color: green;"><strong>Example</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c;">Resetting Specific Index Level</span>

In [93]:

df_multi = pd.DataFrame(
                data = {
                        'Value': [10, 20, 30, 40]
                       }, 
                index = pd.MultiIndex.from_tuples(
                            [('A', 1), 
                             ('A', 2), 
                             ('B', 1), 
                             ('B', 2)], names=['Group', 'Subgroup']
                        )
            )

In [86]:

df_multi                                                                       # Example MultiIndex DataFrame

                Value
Group Subgroup
A     1            10
      2            20
B     1            30
      2            40


<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">▷ &nbsp;Reset only <code style="background-color: #ffd4fc; color: black">Subgroup</code> level</code>

In [87]:

df_reset_specific = df_multi.reset_index(level='Subgroup')                     # Reset only 'Subgroup' level
df_reset_specific

       Subgroup  Value
Group
A             1     10
A             2     20
B             1     30
B             2     40


<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">▷ &nbsp;Reset only <code style="background-color: #ffd4fc; color: black">Group</code> level</code>

In [88]:

df_reset_specific = df_multi.reset_index(level='Group')                        # Reset only 'Group' level
df_reset_specific

         Group  Value
Subgroup
1            A     10
2            A     20
1            B     30
2            B     40


<code style="color: #ff188c; background-color: white; font-size: 0.82rem;">▷ &nbsp;Reset all levels</code>

<code style="color: #cd76ff; background-color: white; font-size: 0.82rem;">Example - 1 : MultiIndex DataFrame with 2 levels</code>

In [95]:

df_multi = pd.DataFrame(
                data = {
                        'Value': [10, 20, 30, 40]
                       }, 
                index = pd.MultiIndex.from_tuples(
                            [('A', 1), 
                             ('A', 2), 
                             ('B', 1), 
                             ('B', 2)], names=['Group', 'Subgroup']
                        )
            )

df_multi

                Value
Group Subgroup
A     1            10
      2            20
B     1            30
      2            40

In [90]:

df_reset_all = df_multi.reset_index()                                         # Reset all levels
df_reset_all

  Group  Subgroup  Value
0     A         1     10
1     A         2     20
2     B         1     30
3     B         2     40


<code style="color: #cd76ff; background-color: white; font-size: 0.82rem;">Example - 2 : MultiIndex DataFrame with 3 levels</code>

In [111]:

df_multi = pd.DataFrame(
                data = {
                        'col1': [1, 2, 4, 8],
                        'col2': [10, 20, 40, 80],
                       },
                index = pd.MultiIndex.from_tuples(
                            [('Group1', 'SubGroup1', 'SubSubGroup1') , 
                             ('Group1', 'SubGroup1', 'SubSubGroup2'),
                             ('Group1', 'SubGroup2', 'SubSubGroup2'),
                             ('Group2', 'SubGroup2', 'SubSubGroup2')
                            ], names=['Group', 'SubGroup', 'SubSubGroup']
                        )
            )


df_multi

                               col1  col2
Group  SubGroup  SubSubGroup
Group1 SubGroup1 SubSubGroup1     1    10
                 SubSubGroup2     2    20
       SubGroup2 SubSubGroup2     4    40
Group2 SubGroup2 SubSubGroup2     8    80

In [112]:

df_reset_all = df_multi.reset_index()                                         # Reset all levels
df_reset_all

    Group   SubGroup   SubSubGroup  col1  col2
0  Group1  SubGroup1  SubSubGroup1     1    10
1  Group1  SubGroup1  SubSubGroup2     2    20
2  Group1  SubGroup2  SubSubGroup2     4    40
3  Group2  SubGroup2  SubSubGroup2     8    80


###### &nbsp;

Chaining &nbsp;<code style="background-color: yellow; font-size: 0.85rem;"><span style="font-size: 0.72rem; color: #c134ff;">df</span>.reset_index()</code> &nbsp;& &nbsp;<code style="background-color: yellow; font-size: 0.85rem;"><span style="font-size: 0.72rem; color: #c134ff;">df</span>.reset_index()</code> <code style="color: #ff188c; background-color: white; font-size: 0.82rem;"> -  Switching Between Columns and Index</code>

In [113]:

df

            Name  Age City
Name
Alice      Alice   25   NY
Bob          Bob   30   LA
Charlie  Charlie   35   SF

In [117]:

df_temp = df.set_index('City').reset_index()                # Set 'City' as the index and then reset it
df_temp

  City     Name  Age
0   NY    Alice   25
1   LA      Bob   30
2   SF  Charlie   35


###### &nbsp;

<code style="background-color: yellow; font-size: 0.85rem; margin-left: -4px;"><span style="font-size: 0.72rem; color: #c134ff;">df</span>.sort_index()  </code>

<div style="margin-left: 25px;">

![](../media/pandas_indexing_selecting_filtering_16.PNG)

</div>

<div style="margin-left: 110px; font-size: 0.7rem;">

- <code style="background-color: #efd4ff;">axis          </code>

<div style="margin-left: 158px;">

- <code>0</code> &nbsp;(default) &nbsp;=======>&nbsp; Sort &nbsp;by &nbsp;<strong>row &nbsp;index</strong>
- <code>1</code> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;=======>&nbsp; Sort &nbsp;by &nbsp;<strong>column &nbsp;labels</strong>
    
</div>

- <code style="background-color: #efd4ff;">level         </code>&nbsp;&nbsp;&nbsp;===>&nbsp; For &nbsp;a &nbsp;MultiIndex, &nbsp;you &nbsp;can &nbsp;specify &nbsp;the &nbsp;level(s) &nbsp;to &nbsp;sort &nbsp;by. &nbsp;&nbsp;Default &nbsp;is &nbsp;<code>None</code> , &nbsp;which &nbsp;sorts &nbsp;the &nbsp;entire &nbsp;index

- <code style="background-color: #efd4ff;">ascending     </code>

<div style="margin-left: 158px;">

- <code>True </code> &nbsp;(default) &nbsp;====>&nbsp; Sort &nbsp;in &nbsp;<strong>ascending</strong> &nbsp;order
- <code>False</code> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;====>&nbsp; Sort &nbsp;in &nbsp;<strong>descending</strong> &nbsp;order
    
</div>

- <code style="background-color: #efd4ff;">inplace       </code>

<div style="margin-left: 158px;">

- <code>False </code> &nbsp;(default) &nbsp;===>&nbsp; Return &nbsp;a &nbsp;new &nbsp;sorted &nbsp;DataFrame
- <code>True  </code> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;===>&nbsp; Modify &nbsp;the &nbsp;original &nbsp;DataFrame
    
</div>

- <code style="background-color: #efd4ff;">kind          </code>&nbsp;&nbsp;&nbsp;===>&nbsp; <strong>Sorting algorithm</strong> &nbsp;:&nbsp; <code>quicksort</code> , <code>mergesort</code> , <code>heapsort</code> , <code>stable</code>

- <code style="background-color: #efd4ff;">na_position   </code> &nbsp;&nbsp;===>&nbsp; For <code>NaN</code> values &nbsp;:

<div style="margin-left: 247px;">

- <code>last </code> &nbsp;(default) &nbsp;====>&nbsp; Place &nbsp;them &nbsp;at &nbsp;the &nbsp;end
- <code>first</code> &nbsp;==========>&nbsp; Place &nbsp;them &nbsp;at &nbsp;the &nbsp;beginning

</div>

- <code style="background-color: #efd4ff;">sort_remaining</code> &nbsp;&nbsp;====>&nbsp;&nbsp; For &nbsp;MultiIndex, &nbsp;determines &nbsp;whether &nbsp;to &nbsp;sort &nbsp;the &nbsp;remaining &nbsp;levels &nbsp;if &nbsp;sorting &nbsp;by &nbsp;specific &nbsp;level(s)

- <code style="background-color: #efd4ff;">key           </code> &nbsp;&nbsp;====>&nbsp;&nbsp; A &nbsp;callable &nbsp;function &nbsp;applied &nbsp;to &nbsp;the &nbsp;index &nbsp;or &nbsp;column &nbsp;labels &nbsp;before &nbsp;sorting

</div>

<br>

<span style="color: #0cc60c; font-size: 0.8rem;"><strong>1</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c; font-size: 0.8rem;"><strong>Basic &nbsp;Sorting &nbsp;by &nbsp;Row &nbsp;Index</strong></span>

In [67]:

data = {
    'col2': [1, 2, 3],
    'col1': [4, 5, 6]
}

df = pd.DataFrame(data, index=['b', 'c', 'a'])
df

   col2  col1
b     1     4
c     2     5
a     3     6

In [68]:

sorted_df = df.sort_index()                                # df.sort_index(axis=0)
sorted_df

   col2  col1
a     3     6
b     1     4
c     2     5


<span style="color: #0cc60c; font-size: 0.8rem;"><strong>2</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c; font-size: 0.8rem;"><strong>Sorting &nbsp;by &nbsp;Column &nbsp;Labels</strong></span>

In [69]:

sorted_df = df.sort_index(axis=1)
sorted_df

   col1  col2
b     4     1
c     5     2
a     6     3


<span style="color: #0cc60c; font-size: 0.8rem;"><strong>3</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c; font-size: 0.8rem;"><strong>Sorting &nbsp;in &nbsp;Descending &nbsp;Order</strong></span>

In [70]:

sorted_df = df.sort_index(ascending=False)
sorted_df

   col2  col1
c     2     5
b     1     4
a     3     6


<span style="color: #0cc60c; font-size: 0.8rem;"><strong>4</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c; font-size: 0.8rem;"><strong>Sorting &nbsp;a &nbsp;MultiIndex</strong></span>

In [71]:

index = pd.MultiIndex.from_tuples(
    [('Group1', 'Subgroup2'), 
     ('Group2', 'Subgroup1'), 
     ('Group1', 'Subgroup1'), 
     ('Group2', 'Subgroup2')],
    names=['Group', 'Subgroup']
)

data = {'col1': [10, 20, 30, 40], 
        'col2': [100, 200, 300, 400]}

df = pd.DataFrame(data, index=index)

df

                  col1  col2
Group  Subgroup
Group1 Subgroup2    10   100
Group2 Subgroup1    20   200
Group1 Subgroup1    30   300
Group2 Subgroup2    40   400

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -3px;">Sort by all levels</code>

In [72]:

sorted_df = df.sort_index()                                # Sort by all levels
sorted_df

                  col1  col2
Group  Subgroup
Group1 Subgroup1    30   300
       Subgroup2    10   100
Group2 Subgroup1    20   200
       Subgroup2    40   400

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -3px;">Sort by a specific level</code>

In [73]:

sorted_df = df.sort_index(level='Subgroup')                # Sort by a specific level
sorted_df

                  col1  col2
Group  Subgroup
Group1 Subgroup1    30   300
Group2 Subgroup1    20   200
Group1 Subgroup2    10   100
Group2 Subgroup2    40   400


<span style="color: #0cc60c; font-size: 0.8rem;"><strong>5</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c; font-size: 0.8rem;"><strong>Sorting &nbsp;with &nbsp;NaNs &nbsp;in &nbsp;the &nbsp;Index</strong></span>

In [74]:

data = {'col1': [1, 2, 3], 
        'col2': [4, 5, 6]}

index = ['b', None, 'a']

df = pd.DataFrame(data, index=index)

df

      col1  col2
b        1     4
None     2     5
a        3     6

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -3px;">Sort with NaNs <u>last</u></code>

In [75]:

sorted_df = df.sort_index(na_position='last')              # Sort with NaNs last
sorted_df

      col1  col2
a        3     6
b        1     4
None     2     5

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -3px;">Sort with NaNs <u>first</u></code>

In [76]:

sorted_df = df.sort_index(na_position='first')             # Sort with NaNs first
sorted_df

      col1  col2
None     2     5
a        3     6
b        1     4


<span style="color: #0cc60c; font-size: 0.8rem;"><strong>6</strong> &nbsp;&nbsp;➜</span>&nbsp;&nbsp; <span style="color: #0cc60c; font-size: 0.8rem;"><strong>Custom &nbsp;Sorting &nbsp;Using &nbsp;a &nbsp;Key</strong></span>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -3px;">You can apply a <u>function</u> to the index before sorting.</code>

In [77]:

data = {'col1': [1, 2, 3], 
        'col2': [4, 5, 6]}

index = ['b', None, 'a']

df = pd.DataFrame(data, index=index)

df

      col1  col2
b        1     4
None     2     5
a        3     6

<div>

![](../media/pandas_indexing_selecting_filtering_17.PNG)

</div>

In [6]:

# Attempt - 3

sorted_df = df.sort_index(key=lambda x: x.map(lambda val: val.upper() if isinstance(val, str) else val))
sorted_df

      col1  col2
a        3     6
b        1     4
None     2     5

<div style="font-size: 0.82rem; color: #b83cfe;">
    
As you can see in the output, the indices are still in the lower case. <br>
The issue arises because <strong>sort_index uses the transformed index for sorting purposes but does not replace the original index</strong>. <br>
The <code style="background-color: #e9c1ff;">key</code> parameter modifies the sorting logic, not the original values of the index.

<br>

If you want the indices to actually appear as uppercase in the output, <u>you need to <strong>explicitly modify</strong> the index after sorting</u>.

</div>

<br>

<span style="font-size: 0.7rem; color: red;">■</span> &nbsp;<code style="background-color: white; font-size: 0.8rem; margin-left: rem;">using index method <span style="color: red;">df.index.map()</span></code>

In [9]:

sorted_df = df.sort_index(key=lambda x: x.map(lambda val: val.upper() if isinstance(val, str) else val))

sorted_df.index = sorted_df.index.map(lambda val: val.upper() if isinstance(val, str) else val)                  # Update the index to uppercase

sorted_df

      col1  col2
A        3     6
B        1     4
None     2     5


<span style="font-size: 0.7rem; color: red;">■</span> &nbsp;<code style="background-color: white; font-size: 0.8rem; margin-left: rem;">using index method <span style="color: red;">df.index.str.upper()</span></code>

In [79]:

sorted_df = df.sort_index(key=lambda x: x.map(lambda val: val.upper() if isinstance(val, str) else val))

sorted_df.index = sorted_df.index.str.upper()

sorted_df

      col1  col2
A        3     6
B        1     4
None     2     5


###### &nbsp;

<code style="background-color: black; color: white; font-size: 0.85rem; margin-left: -3px;">Example - 1</code>


<span style="font-size: 0.75rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: #0cc60c;"><u>Setting &nbsp;a &nbsp;Datetime &nbsp;Column &nbsp;as &nbsp;Index</u></span>

<code style="color: #cd76ff; background-color: white; font-size: 0.84rem; margin-left: -3px;">Indexing time-series data efficiently.</code>

In [119]:

df_time = pd.DataFrame({
    'Date': pd.date_range('2024-01-01', periods=5),
    'Sales': [200, 250, 300, 400, 500]
})

df_time

        Date  Sales
0 2024-01-01    200
1 2024-01-02    250
2 2024-01-03    300
3 2024-01-04    400
4 2024-01-05    500

In [128]:

df_time_indexed = df_time.set_index('Date')                                 # Set 'Date' as the index
df_time_indexed

            Sales
Date
2024-01-01    200
2024-01-02    250
2024-01-03    300
2024-01-04    400
2024-01-05    500


<span style="font-size: 0.75rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: #0cc60c;"><u>Resetting &nbsp;After &nbsp;Filtering</u></span>

<code style="color: #cd76ff; background-color: white; font-size: 0.84rem; margin-left: -3px;">Preserving the default index after filtering rows.</span>

In [129]:

df

            Name  Age City
Name
Alice      Alice   25   NY
Bob          Bob   30   LA
Charlie  Charlie   35   SF

In [130]:

df[df['Age'] > 25]

            Name  Age City
Name
Bob          Bob   30   LA
Charlie  Charlie   35   SF

In [131]:

df_filtered = df[df['Age'] > 25].reset_index(drop=True)                     # Filter and reset index
df_filtered

      Name  Age City
0      Bob   30   LA
1  Charlie   35   SF


###### &nbsp;

<code style="background-color: black; color: white; font-size: 0.85rem; margin-left: -3px;">Example - 2</code>


<span style="font-size: 0.75rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: #0cc60c;"><u>Creating &nbsp;and &nbsp;Setting &nbsp;a &nbsp;MultiIndex</u></span>

<pre style="color: #b83cfe;; font-size: 0.84rem; margin-left: 2px;">
You are given the following dataset, and you need to create a <code>MultiIndex</code> DataFrame where the combination of <code style="background-color: #f2ddff;">Region</code> and <code style="background-color: #f2ddff;">Category</code> is used as the index. Then, sort the <code>MultiIndex</code> by <code style="background-color: #f2ddff;">Region</code> and <code style="background-color: #f2ddff;">Category</code>.
</pre>

In [26]:

data = {
    'Region': ['North', 'North', 'South', 'South', 'East', 'East'],
    'Category': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Sales': [200, 150, 300, 400, 250, 100],
    'Profit': [20, 15, 30, 40, 25, 10]
}

df = pd.DataFrame(data)

df

  Region Category  Sales  Profit
0  North        A    200      20
1  North        B    150      15
2  South        A    300      30
3  South        B    400      40
4   East        A    250      25
5   East        B    100      10

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -2px;"><u>Solution</u></code>

In [27]:

df_multi = df.set_index(['Region', 'Category'])                                             # Set 'Region' and 'Category' as MultiIndex
df_multi

                 Sales  Profit
Region Category
North  A           200      20
       B           150      15
South  A           300      30
       B           400      40
East   A           250      25
       B           100      10

In [28]:

df_sorted = df_multi.sort_index()                                                      # Sort the MultiIndex
df_sorted

                 Sales  Profit
Region Category
East   A           250      25
       B           100      10
North  A           200      20
       B           150      15
South  A           300      30
       B           400      40


<span style="font-size: 0.75rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: #0cc60c;"><u>Resetting &nbsp;a &nbsp;MultiIndex</u></span>

<pre style="color: #b83cfe; font-size: 0.84rem; margin-left: 2px;">
You need to reset the <code>MultiIndex</code> for further manipulation, keeping <code style="background-color: #f2ddff;">Region</code> and <code style="background-color: #f2ddff;">Category</code> as regular columns.
</pre>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -2px;"><u>Solution</u></code>

In [29]:

df_reset = df_multi.reset_index()                                                      # Reset the MultiIndex
df_reset

  Region Category  Sales  Profit
0  North        A    200      20
1  North        B    150      15
2  South        A    300      30
3  South        B    400      40
4   East        A    250      25
5   East        B    100      10


<span style="font-size: 0.75rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: #0cc60c;"><u>Sorting &nbsp;MultiIndex &nbsp;by &nbsp;Specific &nbsp;Levels</u></span>

<pre style="color: #b83cfe; font-size: 0.84rem; margin-left: 2px;">
Sort the <code>MultiIndex</code> DataFrame by the <code style="background-color: #f2ddff;">Category</code> level first, followed by the <code style="background-color: #f2ddff;">Region</code>.
</pre>

In [30]:

df_multi

                 Sales  Profit
Region Category
North  A           200      20
       B           150      15
South  A           300      30
       B           400      40
East   A           250      25
       B           100      10

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -2px;"><u>Solution</u></code>

In [31]:

df_sorted_by_category = df_multi.sort_index(level=['Category', 'Region'])              # Sort by 'Category' first, then by 'Region'
df_sorted_by_category

                 Sales  Profit
Region Category
East   A           250      25
North  A           200      20
South  A           300      30
East   B           100      10
North  B           150      15
South  B           400      40


<span style="font-size: 0.75rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: #0cc60c;"><u>Grouping and Aggregating on MultiIndex</u></span>

<pre style="color: #b83cfe; font-size: 0.84rem; margin-left: 2px;">
Group the dataset by <code style="background-color: #f2ddff;">Region</code> in the <code>MultiIndex</code> and calculate the <code style="color: red;"><u><span style="color: #cd76ff;">total sales</span></u></code> and <code style="color: red;"><u><span style="color: #cd76ff;">average profit</span></u></code> for each region.
</pre>

In [32]:

df_multi

                 Sales  Profit
Region Category
North  A           200      20
       B           150      15
South  A           300      30
       B           400      40
East   A           250      25
       B           100      10

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -2px;"><u>Solution</u></code>

In [33]:

df_region_summary = df_multi.groupby(level='Region').agg(
    Total_Sales=('Sales', 'sum'),
    Avg_Profit=('Profit', 'mean')
)                                                                                      # Group by 'Region' and calculate total sales and average profit


df_region_summary

        Total_Sales  Avg_Profit
Region
East            350        17.5
North           350        17.5
South           700        35.0


<span style="font-size: 0.75rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: #0cc60c;"><u>Resetting Specific Levels in MultiIndex</u></span>

<pre style="color: #b83cfe; font-size: 0.84rem; margin-left: 2px;">
Reset only the <code style="background-color: #f2ddff;">Category</code> level from the <code>MultiIndex</code> to make it a column while keeping <code style="background-color: #f2ddff;">Region</code> as the index.
</pre>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -2px;"><u>Solution</u></code>

In [34]:

df_reset_category = df_multi.reset_index(level='Category')                             # Reset only 'Category' level
df_reset_category

       Category  Sales  Profit
Region
North         A    200      20
North         B    150      15
South         A    300      30
South         B    400      40
East          A    250      25
East          B    100      10


<span style="font-size: 0.75rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: #0cc60c;"><u>Practical &nbsp;End-to-End &nbsp;Scenario</u></span>

<pre style="color: #b83cfe; font-size: 0.84rem; margin-left: 23px;">
You are given sales data with a MultiIndex. Perform the following tasks:

Sort the MultiIndex by <code style="background-color: #f6e6ff;">Category</code> and <code style="background-color: #f6e6ff;">Region</code>.
Filter only the rows where <code style="background-color: #f6e6ff;">Category == 'A'</code>.
Reset the index and calculate total sales for each region.
</pre>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -2px;"><u>Solution</u></code>

In [35]:

df_multi

                 Sales  Profit
Region Category
North  A           200      20
       B           150      15
South  A           300      30
       B           400      40
East   A           250      25
       B           100      10

In [36]:

df_sorted = df_multi.sort_index(level=['Category', 'Region'])                          # Sort by MultiIndex levels
df_sorted

                 Sales  Profit
Region Category
East   A           250      25
North  A           200      20
South  A           300      30
East   B           100      10
North  B           150      15
South  B           400      40

In [37]:

df_filtered = df_sorted.xs('A', level='Category')                                      # Filter rows where 'Category' is 'A'
df_filtered

        Sales  Profit
Region
East      250      25
North     200      20
South     300      30

In [168]:

df_reset = df_filtered.reset_index()                                                   # Reset index
df_reset

  Region  Sales  Profit
0   East    250      25
1  North    200      20
2  South    300      30

In [169]:

df_region_totals = df_reset.groupby('Region')['Sales'].sum()                           # Calculate total sales for each region
df_region_totals

Region
East     250
North    200
South    300
Name: Sales, dtype: int64

<br>

<div style="margin-left: 180px;">

![](../media/pandas_indexing_selecting_filtering_21.PNG)

</div>


#### <br>

<div style="background-color: #ff8b00; color: white; padding: 1px;">&nbsp;&nbsp;SELECTING</div>


<span style="color: #cb5bff;">Selection refers to retrieving subset of data (<u>rows</u>, <u>columns</u> or <u>specific values</u>) from a <code style="background-color: #f7e5ff;">DataFrame</code> or <code style="background-color: #f7e5ff;">Series</code> using various approaches, depending on the type of operation and the structure of the data.</span>


##### <span style="color: red;">Selection &nbsp;by &nbsp;Column &nbsp;Labels</span>

In [84]:

# Sample DataFrame

data = {
    'col1': [1, 2, 3],
    'col2': [4, 5, 6],
    'col3': [7, 8, 9]
}

df = pd.DataFrame(data, index=['row1', 'row2', 'row3'])
df

      col1  col2  col3
row1     1     4     7
row2     2     5     8
row3     3     6     9

<span style="color: blue;">Single &nbsp;Column</span>

<span style="color: #d67fff;">You can select a single column by its label, which <span style="color: black;">returns a</span> <code>Series</code></span>

In [7]:

df['col1']

row1    1
row2    2
row3    3
Name: col1, dtype: int64


<span style="color: blue;">Multiple &nbsp;Columns</span>

<span style="color: #d67fff;">Selecting multiple columns <span style="color: black;">returns a</span> <code>DataFrame</code></span>

In [9]:

df[['col1', 'col2']]

      col1  col2
row1     1     4
row2     2     5
row3     3     6


##### <span style="color: red;">Selection &nbsp;by &nbsp;Labels &nbsp;( <code style="background-color: yellow;">.loc[]</code> )</span>


<span style="color: #d67fff;">label-based indexing</span>

<span style="color: blue;"><u>Single &nbsp;Row &nbsp;by &nbsp;Label</u></span>

In [129]:

df.loc['row1']

col1    1
col2    4
Name: row1, dtype: int64

<br>

<span style="color: blue;">Multiple &nbsp;Rows &nbsp;by &nbsp;Label</span>

In [14]:

df.loc[['row1', 'row2']]

      col1  col2  col3
row1     1     4     7
row2     2     5     8


<span style="color: blue;">Rows &nbsp;and &nbsp;Columns &nbsp;by &nbsp;Label</span>

In [15]:

df.loc['row1', 'col2']

4

In [16]:

df.loc[['row1', 'row3'], ['col2', 'col3']]

      col2  col3
row1     4     7
row3     6     9


##### <span style="color: red;">Selection &nbsp;by &nbsp;Position &nbsp;( <code style="background-color: yellow;">.iloc[]</code> )</span>


<span style="color: #d67fff;">position-based indexing</span>

<span style="color: blue;">Single &nbsp;Row &nbsp;by &nbsp;Position</span>

In [19]:

df.iloc[0]

col1    1
col2    4
col3    7
Name: row1, dtype: int64

<br>

<span style="color: blue;">Multiple &nbsp;Rows &nbsp;by &nbsp;Position</span>

In [21]:

df.iloc[[0, 1]]

      col1  col2  col3
row1     1     4     7
row2     2     5     8


<span style="color: blue;">Rows &nbsp;and &nbsp;Columns &nbsp;by &nbsp;Position</span>

In [26]:

df.iloc[0, 1]

4

In [23]:

df.iloc[[0, 2], [0, 2]]

      col1  col3
row1     1     7
row3     3     9


##### <span style="color: red;">Boolean &nbsp;Indexing</span>


<span style="color: #d67fff;">Boolean indexing uses conditions to filter data.</span>

<span style="color: blue;"><u>Single &nbsp;Condition</u></span>

In [57]:

df[df['col3'] > 7]                                                        # Select rows where 'col3' > 7

      col1  col2  col3
row2     2     5     8
row3     3     6     9


<span style="color: blue;"><u>Multiple &nbsp;Conditions</u></span>

In [56]:

df[(df['col2'] > 4) & (df['col3'] == 8)]                                  # Select rows where 'col2' > 4 and 'col3' is 8

      col1  col2  col3
row2     2     5     8


##### <span style="color: red;">Slicing</span>


<span style="color: blue;"><u>Label-Based &nbsp;Slicing</u></span> &nbsp;<code style="background-color: yellow; font-size: 0.8rem;">.loc[]</code>

In [78]:

df.loc['row1':'row2']                                                     # Select rows from 'row1' to 'row2'

      col1  col2  col3
row1     1     4     7
row2     2     5     8

In [58]:

df.loc['row1':'row3', 'col2' : 'col3']                                    # Select rows from 'row1' to 'row3' & columns from 'col2' to 'col3'

      col2  col3
row1     4     7
row2     5     8
row3     6     9

In [59]:

df.loc['row1':'row3', ['col1', 'col3']]                                   # Select rows from 'row1' to 'row3' with columns = ['col1', 'col3']

      col1  col3
row1     1     7
row2     2     8
row3     3     9

In [62]:

df.loc[['row1', 'row3'], 'col1' : 'col3']                                 # Select rows = ['row1', 'row3'] and columns from 'col1' to 'col3'

      col1  col2  col3
row1     1     4     7
row3     3     6     9


<span style="color: blue;"><u>Position &nbsp;Based &nbsp;Slicing</u></span> &nbsp;<code style="background-color: yellow; font-size: 0.8rem;">.iloc[]</code>

<span style="color: #d67fff;">Endpoint &nbsp;not &nbsp;inclusive</span>

In [82]:

df.iloc[0:1]                                                              # row index 0 included but 1 not included

      col1  col2  col3
row1     1     4     7

In [84]:

df.iloc[0:2]                                                              # row index 0 included but 2 not included
                                                                          # slice rows from row index 0 to row index 1

      col1  col2  col3
row1     1     4     7
row2     2     5     8

In [93]:

df.iloc[0:3, 1:3]                                                         # row index to be included     =  [0, 1, 2]
                                                                          # column index to be included  =  [1, 2]

      col2  col3
row1     4     7
row2     5     8
row3     6     9

In [94]:

df.iloc[1:3, [0, 2]]                                                      # row index to be included     =  [1, 2]
                                                                          # column index to be included  =  [0, 2]

      col1  col3
row2     2     8
row3     3     9

In [98]:

df.iloc[[0, 2], 0 : 3]                                                    # row index to be included     =  [0, 2]
                                                                          # column index to be included  =  [0, 1, 2]

      col1  col2  col3
row1     1     4     7
row3     3     6     9


##### <span style="color: red;">Selection &nbsp;with &nbsp;Query</span>


<span style="color: #d67fff;">The &nbsp;<code style="background-color: yellow; font-size: 0.8rem;">query()</code>&nbsp; method provides a <span style="color: black;"><u>string-based way to filter data</u></span>.</span>

In [65]:

df.query('col2 > 3')              # Select rows where 'col2' > 3

      col1  col2  col3
row1     1     4     7
row2     2     5     8
row3     3     6     9


##### <span style="color: red;">Conditional &nbsp;Selection &nbsp;with &nbsp;<code style="background-color: yellow;">.at</code> &nbsp;and &nbsp;<code style="background-color: yellow;">.iat</code></span>


<span style="color: blue;">Single &nbsp;Value &nbsp;by &nbsp;Label &nbsp;( <code style="background-color: blue; color: white;  font-size: 0.8rem;">.at</code> )</span>

In [67]:

df.at['row1', 'col2']

4


<span style="color: blue;">Single &nbsp;Value &nbsp;by &nbsp;Position &nbsp;( <code style="background-color: blue; color: white; font-size: 0.8rem;">.iat</code> )</span>

In [70]:

df.iat[0, 1]

4


##### <span style="color: red;">Advanced &nbsp;Selection &nbsp;with &nbsp;<code style="background-color: yellow;">.xs</code> &nbsp;for &nbsp;MultiIndex</span>


<span style="color: #d67fff;">For MultiIndex DataFrames, use &nbsp;<code style="background-color: #be34ff; color: white; font-size: 0.8rem;">.xs()</code>&nbsp; to filter by levels</span>

In [25]:

df_multi = pd.DataFrame(
                {
                    'Region': ['North', 'North', 'South', 'South'],
                    'Category': ['A', 'B', 'A', 'B'],
                    'Sales': [200, 150, 300, 400]
                }
            ).set_index(['Region', 'Category'])


df_multi

                 Sales
Region Category
North  A           200
       B           150
South  A           300
       B           400

In [26]:

df_multi.xs('North', level='Region')                                      # Select rows for 'North' region

          Sales
Category
A           200
B           150


##### <span style="color: red;">Key Takeaways</span>


- <span style="color: blue;">Single/Multiple Columns</span> &nbsp;&nbsp;&nbsp;:&nbsp;&nbsp;&nbsp; Use <code style="background-color: yellow; font-size: 0.9rem;">[]</code> for column-level selection
- <span style="color: blue;">Label-Based</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;:&nbsp;&nbsp;&nbsp; Use <code style="background-color: yellow; font-size: 0.9rem;">.loc</code> for precise control with labels
- <span style="color: blue;">Position-Based</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;:&nbsp;&nbsp;&nbsp; Use <code style="background-color: yellow; font-size: 0.9rem;">.iloc</code> for position-based selection
- <span style="color: blue;">Boolean Indexing</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;:&nbsp;&nbsp;&nbsp; deal for condition-based filtering
- <span style="color: blue;">Query Method</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;:&nbsp;&nbsp;&nbsp; Cleaner syntax for conditional filtering
- <span style="color: blue;">Slicing</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;:&nbsp;&nbsp;&nbsp;  Efficient for selecting ranges of rows or columns
- <span style="color: blue;">MultiIndex</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;:&nbsp;&nbsp;&nbsp; Use <code style="background-color: yellow; font-size: 0.9rem;">.xs</code> for slicing specific levels of a hierarchical index


#### <br>

<div style="background-color: #ff8b00; color: white; padding: 1px;">&nbsp;&nbsp;FILTERING</div>


<span style="color: #d67fff;">There are multiple ways to filter data in Pandas, depending on the use case and structure of the data.</span>


##### <span style="color: red;">Filtering &nbsp;Using &nbsp;Boolean &nbsp;Indexing</span>

In [37]:

df = pd.DataFrame(
            {
                'Name': ['Alice', 'Bob', 'Charlie', 'David'],
                'Age': [24, 30, 35, 29],
                'City': ['New York', 'Los Angeles', 'San Fracisco', 'New York']
            }
     )


df

      Name  Age          City
0    Alice   24      New York
1      Bob   30   Los Angeles
2  Charlie   35  San Fracisco
3    David   29      New York


<span style="color: blue;"><u>Single Condition</u></span>

<span style="color: #d67fff;">This is the most common and straightforward way to filter data based on conditions.</span>

In [38]:

df['Age'] > 30

0    False
1    False
2     True
3    False
Name: Age, dtype: bool

In [39]:

df[df['Age'] > 30]                                           # Filter rows where Age > 30

      Name  Age          City
2  Charlie   35  San Fracisco


<span style="color: blue;"><u>Multiple &nbsp;Conditions</u> &nbsp;( Using &nbsp;<code style="background-color: yellow;">&</code> &nbsp;and &nbsp;<code style="background-color: yellow;">|</code> )</span>

In [106]:

df[(df['Age'] > 25) & (df['City'] == 'NY')]                  # Filter rows where Age > 25 and City is 'NY'

    Name  Age City
3  David   29   NY


##### <span style="color: red;">Filtering &nbsp;with</span> &nbsp;<code style="background-color: yellow;">.query()</code>


<span style="color: #d67fff;">The &nbsp;<code>query()</code>&nbsp; method allows filtering using a <span style="color: black;">string-based query</span>, which can make conditions more readable.</span>

<span style="color: blue;"><u>Single &nbsp;Condition</u></span>

In [108]:

df.query('Age > 30')                                         # Filter rows where Age > 30

      Name  Age City
2  Charlie   35   SF


<span style="color: blue;"><u>Multiple &nbsp;Conditions</u></span>

In [114]:

df.query('Age > 25 and City == "NY"')                        # Filter rows where Age > 25 and City is 'NY'

    Name  Age City
3  David   29   NY

In [116]:

df.query('Age > 25 & City == "NY"')                         # Filter rows where Age > 25 and City is 'NY'

    Name  Age City
3  David   29   NY


##### <span style="color: red;">Filtering &nbsp;by &nbsp;<u>Label</u> &nbsp;with</span> &nbsp;<code style="background-color: yellow;">.loc[]</code>


<span style="color: #d67fff;">label-based filtering</span>

In [43]:

df.loc[:, 'Name']

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [44]:

df.index

RangeIndex(start=0, stop=4, step=1)


<span style="color: #d67fff;">Since the dataframe has a positional index, let's <strong>rename</strong> it to <span style="color: red;"><u><span style="color: #d67fff;">label-based indexing</span></u></span> &nbsp;:</span>

In [49]:

df.rename(index={0 : "row1",
                 1 : "row2", 
                 2 : "row3", 
                 3 : "row4"}, 
          inplace=True
         )

df

         Name  Age          City
row1    Alice   24      New York
row2      Bob   30   Los Angeles
row3  Charlie   35  San Fracisco
row4    David   29      New York


<span style="color: blue; font-size: 0.8rem;"><strong>Single &nbsp;Row &nbsp;by &nbsp;Label</strong></span>

In [48]:

df.loc['row1']

Name       Alice
Age           24
City    New York
Name: row1, dtype: object

<br>

<span style="color: blue; font-size: 0.8rem;"><strong>Multiple &nbsp;Rows &nbsp;by &nbsp;Label</strong></span>

In [50]:

df.loc[['row1', 'row2']]

       Name  Age         City
row1  Alice   24     New York
row2    Bob   30  Los Angeles


<span style="color: blue; font-size: 0.8rem;"><strong>Rows &nbsp;and &nbsp;Columns &nbsp;by &nbsp;Label</strong></span>

In [53]:

df.loc['row1', 'Name']

'Alice'

In [54]:

df.loc[['row1', 'row3'], ['Name', 'City']]

         Name          City
row1    Alice      New York
row3  Charlie  San Fracisco


<span style="color: blue; font-size: 0.8rem;"><strong>Slicing &nbsp;by &nbsp;Label</strong></span>

In [67]:

df.loc['row1' : 'row3' , 'Name' : 'City']

         Name  Age          City
row1    Alice   24      New York
row2      Bob   30   Los Angeles
row3  Charlie   35  San Fracisco


##### <span style="color: red;">Filtering &nbsp;by &nbsp;<u>Position</u> &nbsp;with</span> &nbsp;<code style="background-color: yellow;">.iloc[]</code>


<span style="color: #d67fff;">position-based filtering</span>

<span style="color: blue; font-size: 0.8rem;"><strong>Single &nbsp;Row &nbsp;by &nbsp;Position</strong></span>

In [58]:

df.iloc[0]

Name       Alice
Age           24
City    New York
Name: row1, dtype: object

<br>

<span style="color: blue; font-size: 0.8rem;"><strong>Multiple &nbsp;Rows &nbsp;by &nbsp;Position</strong></span>

In [60]:

df.iloc[[0, 2]]

         Name  Age          City
row1    Alice   24      New York
row3  Charlie   35  San Fracisco

<br>

<span style="color: blue; font-size: 0.8rem;"><strong>Rows &nbsp;and &nbsp;Columns &nbsp;by &nbsp;Position</strong></span>

In [61]:

df.iloc[0, 0]

'Alice'

In [62]:

df.iloc[[0,2], [1,2]]

      Age          City
row1   24      New York
row3   35  San Fracisco


<span style="color: blue; font-size: 0.8rem;"><strong>Slicing &nbsp;by &nbsp;Position</strong></span>

In [66]:

df.iloc[0 : 3 , 1 : 3]

      Age          City
row1   24      New York
row2   30   Los Angeles
row3   35  San Fracisco


##### <span style="color: red;">Filtering &nbsp;Columns</span>


<span style="color: blue; font-size: 0.8rem;"><strong>Filtering &nbsp;Specific &nbsp;Columns</strong></span>

In [68]:

# Select only the 'Name' and 'City' columns

df[['Name', 'City']]

         Name          City
row1    Alice      New York
row2      Bob   Los Angeles
row3  Charlie  San Fracisco
row4    David      New York


<span style="color: blue; font-size: 0.8rem;"><strong>Filtering &nbsp;Columns &nbsp;with</strong> &nbsp;<code style="background-color: yellow; font-size: 0.82rem;">.filter(, axis=1)</code></span>

<span style="color: #d67fff;">The &nbsp;<code style="font-size: 0.8rem;">.filter()</code>&nbsp; method is used to select <span style="color: red;"><u><span style="color: #d67fff;"><strong>columns</strong></span></u></span> or <span style="color: red;"><u><span style="color: #d67fff;"><strong>rows</strong></span></u></span> based on <span style="color: red;">labels</span></span>

In [75]:

# Select columns whose names contain 'i'

df.filter(like='i', axis=1)

              City
row1      New York
row2   Los Angeles
row3  San Fracisco
row4      New York

In [77]:

# Select rows whose index label contain '3'

df.filter(like='3', axis=0)

         Name  Age          City
row3  Charlie   35  San Fracisco


##### <span style="color: red;">Filtering &nbsp;with &nbsp;<code style="background-color: yellow;">.filter()</code></span>


<div style="margin-left: 70px;">

![](../media/pandas_indexing_selecting_filtering_22.PNG)

</div>

<br>

<code style="background-color: black; color: white;">Notes</code>
- <code style="background-color: yellow;">filter()</code>&nbsp; is for filtering <strong>labels</strong> (not data values). &nbsp;To filter based on <strong>data values</strong>, use <strong>Boolean indexing</strong>.
- Parameters like &nbsp;<code style="background-color: #9ffffb;">items</code> , &nbsp;<code style="background-color: #9ffffb">like</code>, and &nbsp;<code style="background-color: #9ffffb;">regex</code> are mutually exclusive. Using more than one will raise an error.

In [119]:

data = {'col1': [1, 2], 'col2': [3, 4], 'col3': [5, 6]}
df = pd.DataFrame(data)
df

   col1  col2  col3
0     1     3     5
1     2     4     6


<code style="background-color: blue; color: white; font-size: 0.8rem; padding: 2px;"> Filter  Specific  Columns </code>

In [120]:

df.filter(items=['col1', 'col3'])             # Filter by column names

   col1  col3
0     1     5
1     2     6


<code style="background-color: blue; color: white; font-size: 0.8rem; padding: 2px;"> Filter  Columns  Containing  a  String </code>

In [122]:

df.filter(like='col')                         # Filter columns containing 'col'

   col1  col2  col3
0     1     3     5
1     2     4     6


<code style="background-color: blue; color: white; font-size: 0.8rem; padding: 2px;"> Filter  Columns  Using  Regular  Expression </code>

In [124]:

df.filter(regex='^col[1-2]$')                 # Filter columns that start with 'col1' or 'col2'

   col1  col2
0     1     3
1     2     4


<code style="background-color: blue; color: white; font-size: 0.8rem; padding: 2px;"> Filter  Rows  Based  on  Index </code>

In [79]:

# Create a DataFrame with custom index

data = {'col1': [1, 2, 3], 'col2': [4, 5, 6]}
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'])
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

In [80]:

# Filter rows by index labels

df.filter(items=['row1', 'row3'], axis=0)

      col1  col2
row1     1     4
row3     3     6


<code style="background-color: blue; color: white; font-size: 0.8rem; padding: 2px;"> Filter  rows  using  <u>like</u> </code>

In [81]:

# Select rows whose index label contain '3'

df.filter(like='3', axis=0)

      col1  col2
row3     3     6


##### <span style="color: red;">Filtering &nbsp;Rows &nbsp;with &nbsp;<code style="background-color: yellow;">.isin()</code></span>


<span style="color: #d67fff;">Use &nbsp;<code>.isin()</code>&nbsp; to filter rows <span style="color: red;"><u><span style="color: #d67fff;">based on <strong>multiple values</strong></span></u></span></span>

In [89]:

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 30, 35, 29],
    'City': ['New York', 'Los Angeles', 'San Fracisco', 'New York']
})

df

      Name  Age          City
0    Alice   24      New York
1      Bob   30   Los Angeles
2  Charlie   35  San Fracisco
3    David   29      New York

In [90]:

# Filter rows where City is 'NY' or 'SF'

df[df['City'].isin(['New York', 'San Francisco'])]

    Name  Age      City
0  Alice   24  New York
3  David   29  New York


<div style="margin-left: 12px;">

![](../media/pandas_indexing_selecting_filtering_23.PNG)

</div>


##### <span style="color: red;">Filtering &nbsp;Rows &nbsp;with &nbsp;<code style="background-color: yellow;">.between()</code></span>


<span style="color: #d67fff;">The &nbsp;<code>.between()</code>&nbsp; method is used to filter rows <span style="color: red;"><u><span style="color: #d67fff;">based on a <strong>range of values</strong></span></u></span></span>

In [91]:

# Filter rows where Age is between 25 and 35

df[df['Age'].between(25, 35)]

      Name  Age          City
1      Bob   30   Los Angeles
2  Charlie   35  San Fracisco
3    David   29      New York


<div style="margin-left: 80px;">

![](../media/pandas_indexing_selecting_filtering_24.PNG)

</div>


##### <span style="color: red;">Filtering &nbsp;with &nbsp;Regular &nbsp;Expressions &nbsp;using &nbsp;<code style="background-color: yellow;">.str.contains()</code></span>


<span style="color: #d67fff;">Use the <code>.str.contains()</code> method with <strong>regular expressions</strong> to filter rows based on string patterns.</span>

In [102]:

# Filter rows where Name contains 'a' (case-insensitive)

df[df['Name'].str.contains('a', case=False)]

      Name  Age          City
0    Alice   24      New York
2  Charlie   35  San Fracisco
3    David   29      New York


<div style="margin-left: 70px;">

![](../media/pandas_indexing_selecting_filtering_25.PNG)

</div>


##### <span style="color: red;">Filtering &nbsp;Rows &nbsp;with &nbsp;Missing &nbsp;Values</span> &nbsp;&nbsp;<font size="+1">⭐</font>


<span style="color: blue; font-size: 0.8rem;"><strong>Select &nbsp;Rows &nbsp;<u>with</u> &nbsp;Missing &nbsp;Values</strong></span> &nbsp;<code style="background-color: yellow;">.isnull()</code> &nbsp;&nbsp;<span style="color: blue; font-size: 0.8rem;"><strong>&</strong></span> &nbsp;&nbsp;<code style="background-color: yellow;">.any(<span style="color: #c83fff; font-size: 0.82rem;">axis=1</span>)</code>

In [9]:

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', None, 'David'],
    'Age': [24, 30, 35, None]
})


df

    Name   Age
0  Alice  24.0
1    Bob  30.0
2   None  35.0
3  David   NaN


<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u>Step-1</u></code>

In [10]:

df.isnull()                                                    # returns True or False for every element in the dataframe
                                                               # 'None'  -------->  True
                                                               # Not 'None'  ---->  False

    Name    Age
0  False  False
1  False  False
2   True  False
3  False   True


<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u>Step-2</u></code>

In [18]:

df.isnull().any(axis=1)                                        # returns True if a row has any 'None' or not

0    False
1    False
2     True
3     True
dtype: bool

<br>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u>Step-3</u></code> &nbsp;&nbsp;<code style="color: white; background-color: #ff188c; font-size: 0.74rem; margin-left: -4px;">Solution</code>

In [19]:

# Select rows with missing values

df[df.isnull().any(axis=1)]

    Name   Age
2   None  35.0
3  David   NaN


<span style="color: blue; font-size: 0.8rem;"><strong>Select &nbsp;Rows &nbsp;<u>without</u> &nbsp;Missing &nbsp;Values</strong></span>  &nbsp;<code style="background-color: yellow;">.notnull()</code> &nbsp;&nbsp;<span style="color: blue; font-size: 0.8rem;"><strong>&</strong></span> &nbsp;&nbsp;<code style="background-color: yellow;">.all(<span style="color: #c83fff; font-size: 0.82rem;">axis=1</span>)</code>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u>Step-1</u></code>

In [20]:

df.notnull()                                                   # returns True for every Not None value & False for every None value in the dataframe

    Name    Age
0   True   True
1   True   True
2  False   True
3   True  False


<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u>Step-2</u></code>

In [14]:

df_missing.notnull().all(axis=1)

0     True
1     True
2    False
3    False
dtype: bool

<br>

<code style="color: #ff188c; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u>Step-3</u></code> &nbsp;&nbsp;<code style="color: white; background-color: #ff188c; font-size: 0.74rem; margin-left: -4px;">Solution</code>

In [15]:

# Select rows with missing values

df_missing[df_missing.notnull().all(axis=1)]

    Name   Age
0  Alice  24.0
1    Bob  30.0


##### <span style="color: red;">Advanced &nbsp;Filtering &nbsp;with &nbsp;MultiIndex</span>


<span style="color: #d67fff;">For MultiIndex DataFrames , use &nbsp;<code style="background-color: yellow; font-size: 0.84rem;">.xs()</code>&nbsp; or &nbsp;<code style="background-color: yellow; font-size: 0.84rem;">.loc[]</code>&nbsp; for filtering.</span>

In [32]:

df_multi = pd.DataFrame(
                {
                    'Region': ['North', 'North', 'South', 'South'],
                    'Category': ['A', 'B', 'A', 'B'],
                    'Sales': [200, 150, 300, 400]
                }
            ).set_index(['Region', 'Category'])


df_multi

                 Sales
Region Category
North  A           200
       B           150
South  A           300
       B           400

In [33]:

# Filter rows for Region = 'North'

df_multi.xs('North', level='Region')

          Sales
Category
A           200
B           150

In [35]:

# Filter rows for Category = 'B'

df_multi.xs('B', level="Category")

        Sales
Region
North     150
South     400


##### <span style="color: red;"><u>Key &nbsp;Takeaways</u></span>

- <span style="color: blue;">Boolean Indexing</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <strong>Most common</strong> ; uses conditions for filtering.

- <code style="background-color: yellow; font-size: 0.8rem;">filter()</code> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; For filtering <strong>labels</strong> (<u>not data values</u>). To filter based on data values, use Boolean indexing.

- <code style="background-color: yellow; font-size: 0.79rem;">query()</code>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <strong>String-based filtering</strong> ; &nbsp;cleaner for complex conditions.

- <code style="background-color: yellow; font-size: 0.79rem;">isin()</code>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ideal for filtering <strong>multiple values</strong>.

- <code style="background-color: yellow; font-size: 0.77rem;">between()</code>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Convenient for filtering within a <strong>range</strong>.
- <span style="color: blue;">Regular Expressions</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Powerful for filtering <strong>string patterns</strong>.

- <span style="color: blue;">Handling Missing Values</span> &nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Use &nbsp;<code style="background-color: yellow; font-size: 0.8rem;">isnull()</code>&nbsp; and &nbsp;<code style="background-color: yellow; font-size: 0.8rem;">notnull()</code>&nbsp; to handle <strong>incomplete data</strong>.

- <span style="color: blue;">MultiIndex Filtering</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;  Use &nbsp;<code style="background-color: yellow; font-size: 0.8rem;">.xs()</code>&nbsp; and &nbsp;<code style="background-color: yellow; font-size: 0.8rem;">.loc[]</code>&nbsp; for <strong>hierarchical indexing</strong>.


#### <br>

<div style="background-color: #ff8b00; color: white; padding: 1px;">&nbsp;&nbsp;Problem &nbsp;scenarios &nbsp;on <code style="background-color: #ff8b00; color: white; font-size: 1rem;"><u>Indexing + Selection + Filtering</u></code></div>


###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>1. &nbsp;&nbsp;Conditional &nbsp;Filtering &nbsp;with &nbsp;String &nbsp;Operations</strong></span>


<code style="color: #cb5bff; background-color: white; font-size: 0.8rem; margin-left: -2px;">Pandas provides rich string-handling capabilities.</code>

In [48]:

df = pd.DataFrame({
            'Name': ['Alice', 'Bob', 'Charlie', 'David'],
            'Department': ['HR', 'Finance', 'HR', 'Finance'],
            'Salary': [50000, 60000, 45000, 70000]
})


df

      Name Department  Salary
0    Alice         HR   50000
1      Bob    Finance   60000
2  Charlie         HR   45000
3    David    Finance   70000

<br>

<span style="font-size: 0.8rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: red;">Filter &nbsp;rows &nbsp;where &nbsp;<code style="background-color: #ffe8f1;">Department</code> &nbsp;starts &nbsp;with &nbsp;<code style="background-color: #ffe8f1;">'F'</code></span>

<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Step-1</code>

In [58]:

df['Department'].str.startswith('F')

0    False
1     True
2    False
3     True
Name: Department, dtype: bool

<br>

<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Step-2</code>  &nbsp;&nbsp;&nbsp;-&nbsp;&nbsp; <code style="color: #b805dc; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u>Solution</u></code>

In [59]:

df[df['Department'].str.startswith('F')]

    Name Department  Salary
1    Bob    Finance   60000
3  David    Finance   70000

<br>

<span style="font-size: 0.8rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: red;">Filter &nbsp;rows &nbsp;where &nbsp;<code style="background-color: #ffe8f1;">Name</code> &nbsp;contains &nbsp;<code style="background-color: #ffe8f1;">'a'</code></span>

<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Step-1</code>

In [61]:

df['Name'].str.contains('a', case=False)

0     True
1    False
2     True
3     True
Name: Name, dtype: bool

<br>

<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Step-2</code>  &nbsp;&nbsp;&nbsp;-&nbsp;&nbsp; <code style="color: #b805dc; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u>Solution</u></code>

In [54]:

df[df['Name'].str.contains('a', case=False)]

      Name Department  Salary
0    Alice         HR   50000
2  Charlie         HR   45000
3    David    Finance   70000


###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>2. &nbsp;&nbsp;Using &nbsp;<code style="background-color: yellow; font-size: 0.9rem;">.apply()</code>&nbsp; for &nbsp;Complex &nbsp;Filtering</strong></span>


<code style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: -3px;">Sometimes, conditions require <u>custom logic</u>.</code>

In [64]:

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'Score': [85, 63, 70, 90]
})


df

      Name  Age  Score
0    Alice   24     85
1      Bob   27     63
2  Charlie   22     70
3    David   32     90


<br>

<span style="font-size: 0.8rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: red;"><strong>Custom filtering &nbsp;:</strong> &nbsp;Filter &nbsp;rows &nbsp;where &nbsp;<code style="background-color: #ffe8f1;">Score</code> &nbsp;is &nbsp;greater &nbsp;than &nbsp;twice &nbsp;the &nbsp;<code style="background-color: #ffe8f1;">Age</code></span>

<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Step-1</code>

In [66]:

df.apply(lambda row: row['Score'] > 2 * row['Age'], axis=1)

0    True
1    True
2    True
3    True
dtype: bool

<br>

<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Step-2</code>  &nbsp;&nbsp;&nbsp;-&nbsp;&nbsp; <code style="color: #b805dc; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u>Solution</u></code>

In [78]:

df[df.apply(lambda row: row['Score'] > 2 * row['Age'], axis=1)]                    # Filter rows where 'Score' is greater than twice the 'Age'

      Name  Age  Score
0    Alice   24     85
1      Bob   27     63
2  Charlie   22     70
3    David   32     90


###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>3. &nbsp;&nbsp;Sorting &nbsp;While &nbsp;Filtering</strong></span>


<code style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: -4px;"><u>Sorting</u> can be combined with <u>filtering</u> to prioritize results.</code>

<span style="font-size: 0.8rem; color: red; margin-left: 1px;">■</span> &nbsp;&nbsp;<span style="color: red;">Sort &nbsp;rows &nbsp;by &nbsp;where &nbsp;<code style="background-color: #ffe8f1;">Score</code> &nbsp;in &nbsp;<u>descending &nbsp;order</u> &nbsp;where &nbsp;<code style="background-color: #ffe8f1;">Age > 25</code></span>


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Step-1</code>

In [70]:

df['Age'] > 25

0    False
1     True
2    False
3     True
Name: Age, dtype: bool

<br>

<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Step-2</code>

In [71]:

df[df['Age'] > 25]

    Name  Age  Score
1    Bob   27     63
3  David   32     90

<br>

<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Step-3</code>  &nbsp;&nbsp;&nbsp;-&nbsp;&nbsp; <code style="color: #b805dc; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u>Solution</u></code>

In [77]:

df[df['Age'] > 25].sort_values(by='Score', ascending=False)                        #  Sort rows by where 'Score' in descending order where 'Age' > 25

    Name  Age  Score
3  David   32     90
1    Bob   27     63


###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>4. &nbsp;&nbsp;Combining &nbsp;Multiple &nbsp;Conditions &nbsp;with &nbsp;Filtering</strong></span>


<code style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: -4px;">Use logical operators for complex conditions.</code>

<span style="font-size: 0.8rem; color: red; margin-left: 2px;">■</span> &nbsp;&nbsp;<span style="color: red;">Filter &nbsp;rows &nbsp;where &nbsp;<code style="background-color: #ffe8f1;">(<span style="font-size: 0.82rem;">Age > 25</span> &nbsp;AND &nbsp;<span style="font-size: 0.82rem;">Score > 80</span>)</code> &nbsp;<span style="font-size: 0.82rem;">OR</span> &nbsp;<code style="background-color: #ffe8f1;">Name &nbsp;starts &nbsp;with &nbsp;'A'</code></span>

In [72]:

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'Score': [85, 63, 70, 90]
})


df

      Name  Age  Score
0    Alice   24     85
1      Bob   27     63
2  Charlie   22     70
3    David   32     90

In [73]:

df[((df['Age'] > 25) & (df['Score'] > 80)) | (df['Name'].str.startswith('A'))]

    Name  Age  Score
0  Alice   24     85
3  David   32     90


###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>5. &nbsp;&nbsp;Working &nbsp;with &nbsp;<span style="color: red;"><u><span style="color: blue;">Missing &nbsp;Data</span></u></span> &nbsp;(NaN)</strong></span>


<code style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: -4px;">Handling missing values is crucial in data analysis.</code>

In [3]:

# Example dataset with NaN
df = pd.DataFrame(
                    {
                        'Name': ['Alice', 'Bob', None, 'David'],
                        'Score': [85, None, 70, 90]
                    }
                 )


df

    Name  Score
0  Alice   85.0
1    Bob    NaN
2   None   70.0
3  David   90.0


<span style="font-size: 0.8rem; color: red; margin-left: 1px;">■</span> &nbsp;&nbsp;<span style="color: red;">Filter &nbsp;rows &nbsp;with &nbsp;non-null  &nbsp;<code style="background-color: #ffe8f1;">'Name'</code> </span>

<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Step-1</code>

In [80]:

df['Name'].notna()

0     True
1     True
2    False
3     True
Name: Name, dtype: bool


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Step-2</code> &nbsp;&nbsp;&nbsp;&nbsp;<code style="background-color: black; color: white; font-size: 0.75rem;">Solution</code> &nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp; <code style="font-size: 0.82rem; background-color: #fffd7b;">series.<span style="color: red;"><strong>notna()</strong></span></code>

In [20]:

df[df['Name'].notna()]                                                   # Filter  rows  with  non-null  'Name'

    Name      Score
0  Alice  85.000000
1    Bob  81.666667
3  David  90.000000


<span style="font-size: 0.8rem; color: red; margin-left: 1px;">■</span> &nbsp;&nbsp;<span style="color: red;">Filter &nbsp;missing &nbsp;<code style="background-color: #ffe8f1;">'Score'</code> &nbsp;values &nbsp;with &nbsp;the &nbsp; mean</span>

<code style="background-color: black; color: white; font-size: 0.75rem; margin-left: 3px;">Solution</code> &nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp; <code style="font-size: 0.82rem; background-color: #fffd7b;">series.<span style="color: red;"><strong>fillna(</strong></span> , inplace=True<span style="color: red;"><strong>)</strong></span></code>

In [21]:

df['Score'].fillna(df['Score'].mean(), inplace=True)                     # Fill missing 'Score' values with the mean
df

    Name      Score
0  Alice  85.000000
1    Bob  81.666667
2   None  70.000000
3  David  90.000000


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Exaplaination</code>

In [22]:

df['Score']

0    85.000000
1    81.666667
2    70.000000
3    90.000000
Name: Score, dtype: float64

In [27]:

df['Score'].mean()                                                       # (85 + 70 + 90) / 3

81.66666666666667

In [24]:

df['Score'].fillna(df['Score'].mean())

0    85.000000
1    81.666667
2    70.000000
3    90.000000
Name: Score, dtype: float64

In [28]:

df                                                                       # The dataframe df is still not modified

    Name      Score
0  Alice  85.000000
1    Bob  81.666667
2   None  70.000000
3  David  90.000000

In [29]:

df['Score'].fillna(df['Score'].mean(), inplace=True)
df

    Name      Score
0  Alice  85.000000
1    Bob  81.666667
2   None  70.000000
3  David  90.000000


###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>6. &nbsp;&nbsp;<code style="background-color: yellow;">.nsmallest()</code> &nbsp;and &nbsp;<code style="background-color: yellow;">.nlargest()</code> &nbsp;for &nbsp;Selection</strong></span>


<code style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: -4px;">Select top/bottom rows based on values.</code>

In [50]:

# Example dataset

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Salary': [50000, 60000, 45000, 70000]
})


df

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   45000
3    David   70000


<span style="font-size: 0.8rem; color: red; margin-left: 1px;">■</span> &nbsp;&nbsp;<span style="color: red;">Top &nbsp;2 &nbsp;<u>highest</u> &nbsp;salaries</span>

In [52]:

df.nlargest(2, 'Salary')                                                 # Top 2 highest salaries

    Name  Salary
3  David   70000
1    Bob   60000


<span style="font-size: 0.8rem; color: red; margin-left: 1px;">■</span> &nbsp;&nbsp;<span style="color: red;">Bottom &nbsp;2 &nbsp;<u>lowest</u> &nbsp;salaries</span>

In [53]:

df.nsmallest(2, 'Salary')                                                # Bottom 2 lowest salaries

      Name  Salary
2  Charlie   45000
0    Alice   50000


###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>7. &nbsp;&nbsp;Exploiting &nbsp;<code style="background-color: yellow;">.explode()</code> &nbsp;for &nbsp;Filtering</strong></span>


<code style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: -4px;">Filter rows when working with lists inside columns.</code>

In [61]:

# Example dataset with lists

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Hobbies': [['Reading', 'Swimming'], ['Cycling'], ['Swimming', 'Dancing']]
})


df

      Name              Hobbies
0    Alice  [Reading, Swimming]
1      Bob            [Cycling]
2  Charlie  [Swimming, Dancing]


<span style="font-size: 0.8rem; color: red; margin-left: 1px;">■</span> &nbsp;&nbsp;<span style="color: red;">Filter &nbsp;rows &nbsp;where &nbsp;Hobby &nbsp;is &nbsp;'Swimming'</span>

<code style="color: white; background-color: black; font-size: 0.75rem; margin-left: 3px;">Solution</code>

In [67]:

df_exploded = df.explode('Hobbies')                                      # Expand rows for each hobby
df_exploded[df_exploded['Hobbies'] == 'Swimming']                        # Filter rows where Hobby is 'Swimming'

      Name   Hobbies
0    Alice  Swimming
2  Charlie  Swimming


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Explaination</code>

<code style="color: #c136fe; background-color: white; font-size: 0.75rem;"><u>Step-1</u></code>

In [62]:

df_exploded = df.explode('Hobbies')                                      # Expand rows for each hobby
df_exploded

      Name   Hobbies
0    Alice   Reading
0    Alice  Swimming
1      Bob   Cycling
2  Charlie  Swimming
2  Charlie   Dancing


<code style="color: #c136fe; background-color: white; font-size: 0.75rem;"><u>Step-2</u></code>

In [63]:

df_exploded[df_exploded['Hobbies'] == 'Swimming']                        # Filter rows where Hobby is 'Swimming'

      Name   Hobbies
0    Alice  Swimming
2  Charlie  Swimming


###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>8A. &nbsp;&nbsp;<code style="background-color: yellow;">.groupby()</code></strong></span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<code style="color: blue; background-color: white; font-size: 0.82rem;">How data looks like after grouping</code>


<code style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: -4px;">To inspect how the data looks after grouping, you can iterate through the <code style="background-color: #f2cbff;">groupby</code> object or convert the groups into DataFrames.</code> <br>
<code style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: -4px;">Here's how you can "see" the grouped data :</code>

In [42]:

df = pd.DataFrame({
    'Department': ['HR', 'Finance', 'HR', 'Finance', 'HR'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 60000, 45000, 70000, 52000],
    'Years': [3, 4, 2, 5, 3]
})


df

  Department Employee  Salary  Years
0         HR    Alice   50000      3
1    Finance      Bob   60000      4
2         HR  Charlie   45000      2
3    Finance    David   70000      5
4         HR      Eve   52000      3

In [43]:

grouped_df = df.groupby('Department')                             # Group by 'Department'
grouped_df

<br>

<code style="background-color: #ff4276; color: white; font-size: 0.8rem; padding: 2px;"> Iterating Over Groups </code> <code style="color: #c136fe; background-color: white; font-size: 0.8rem;"> -  You can iterate over the <code style="background-color: #f2cbff;">groupby</code> object to access each group as a DataFrame.</code>

In [16]:

for group_name, group_df in grouped_df:                           # Print each group
    print(f"Group: {group_name}")
    print(group_df)
    print("-" * 40)

Group: Finance
  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5
----------------------------------------
Group: HR
  Department Employee  Salary  Years
0         HR    Alice   50000      3
2         HR  Charlie   45000      2
4         HR      Eve   52000      3
----------------------------------------

<br>

<code style="background-color: #ff4276; color: white; font-size: 0.8rem; padding: 2px;"> Viewing Groups as a Dictionary </code> <code style="color: #c136fe; background-color: white; font-size: 0.8rem;"> -  The <code style="background-color: #f2cbff;">groupby</code> object provides a <code style="background-color: yellow;">.groups</code> <span style="color: red;"><u><span style="color: #c136fe;">attribute</span></u></span>, which shows the mapping of group names to row indices.</code>

In [44]:

grouped_df.groups                                                 # df.groupby('Department').groups

{'Finance': [1, 3], 'HR': [0, 2, 4]}

In [45]:

grouped_df.groups['Finance']                                      # df.groupby('Department').groups['Finance']

Int64Index([1, 3], dtype='int64')

In [46]:

df.iloc[grouped_df.groups['Finance']]                             # df.iloc[df.groupby('Department').groups['Finance']]

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5

In [47]:

df.iloc[grouped_df.groups['HR']]

  Department Employee  Salary  Years
0         HR    Alice   50000      3
2         HR  Charlie   45000      2
4         HR      Eve   52000      3


<div style="margin-left: 70px;">

![](../media/pandas_indexing_selecting_filtering_33.PNG)

</div>

<br>

<code style="background-color: #ff4276; color: white; font-size: 0.8rem; padding: 2px;"> Accessing a Specific Group </code> <code style="color: #c136fe; background-color: white; font-size: 0.8rem;"> -  You can access a specific group using the <code style="background-color: yellow;">.get_group()</code> method.</code>

In [48]:

grouped_df.get_group('Finance')                                   # Access the 'Finance' group
                                                                  # df.groupby('Department').get_group('Finance')

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5

In [49]:

grouped_df.get_group('HR')                                        # Access the 'hr' group
                                                                  # df.groupby('Department').get_group('HR')

  Department Employee  Salary  Years
0         HR    Alice   50000      3
2         HR  Charlie   45000      2
4         HR      Eve   52000      3


<div style="margin-left: 40px;">

![](../media/pandas_indexing_selecting_filtering_34.PNG)

</div>

<br>

<code style="background-color: #ff4276; color: white; font-size: 0.8rem; padding: 2px;"> Transforming the Groupby Object Back to a DataFrame </code> <code style="color: #c136fe; background-color: white; font-size: 0.8rem;"> -  You can use <code style="background-color: yellow;">.apply()</code> method to create a DataFrame representation of the grouped data.</code>


<pre style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: 415px;">But before that, you need to pass <code style="background-color: #83f9ff;">group_keys = True</code> while creating the groupby object upon which the <code style="background-color: yellow;"> .apply() </code> method will be applied.</pre>

In [64]:

# Reconstruct grouped DataFrame with a 'Group' column
grouped_df = df.groupby('Department', group_keys=True)
grouped_df.apply(lambda x: x)

             Department Employee  Salary  Years
Department
Finance    1    Finance      Bob   60000      4
           3    Finance    David   70000      5
HR         0         HR    Alice   50000      3
           2         HR  Charlie   45000      2
           4         HR      Eve   52000      3


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Explaination</code>

<pre style="color: #c136fe; background-color: white; font-size: 0.8rem;">

    df.<span style="background-color: yellow; color: black;">groupby</span>('ColumnName', <span style="color: red;">group_keys=True</span>).<span style="background-color: yellow; color: black;">apply</span><span style="color: black;">(</span>lambda x: x<span style="color: black;">)</span>

</pre>

In [66]:

grouped_df = df.groupby('Department', group_keys=True)
grouped_df

In [63]:

grouped_df.apply(lambda x: x)

             Department Employee  Salary  Years
Department
Finance    1    Finance      Bob   60000      4
           3    Finance    David   70000      5
HR         0         HR    Alice   50000      3
           2         HR  Charlie   45000      2
           4         HR      Eve   52000      3


<code style="background-color: #0bb902; color: white; font-size: 0.8rem; padding: 2px;"> Aggregating to Understand Group-wise Data </code>

In [69]:

summary = grouped_df['Salary'].sum()                              # Summary of Salary by Department
summary

Department
Finance    130000
HR         147000
Name: Salary, dtype: int64

<br>

<div style="margin-left: 60px;">

![](../media/pandas_indexing_selecting_filtering_35.PNG)

</div>


###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>8B. &nbsp;&nbsp;<code style="background-color: yellow;">.groupby()</code></strong></span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<code style="color: blue; background-color: white; font-size: 0.82rem;">Simple example of aggregation with filtering</code>

In [70]:

df = pd.DataFrame(
        {
            'Department': ['HR', 'Finance', 'HR', 'Finance', 'HR'],
            'Salary': [50000, 60000, 45000, 70000, 52000]
        }
     )


df

  Department  Salary
0         HR   50000
1    Finance   60000
2         HR   45000
3    Finance   70000
4         HR   52000


<span style="font-size: 0.8rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: red;">Calculate &nbsp;<u>average &nbsp;salary &nbsp;per &nbsp;department</u> , &nbsp;filter &nbsp;departments &nbsp;with &nbsp;<code style="background-color: #ffe8f1;">avg salary &nbsp;> &nbsp;55000</code></span>

<code style="color: white; background-color: black; font-size: 0.75rem; margin-left: 1px;">Solution - 1</code> &nbsp;&nbsp;&nbsp;&nbsp;<span style="color: #ff4ace;">-</span>&nbsp;&nbsp;<code style="color: #ff4ace; background-color: white; font-size: 0.75rem; margin-left: 3px;">returns  a  <u>Series</u></code>

In [71]:

df_grouped = df.groupby('Department')['Salary'].mean()
df_grouped[df_grouped > 55000]

Department
Finance    65000.0
Name: Salary, dtype: float64


<code style="color: white; background-color: black; font-size: 0.75rem; margin-left: 1px;">Solution - 2</code> &nbsp;&nbsp;&nbsp;&nbsp;<span style="color: #ff4ace;">-</span>&nbsp;&nbsp;<code style="color: #ff4ace; background-color: white; font-size: 0.75rem; margin-left: 3px;">returns  a  <u>DataFrame</u></code>

In [73]:

df_grouped = df.groupby('Department').agg({'Salary' : 'mean'})
df_grouped[df_grouped['Salary'] > 55000]

             Salary
Department
Finance     65000.0


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Explaination</code>

In [90]:

df.groupby('Department')

In [91]:

df.groupby('Department')['Salary']

In [52]:

df_grouped = df.groupby('Department').agg({'Salary' : 'mean'})                    # METHOD - 1  ====>  returns a DataFrame
df_grouped = df.groupby('Department')['Salary'].mean()                            # METHOD - 2  ====>  returns a Series

df_grouped                                                                        # Series

Department
Finance    65000.0
HR         49000.0
Name: Salary, dtype: float64

<br>

<div style="margin-left: 100px;">

![](../media/pandas_indexing_selecting_filtering_29.PNG)

</div>

In [88]:

df_grouped[df_grouped > 55000]

Department
Finance    65000.0
Name: Salary, dtype: float64

<br>

<code style="color: #0eb436; background-color: white; font-size: 0.85rem; font-size: 0.82rem; margin-left: -4px;">In the solution-2 above <code style="font-size: 0.78rem;">df.<span style="color: blue;">groupby</span>(<span style="color: red;">'Department'</span>).<span style="color: blue;">agg</span>({<span style="color: red;">'Salary'</span> : <span style="color: red;">'mean'</span>})</code> , how'd we overwrite the aggregated column <span style="color: red;"><u><span style="color: #0eb436;">"Salary"</span></u></span> of the resulting dataframe with a custom name <span style="color: red;"><u><span style="color: #0eb436;">"AvgSal"</span></u></span> ?</code>

<code style="color: #0eb436; background-color: white; font-size: 0.85rem; font-size: 0.82rem; margin-left: -4px;">There are two ways to achieve this :</code>

<code style="background-color: #b7ffc9; color: black; font-size: 0.82rem;">Method-1</code>

In [65]:

df_grouped = df.groupby('Department').agg({'Salary' : 'mean'})
df_grouped.columns = ["AvgSal"]                                                     # The  column  mean(Salary)  is  renamed  as  'Avg_Sal'
df_grouped[df_grouped['AvgSal'] > 55000]

             AvgSal
Department
Finance     65000.0


<code style="background-color: #b7ffc9; color: black; font-size: 0.82rem;">Method-2</code>

In [67]:

df_grouped = df.groupby('Department').agg(
                                            AvgSal=('Salary', 'mean')               # The  column  mean(Salary)  is  renamed  as  'Avg_Sal'
                                         )

df_grouped[df_grouped['AvgSal'] > 55000]

             AvgSal
Department
Finance     65000.0


###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>8C. &nbsp;&nbsp;<code style="background-color: yellow;">.groupby()</code></strong></span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<code style="color: blue; background-color: white; font-size: 0.82rem;">Group by Multiple Columns & Perform Multiple Aggregations for each group</code>


<span style="font-size: 0.8rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: red;">Given the dataset below, compute the average of &nbsp;<code>col1</code>&nbsp; for each group of &nbsp;<code>Group1</code>&nbsp; and &nbsp;<code>Group2</code>. &nbsp;Additionally, calculate the sum of &nbsp;<code>col2</code>&nbsp; for each group.</span>

In [24]:

data = {
    'Group1': ['A', 'A', 'A', 'B', 'B', 'C', 'C'],
    'Group2': ['X', 'X', 'Y', 'X', 'Y', 'X', 'Y'],
    'col1': [10, 20, 30, 40, 50, 60, 70],
    'col2': [100, 200, 300, 400, 500, 600, 700]
}


df = pd.DataFrame(data)                                      # df = pd.DataFrame(data).set_index(['Group1', 'Group2'])   ----->   MultiIndex DataFrame
df

  Group1 Group2  col1  col2
0      A      X    10   100
1      A      X    20   200
2      A      Y    30   300
3      B      X    40   400
4      B      Y    50   500
5      C      X    60   600
6      C      Y    70   700


<code style="color: white; background-color: black; font-size: 0.75rem; margin-left: 3px;">Solution</code>

In [25]:

# Group by Group1 and Group2

result = df.groupby(['Group1', 'Group2']).agg({'col1': 'mean', 'col2': 'sum'})
result

               col1  col2
Group1 Group2
A      X       15.0   300
       Y       30.0   300
B      X       40.0   400
       Y       50.0   500
C      X       60.0   600
       Y       70.0   700

<div style="margin-left: 200px;">

![](../media/pandas_indexing_selecting_filtering_26.PNG)

</div>


<code style="color: #01c631; background-color: white; font-size: 0.82rem; margin-left: -4px;">Let's give <u>custom names</u> for the aggregated columns. There are two ways for it.</code>

<code style="background-color: #8affa6; color: black; font-size: 0.82rem;">Method-1</code>

<div style="margin-left: 255px;">

![](../media/pandas_indexing_selecting_filtering_27.PNG)

</div>

In [26]:

result.columns = ['mean_col1', 'sum_col2']                                        # Method - 1
result

               mean_col1  sum_col2
Group1 Group2
A      X            15.0       300
       Y            30.0       300
B      X            40.0       400
       Y            50.0       500
C      X            60.0       600
       Y            70.0       700

In [27]:

result.reset_index()

  Group1 Group2  mean_col1  sum_col2
0      A      X       15.0       300
1      A      Y       30.0       300
2      B      X       40.0       400
3      B      Y       50.0       500
4      C      X       60.0       600
5      C      Y       70.0       700

<BR>

<code style="background-color: #8affa6; color: black; font-size: 0.82rem;">Method-2</code>

<br>

<div style="margin-left: 210px;">

![](../media/pandas_indexing_selecting_filtering_28.PNG)

</div>

In [28]:

df.groupby(['Group1', 'Group2']).agg(
                                        mean_col1=('col1', 'mean'),
                                        sum_col2=('col2', 'sum')
                                    )

               mean_col1  sum_col2
Group1 Group2
A      X            15.0       300
       Y            30.0       300
B      X            40.0       400
       Y            50.0       500
C      X            60.0       600
       Y            70.0       700

In [14]:

df

  Group1 Group2  col1  col2
0      A      X    10   100
1      A      X    20   200
2      A      Y    30   300
3      B      X    40   400
4      B      Y    50   500
5      C      X    60   600
6      C      Y    70   700

In [15]:

df.groupby(['Group1', 'Group2']).agg(
                                        mean_col1=('col1', 'mean'),
                                        sum_col2=('col2', 'sum')
                                    ).reset_index()

  Group1 Group2  mean_col1  sum_col2
0      A      X       15.0       300
1      A      Y       30.0       300
2      B      X       40.0       400
3      B      Y       50.0       500
4      C      X       60.0       600
5      C      Y       70.0       700

In [16]:

df

  Group1 Group2  col1  col2
0      A      X    10   100
1      A      X    20   200
2      A      Y    30   300
3      B      X    40   400
4      B      Y    50   500
5      C      X    60   600
6      C      Y    70   700

In [20]:

df.groupby(['Group1', 'Group2']).agg(
                                        mean_col1=('col1', 'mean'),
                                        sum_col2=('col2', 'sum')
                                    ).reset_index(inplace=True)            # why  is  <inplace= True>  not  working?

In [21]:

df                                                                         # why  is  <inplace= True>  not  working?

  Group1 Group2  col1  col2
0      A      X    10   100
1      A      X    20   200
2      A      Y    30   300
3      B      X    40   400
4      B      Y    50   500
5      C      X    60   600
6      C      Y    70   700

In [24]:

# custom column name for the aggregated columns

df_grouped = df.groupby(['Group1', 'Group2']).agg(
                                                    mean_col1=('col1', 'mean'),
                                                    sum_col2=('col2', 'sum')
                                                 )

df_grouped

               mean_col1  sum_col2
Group1 Group2
A      X            15.0       300
       Y            30.0       300
B      X            40.0       400
       Y            50.0       500
C      X            60.0       600
       Y            70.0       700

In [25]:

df_grouped.reset_index()

  Group1 Group2  mean_col1  sum_col2
0      A      X       15.0       300
1      A      Y       30.0       300
2      B      X       40.0       400
3      B      Y       50.0       500
4      C      X       60.0       600
5      C      Y       70.0       700

In [26]:

df_grouped

               mean_col1  sum_col2
Group1 Group2
A      X            15.0       300
       Y            30.0       300
B      X            40.0       400
       Y            50.0       500
C      X            60.0       600
       Y            70.0       700

In [27]:

df_grouped.reset_index(inplace=True)
df_grouped

  Group1 Group2  mean_col1  sum_col2
0      A      X       15.0       300
1      A      Y       30.0       300
2      B      X       40.0       400
3      B      Y       50.0       500
4      C      X       60.0       600
5      C      Y       70.0       700


###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>8D. &nbsp;&nbsp;<code style="background-color: yellow;">.groupby()</code></strong></span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<code style="color: blue; background-color: white; font-size: 0.82rem;">Perform Multiple Aggregations for each group</code><br> 
<code style="color: blue; background-color: white; font-size: 0.82rem; margin-left: 173px;">Group by Multiple Columns and find the size of each group</code><br>
<code style="color: blue; background-color: white; font-size: 0.82rem; margin-left: 173px;">Filter groups based on a condition</code> <br>
<code style="color: blue; background-color: white; font-size: 0.82rem; margin-left: 173px;">Transformations with groupby</code><br>
<code style="color: blue; background-color: white; font-size: 0.82rem; margin-left: 173px;">Custom Aggregations</code>


<div style="background-color: #ffecd3; padding-top: 10px; padding-bottom: 1px;">

<span style="font-size: 0.78rem; margin-left: 22px; color: blue;"><strong>Perform &nbsp;&nbsp;Multiple &nbsp;&nbsp;Aggregations &nbsp;&nbsp;for &nbsp;&nbsp;Each &nbsp;&nbsp;Group</strong></span></i>

<div style="background-color: white; margin: 21px; padding-top: 14px; padding-bottom: 5px; padding-left: 10px;">

<span style="font-size: 0.8rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: red;">Given &nbsp;the &nbsp;dataset &nbsp;below, &nbsp;<strong><u>group by</u></strong> &nbsp;&nbsp;<code>Department</code>&nbsp; and &nbsp;calculate &nbsp;<strong><u>mean</u></strong> &nbsp;<code>Salary</code>&nbsp; and &nbsp;<u>total</u> &nbsp;&nbsp;<code>Years</code></span>

</div>

</div>

<br>

<code style="color: white; background-color: black; font-size: 0.75rem; margin-left: 3px;">Solution</code>

In [4]:

# Example dataset
df = pd.DataFrame({
    'Department': ['HR', 'Finance', 'HR', 'Finance', 'HR'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 60000, 45000, 70000, 52000],
    'Years': [3, 4, 2, 5, 3]
})


# Group by Department and calculate mean Salary and total Years
result = df.groupby('Department').agg({
                                        'Salary': 'mean',
                                        'Years': 'sum'
                                    })


result

             Salary  Years
Department
Finance     65000.0      9
HR          49000.0      8


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Explaination</code>

In [2]:

df = pd.DataFrame({
    'Department': ['HR', 'Finance', 'HR', 'Finance', 'HR'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 60000, 45000, 70000, 52000],
    'Years': [3, 4, 2, 5, 3]
})                                                                                     # Example dataset


df

  Department Employee  Salary  Years
0         HR    Alice   50000      3
1    Finance      Bob   60000      4
2         HR  Charlie   45000      2
3    Finance    David   70000      5
4         HR      Eve   52000      3

In [24]:

result = df.groupby('Department').agg({
                                        'Salary': 'mean',
                                        'Years': 'sum'
                                    })


result

             Salary  Years
Department
Finance     65000.0      9
HR          49000.0      8

In [26]:

# Overwriting the column names

result = df.groupby('Department').agg(
                                        Average_Salary = ('Salary', 'mean'),
                                        Total_Years    = ('Years', 'sum')
                                     )


result

            Average_Salary  Total_Years
Department
Finance            65000.0            9
HR                 49000.0            8

<br>

<span style="color: #ffce4b; font-size: 0.4rem;">■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■</span>

<br>


<div style="background-color: #ffecd3; padding-top: 10px; padding-bottom: 1px; margin-left: -5px;">

<span style="font-size: 0.78rem; margin-left: 22px; color: blue;"><strong>Group &nbsp;by &nbsp;Department &nbsp;and &nbsp;Years &nbsp;and &nbsp;count &nbsp;employees</strong></span>

<div style="background-color: white; margin: 21px; padding-top: 14px; padding-bottom: 5px; padding-left: 10px;">

<span style="font-size: 0.8rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: red;">Group &nbsp;by &nbsp;<code>Department</code>&nbsp; and &nbsp;<code>Years</code> &nbsp;and &nbsp;count &nbsp;<code>employees</code></span>

</div>

</div>

<br>

<code style="color: white; background-color: black; font-size: 0.75rem; margin-left: 3px;">Solution</code>

In [3]:

result = df.groupby(['Department', 'Years']).size().reset_index(name='Count')                 # Group by Department and Years and count employees
result

  Department  Years  Count
0    Finance      4      1
1    Finance      5      1
2         HR      2      1
3         HR      3      2


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Explaination</code>

In [6]:

df

  Department Employee  Salary  Years
0         HR    Alice   50000      3
1    Finance      Bob   60000      4
2         HR  Charlie   45000      2
3    Finance    David   70000      5
4         HR      Eve   52000      3

In [5]:

df.groupby(['Department', 'Years']).size()

Department  Years
Finance     4        1
            5        1
HR          2        1
            3        2
dtype: int64

In [7]:

df.groupby(['Department', 'Years']).size().reset_index()

  Department  Years  0
0    Finance      4  1
1    Finance      5  1
2         HR      2  1
3         HR      3  2

In [19]:

df.groupby(['Department', 'Years']).size().reset_index(name='Count')

  Department  Years  Count
0    Finance      4      1
1    Finance      5      1
2         HR      2      1
3         HR      3      2

<br>

<span style="color: #ffce4b; font-size: 0.4rem;">■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■</span>

<br>


<div style="background-color: #ffecd3; padding-top: 10px; padding-bottom: 1px; margin-left: -5px;">

<span style="font-size: 0.78rem; margin-left: 22px; color: blue;"><strong>Filter &nbsp;Groups &nbsp;based &nbsp;on &nbsp;a &nbsp;Condition</strong></span>

<div style="background-color: white; margin: 21px; padding-top: 14px; padding-bottom: 5px; padding-left: 10px;">

<span style="font-size: 0.8rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: red;">Retain &nbsp;only &nbsp;groups &nbsp;where &nbsp;<code>average salary > 55000</code></span>

</div>

</div>

<br>

<code style="color: white; background-color: black; font-size: 0.75rem; margin-left: 3px;">Solution - 1</code> &nbsp;&nbsp;<span style="color: #db72ff; font-size: 0.82rem;">using &nbsp;&nbsp;<code style="background-color: yellow;"><span style="color: #99a3a4;">df.groupby()</span>.filter()</code></code></span>

In [6]:

filtered_df = df.groupby('Department').filter(lambda x: x['Salary'].mean() > 55000)
filtered_df

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5

<br>

<div style="color: #db72ff;">

<pre style="background-color: white; font-size: 0.82rem; color: black;">You may be wondering why <code style="font-size: 0.8rem; padding: 4px; background-color: #fff1bd;"> df.<span style="color: red;">groupby(</span>'Department'<span style="color: red;">)</span>.<span><span style="color: red;">filter(</span>lambda x: x['Salary'].mean() > 55000, <span style="background-color: #ffbbd8;">axis=0/1/None</span><span style="color: red;">)</span> </code> is not working?</pre>
<br>

<pre style="background-color: white; font-size: 0.82rem; color: black;">The <code style="font-size: 0.78rem; background-color: #fff1bd; padding: 2px;">.groupby().filter()</code> operation works by <span style="color: #533cff;">filtering the groups in the DataFrame based on a condition applied to each group</span>. Therefore passing <code style="background-color: #ffbbd8; font-size: 0.82rem;">"axis"</code> as a parameter in the <code style="background-color:  #fff1bd; font-size: 0.78rem; padding: 2px;">.filter()</code> method <span style="color: #ff3af0;">does not make any sense</span> because <u>anyway it's a <span style="color: #533cff;">row-wise filtering</span> which means it's going to filter each <span style="color: #8a01b9;">group dataframe</span> like it's filtering rows</u>. So <code style="background-color: #ffbbd8; font-size: 0.82rem;">axis = 0</code> is self-understood in this case. Therefore no need of mentioning <code style="background-color: #ffbbd8; font-size: 0.82rem;">"axis"</code> explicitly while filtering groups.</pre> <br>


<div style="display: flex;">
<div style="width: calc(100% / 2)">
<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px; padding: 3px; width: 100%"> Default Behavior <span style="background-color: white; color: black; padding: 2px;"> axis = 0 </span>                                                  </code>

- <pre style="background-color: white; font-size: 0.82rem; color: #db72ff;">In the context of <code style="background-color:  #fff1bd; font-size: 0.78rem; padding: 2px;">.groupby().filter()</code> , <code style="background-color: #f7d2ff; font-size: 0.82rem;">axis = 0</code> applies the filtering operation <span style="color: #a604de;"><u>row-wise</u></span> for each group.</pre>
<br>

- <pre style="background-color: white; font-size: 0.82rem; color: #db72ff;">Each group ( <code style="background-color: #f7d2ff;"> x </code> ) passed to the lambda function is treated as a <span style="color: #8a01b9;"><u>sub-DataFrame of rows</u></span> from the original DataFrame.</pre>
<br>

- <pre style="background-color: white; font-size: 0.82rem; color: #db72ff;">The lambda condition ( <code style="background-color: #f7d2ff; font-size: 0.82rem;">x['Salary'].mean() > 55000</code> ) operates on the rows within that group.</pre>
<br>

- <pre style="background-color: white; font-size: 0.82rem; color: #db72ff;">Groups that satisfy the condition retain all their rows in the result.</pre>
<br>

- <pre style="background-color: white; font-size: 0.82rem; color: #db72ff;"><code style="background-color: #f7d2ff; font-size: 0.82rem;">axis = 0</code> ensures the filtering is applied group-wise on rows (not columns).</pre>

</div>

<div style="width: calc(100% / 2); margin-left: 30px;">
<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px; padding: 3px; width: 100%;"> What &nbsp;about &nbsp;<span style="background-color: white; color: black; padding: 2px;"> axis = 1 </span> ?                                                     </code>

- <pre style="background-color: white; font-size: 0.82rem; color: #db72ff;">If you explicitly pass <code style="background-color: #f7d2ff; font-size: 0.82rem;">axis = 1</code> , the filtering would be applied <span style="color: #a604de;"><u>column-wise</u></span>, but this is <span style="color: #ff18d8;">incompatible</span> with <code style="background-color:  #fff1bd; font-size: 0.78rem; padding: 2px;">.groupby()</code> contexts.</pre>
<br>

- <pre style="background-color: white; font-size: 0.82rem; color: #db72ff;">Grouping always partitions rows into subsets, and filtering evaluates these row groups. Since the group itself is a <span style="color: #a604de;"><u>row-oriented subset</u></span> , using <code style="background-color: #f7d2ff; font-size: 0.82rem;">axis = 1</code> in this scenario <span style="color: #ff18d8;">does not make any sense</span>.</pre>

</div>

</div>

</div>


<span style="color: red;">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<br>

<code style="background-color: white; font-size: 0.82rem; color: #db72ff;">Let's try an alternate solution with <code style="background-color: yellow;"><span style="color: #99a3a4;">df.groupby()</span>.apply()</code></code>

In [55]:

df

  Department Employee  Salary  Years
0         HR    Alice   50000      3
1    Finance      Bob   60000      4
2         HR  Charlie   45000      2
3    Finance    David   70000      5
4         HR      Eve   52000      3

In [7]:

df.groupby('Department').apply(lambda x : x['Salary'].mean() > 55000)                          # returns  a  series  with  index  ['Finance', 'HR']

Department
Finance     True
HR         False
dtype: bool


<div style="margin-left: 200px;">

![](../media/pandas_indexing_selecting_filtering_32.PNG)

</div>

In [8]:

df[df.groupby('Department').apply(lambda x : x['Salary'].mean() > 55000)]

C:\Users\user\AppData\Local\Temp\ipykernel_17544\3516884767.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df.groupby('Department').apply(lambda x : x['Salary'].mean() > 55000)]

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

<br>

<div style="color: black; font-size: 0.82rem;">

<span style="font-size: 0.8rem; color: #76448a;">■</span> &nbsp;<span style="font-size: 0.75rem; color: #76448a;"><strong>Why &nbsp;this &nbsp;<u>Index &nbsp;Misalignment</u> &nbsp;error</strong></span>

<div style="margin-left: 42px;">

<pre style="background-color: white; font-size: 0.82rem; color: #db72ff; margin-left: 11px;"><span style="color: #b919ff; font-size: 0.9rem;">➜</span> The result of <code  style="background-color: #fff1bd; padding: 2px;">.apply()</code> has an index of <code  style="background-color: #f9deff;">['Finance', 'HR']</code> , <span style="color: red;"><u><span style="color: #db72ff;">which is not aligned with the original DataFrame's index</span></u></span>.</pre>
<br>

<pre style="background-color: white; font-size: 0.82rem; color: #db72ff; margin-left: 11px;"><span style="color: #b919ff; font-size: 0.9rem;">➜</span> When you attempt to use this boolean Series to filter the original DataFrame :</pre>

<br>

<pre style="background-color: #fff1bd; margin-left: 55px;">
    
  df[boolean_series]
    
</pre>

<br>

<pre style="background-color: white; font-size: 0.82rem; color: #db72ff;"><span style="margin-left: 32px;">Pandas raises an <span style="color: red">error</span> because the indices of the boolean Series do not match the indices of the DataFrame.</span></pre>

<pre style="background-color: white; font-size: 0.82rem; color: #db72ff;"><span style="margin-left: 32px;">The <span style="color: red">error</span> reflects a mismatch between <span style="color: red;"><u><span style="color: #db72ff;">group-based operations</span></u></span> and <span style="color: red;"><u><span style="color: #db72ff;">element-wise indexing</span></u></span>.</span></pre>

</div>

<br>

<span style="font-size: 0.8rem; color: #76448a;">■</span> &nbsp;<span style="font-size: 0.75rem; color: #76448a;"><strong>How &nbsp;to &nbsp;fix &nbsp;it?</strong></span>

<div style="margin-left: 29px;">
    
<pre style="background-color: white; font-size: 0.82rem; color: #db72ff; margin-left: 20px;">To correctly filter rows, you need to <code style="color: blue;"><strong>map</strong></code> the boolean results back to the original DataFrame’s index. <code style="background-color: white; color: #db72ff;">Whenever a <span style="color: red;"><u><span style="color: #db72ff;">group-wise operation</span></u></span> returns a <span style="color: blue;"><strong>Series</strong></span> with <span style="color: red;"><u><span style="color: #db72ff;">group-level indices</span></u></span>, you must either</code> :</pre>

<div style="margin-left: 12px; color: #b919ff;">

- <code style="background-color: #f9deff; font-size: 0.78rem; color: black; padding: 4px;"> Element-wise Alignment             </code>  <code style="background-color: white; font-size: 0.82rem; color: #db72ff;">use methods like <code style="background-color: #fff1bd; padding: 2px;">transform()</code> that inherently align results to the original DataFrame’s index.</code>

- <code style="background-color: #f9deff; font-size: 0.78rem; color: black; padding: 4px;"> Map Results Back to Original Index </code>
  <code style="background-color: white; font-size: 0.82rem; color: #db72ff;">map it back to the original DataFrame using the corresponding column ( e.g., <code style="background-color:  #fff1bd; padding: 2px;">.map()</code> ).</code>

</div>

</div>

</div>

<br>


<code style="color: white; background-color: black; font-size: 0.75rem; margin-left: 3px;">Solution - 2</code> &nbsp;&nbsp;<span style="color: #db72ff; font-size: 0.82rem;">using &nbsp;&nbsp;<code style="background-color: yellow;"><span style="color: #99a3a4;">df.groupby()</span>.transform()</code></code></span>

In [9]:

filtered_df = df[df.groupby('Department')['Salary'].transform('mean') > 55000]
filtered_df

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Explaination</code>

In [81]:

print(df.groupby('Department'))                         # <pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000159FEF9D590>

print(df.groupby('Department')['Salary'])               # <pandas.core.groupby.generic.SeriesGroupBy object at 0x00000159FE9EB690>

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000159FEFA2910>
<pandas.core.groupby.generic.SeriesGroupBy object at 0x00000159FEFA2BD0>

In [76]:

df.groupby('Department')['Salary'].transform('mean')

0    49000.0
1    65000.0
2    49000.0
3    65000.0
4    49000.0
Name: Salary, dtype: float64


<pre style="color: #db72ff; font-size: 0.84rem; margin-top: -1px; margin-left: 80px;">

<code style="background-color: #fff1bd; padding: 2px;"><span style="color: red;">.transform(</span>'mean'<span style="color: red;">)</span></code> computes the group-wise mean but <span style="color: red;"><u><span style="color: #db72ff;">returns a Series aligned with the original DataFrame's index because it operates on groups and broadcasts back to rows</span></u></span>. This allows for direct boolean indexing on the DataFrame.

</pre>

In [77]:

df[df.groupby('Department')['Salary'].transform('mean') > 55000]

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5


<br>

<code style="color: white; background-color: black; font-size: 0.75rem; margin-left: 3px;">Solution - 3</code> &nbsp;&nbsp;<span style="color: #db72ff; font-size: 0.82rem;">using &nbsp;&nbsp;<code style="background-color: yellow;"><span style="color: #99a3a4;">series</span>.map( <span style="color: #99a3a4;">df.groupby()</span> )</code></code></span>

In [4]:

df[df['Department'].map(df.groupby('Department')['Salary'].mean() > 55000)]

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Explaination</code>

<code style="color: #c64dff; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u><strong>Step-1</strong></u></code>

In [27]:

df.groupby('Department')['Salary'].mean()                                               # returns a series  ====>  group wise mean salary

Department
Finance    65000.0
HR         49000.0
Name: Salary, dtype: float64


<code style="color: #c64dff; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u><strong>Step-2</strong></u></code>

In [23]:

df.groupby('Department')['Salary'].mean() > 55000                                       # Filter groups based ona condition
                                                                                        # series-1

Department
Finance     True
HR         False
Name: Salary, dtype: bool


<code style="color: #c64dff; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u><strong>Step-3</strong></u></code>

In [24]:

df['Department']                                                                        # series2

0         HR
1    Finance
2         HR
3    Finance
4         HR
Name: Department, dtype: object


<code style="color: #c64dff; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u><strong>Step-4</strong></u></code>

In [25]:

df['Department'].map(df.groupby('Department')['Salary'].mean() > 55000)                 # index based mapping
                                                                                        # series2.map(series1)

0    False
1     True
2    False
3     True
4    False
Name: Department, dtype: bool


<pre style="color: #db72ff; font-size: 0.84rem; margin-top: -1px; margin-left: 80px;">

<code style="background-color: #fff1bd; padding: 2px;">series2<span style="color: red;">.map(</span>series1<span style="color: red;">)</span></code>  ----->  maps results (<span style="color: red;"><u><span style="color: #db72ff;">series1</span></u></span>) back to the original index (<span style="color: red;"><u><span style="color: #db72ff;">series2</span></u></span>)

</pre>


<code style="color: #c64dff; background-color: white; font-size: 0.82rem; margin-left: -4px;"><u><strong>Step-5</strong></u></code>

In [26]:

df[df['Department'].map(df.groupby('Department')['Salary'].mean() > 55000)]             # df[boolean_series]  --->  filtering rows based on a condition

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5

<br>

<span style="color: #ff6785;">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<br>

<span style="font-size: 0.8rem; color: blue;">As &nbsp;we &nbsp;saw &nbsp;how &nbsp;to &nbsp;filter &nbsp;groups &nbsp;based &nbsp;on &nbsp;a &nbsp;condition, &nbsp;let's &nbsp;see &nbsp;how &nbsp;to &nbsp;<strong>Filter &nbsp;rows &nbsp;based &nbsp;on &nbsp;a &nbsp;Condition</strong></span>

In [3]:
df

  Department Employee  Salary  Years
0         HR    Alice   50000      3
1    Finance      Bob   60000      4
2         HR  Charlie   45000      2
3    Finance    David   70000      5
4         HR      Eve   52000      3


<span style="color: red;"><u>Question-1</u></span> &nbsp;&nbsp;===>&nbsp; <span style="color: #04ca22;">Total earning for each employee</span>

<span style="color: red;"><u>Question-2</u></span> &nbsp;&nbsp;===>&nbsp; <span style="color: #04ca22;">Find employees with total earning greater than 1.5 lakh</span>


<code style="background-color: black; color: white; font-size: 0.8rem;">Solution - 1</code>

In [96]:

df['Salary'] * df['Years']                                                                # Total earning for each employee

0    150000
1    240000
2     90000
3    350000
4    156000
dtype: int64

In [55]:

df['Salary'] * df['Years'] > 150000

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [95]:

df[df['Salary'] * df['Years'] > 150000]                                                   # Find employees with total earning greater than 1.5 lakh

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5
4         HR      Eve   52000      3


<code style="background-color: black; color: white; font-size: 0.8rem;">Solution - 2</code>

In [39]:

df[['Salary', 'Years']]

   Salary  Years
0   50000      3
1   60000      4
2   45000      2
3   70000      5
4   52000      3

In [94]:

df[['Salary', 'Years']].prod(axis=1)                                                      # Total earning for each employee

0    150000
1    240000
2     90000
3    350000
4    156000
dtype: int64

In [49]:

df.apply(lambda row : row[['Salary', 'Years']], axis=1)

   Salary  Years
0   50000      3
1   60000      4
2   45000      2
3   70000      5
4   52000      3

In [51]:

df.apply(lambda row : row[['Salary', 'Years']].prod(), axis=1)

0    150000
1    240000
2     90000
3    350000
4    156000
dtype: int64

In [53]:

df.apply(lambda row : row[['Salary', 'Years']].prod() > 150000, axis=1)

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [97]:

df[df.apply(lambda row : row[['Salary', 'Years']].prod() > 150000, axis=1)]               # Find employees with total earning greater than 1.5 lakh

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5
4         HR      Eve   52000      3


<code style="background-color: black; color: white; font-size: 0.8rem;">Solution - 3</code>

In [90]:

df[df.select_dtypes(include='number').apply(lambda x: x.prod() > 150000, axis=1)]

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5
4         HR      Eve   52000      3

In [91]:

numeric_df = df.select_dtypes(include='number')
boolean_series = numeric_df.apply(lambda x: x.prod() > 150000, axis=1)
filtered_df = df[filtered_series]
filtered_df

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5
4         HR      Eve   52000      3


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Explaination</code>

In [99]:

numeric_df = df.select_dtypes(include='number')
numeric_df

   Salary  Years
0   50000      3
1   60000      4
2   45000      2
3   70000      5
4   52000      3

In [101]:

boolean_series = numeric_df.apply(lambda x: x.prod() > 150000, axis=1)
boolean_series

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [102]:

filtered_df = df[filtered_series]
filtered_df

  Department Employee  Salary  Years
1    Finance      Bob   60000      4
3    Finance    David   70000      5
4         HR      Eve   52000      3

<br>

<span style="color: red;"><strong>When &nbsp;to &nbsp;use &nbsp;which?</strong></span>

- Use &nbsp;<code style="background-color: yellow; font-size: 0.8rem;">.filter()</code>&nbsp; for <u>Label based filtering</u>  &nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp; <span style="color: #a24aff; font-size: 0.8rem;">Use it when your task involves selecting specific columns (or rows by label).</span>

- Use &nbsp;<code style="background-color: yellow; font-size: 0.8rem;">.apply()</code>&nbsp; for <u>Value based filtering</u> &nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp; <span style="color: #a24aff;">Use it when you need to apply custom, row- or column-wise logic to values, especially when labels alone are insufficient.</span>

<br>

<span style="color: #ff6785;">------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------</span>

<br>

<span style="color: blue;"><strong>Aggregation &nbsp;Row-wise &nbsp;& &nbsp;Column-wise</strong></span>

In [118]:

df

  Department Employee  Salary  Years
0         HR    Alice   50000      3
1    Finance      Bob   60000      4
2         HR  Charlie   45000      2
3    Finance    David   70000      5
4         HR      Eve   52000      3

In [106]:

df[['Salary', 'Years']].sum(axis=1)

0    50003
1    60004
2    45002
3    70005
4    52003
dtype: int64

In [105]:

df[['Salary', 'Years']].sum()
df[['Salary', 'Years']].sum(axis=0)

Salary    277000
Years         17
dtype: int64

In [117]:

df[['Salary', 'Years']].sum().T                      # Transforming a series wil result into a series only

Salary    277000
Years         17
dtype: int64

In [110]:

df[['Salary', 'Years']].sum().to_frame()

             0
Salary  277000
Years       17

In [111]:

df[['Salary', 'Years']].sum().to_frame().T

   Salary  Years
0  277000     17


<span style="color: #ffce4b; font-size: 0.4rem;">■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■</span>

<br>

<div style="background-color: #ffecd3; padding-top: 10px; padding-bottom: 1px; margin-left: -5px;">

<span style="font-size: 0.785rem; margin-left: 22px; color: blue;"><strong>Transformations &nbsp;with &nbsp;groupby &nbsp;:</strong> &nbsp;&nbsp;<span style="color: blue">Adding &nbsp;a &nbsp;group-specific &nbsp;column</span></span>

<div style="background-color: white; margin: 21px; padding-top: 14px; padding-bottom: 5px; padding-left: 10px;">

<span style="font-size: 0.8rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: red;">Add &nbsp;a &nbsp;column &nbsp;showing &nbsp;<code>average salary in each department</code></span>

</div>

</div>

<br>

<code style="color: white; background-color: black; font-size: 0.75rem; margin-left: 3px;">Solution</code>

In [5]:

df['Avg_Salary'] = df.groupby('Department')['Salary'].transform('mean')
df

  Department Employee  Salary  Years  Avg_Salary
0         HR    Alice   50000      3     49000.0
1    Finance      Bob   60000      4     65000.0
2         HR  Charlie   45000      2     49000.0
3    Finance    David   70000      5     65000.0
4         HR      Eve   52000      3     49000.0


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Explaination</code>

In [19]:

df = pd.DataFrame({
    'Department': ['HR', 'Finance', 'HR', 'Finance', 'HR'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 60000, 45000, 70000, 52000],
    'Years': [3, 4, 2, 5, 3]
})

df

  Department Employee  Salary  Years
0         HR    Alice   50000      3
1    Finance      Bob   60000      4
2         HR  Charlie   45000      2
3    Finance    David   70000      5
4         HR      Eve   52000      3

In [9]:

df.groupby('Department')

In [6]:

df.groupby('Department')['Salary']

In [15]:

df.groupby('Department')['Salary'].transform('mean')                                           # returns a series

0    49000.0
1    65000.0
2    49000.0
3    65000.0
4    49000.0
Name: Salary, dtype: float64

In [14]:

df['Avg_Salary'] = df.groupby('Department')['Salary'].transform('mean')                        # adds a new column
df

  Department Employee  Salary  Years  Avg_Salary
0         HR    Alice   50000      3     49000.0
1    Finance      Bob   60000      4     65000.0
2         HR  Charlie   45000      2     49000.0
3    Finance    David   70000      5     65000.0
4         HR      Eve   52000      3     49000.0

<br>

<span style="color: #ffce4b; font-size: 0.4rem;">■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■</span>

<br>


<div style="background-color: #ffecd3; padding-top: 10px; padding-bottom: 1px; margin-left: -5px;">

<span style="font-size: 0.785rem; margin-left: 22px; color: blue;"><strong>Custom &nbsp;Aggregation &nbsp;:</strong> &nbsp;Using &nbsp;a &nbsp;custom &nbsp;function &nbsp;in &nbsp;<code style="background-color: yellow;">agg()</code></span>

<div style="background-color: white; margin: 21px; padding-top: 14px; padding-bottom: 5px; padding-left: 10px;">

<span style="font-size: 0.8rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: red;">Find &nbsp;the &nbsp;range &nbsp;of &nbsp;salaries &nbsp;in &nbsp;each &nbsp;department</span>

</div>

</div>

<br>

<code style="color: white; background-color: black; font-size: 0.75rem; margin-left: 3px;">Solution</code>

In [33]:

df.groupby('Department').agg(
                                Salary_Range = ('Salary', lambda x: x.max() - x.min())
                            )

            Salary_Range
Department
Finance            10000
HR                  7000


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Explaination</code>

In [34]:

df = pd.DataFrame({
    'Department': ['HR', 'Finance', 'HR', 'Finance', 'HR'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 60000, 45000, 70000, 52000],
    'Years': [3, 4, 2, 5, 3]
})

df

  Department Employee  Salary  Years
0         HR    Alice   50000      3
1    Finance      Bob   60000      4
2         HR  Charlie   45000      2
3    Finance    David   70000      5
4         HR      Eve   52000      3

In [35]:

df.sort_values(by="Department", ascending=False)

  Department Employee  Salary  Years
0         HR    Alice   50000      3
2         HR  Charlie   45000      2
4         HR      Eve   52000      3
1    Finance      Bob   60000      4
3    Finance    David   70000      5

<div style="margin-left: 180px;">

![](../media/pandas_indexing_selecting_filtering_30.PNG)

</div>

In [36]:

df.groupby('Department').agg(Salary_Range = ('Salary', lambda x: x.max() - x.min()))

            Salary_Range
Department
Finance            10000
HR                  7000


###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>8E. &nbsp;&nbsp;<code style="background-color: yellow;">.groupby()</code></strong></span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<code style="color: blue; background-color: white; font-size: 0.82rem;">Custom Weighted Aggregation</code>



<span style="font-size: 0.8rem; color: red;">■</span> &nbsp;&nbsp;<span style="color: red;">Compute &nbsp;<u>weighted &nbsp;averages</u> &nbsp;using &nbsp;a &nbsp;<u>custom &nbsp;function</u>.</span>

In [72]:

df = pd.DataFrame({
    'Category': ['A', 'A', 'B', 'B', 'C', 'C'],
    'Value': [10, 20, 15, 25, 30, 45],
    'Weight': [1, 2, 3, 4, 5, 6]
})

df

  Category  Value  Weight
0        A     10       1
1        A     20       2
2        B     15       3
3        B     25       4
4        C     30       5
5        C     45       6


<code style="color: white; background-color: black; font-size: 0.75rem; margin-left: 3px;">Solution</code>

In [71]:

def weighted_avg(group):                                                                        # Custom function
    return (group['Value'] * group['Weight']).sum() / group['Weight'].sum()

df.groupby('Category').apply(weighted_avg).rename('Weighted_Avg').reset_index()                 # Custom aggregation   ---->   Weighted average

  Category  Weighted_Avg
0        A     16.666667
1        B     20.714286
2        C     38.181818


<code style="color: white; background-color: #c136fe; font-size: 0.75rem; margin-left: 3px;">Explaination</code>

In [76]:

df = pd.DataFrame({
    'Category': ['A', 'A', 'B', 'B', 'C', 'C'],
    'Value': [10, 20, 15, 25, 30, 45],
    'Weight': [1, 2, 3, 4, 5, 6]
})          


df                                                    # df.sort_values(by="Category")    ------>    to see all the rows of a group together

  Category  Value  Weight
0        A     10       1
1        A     20       2
2        B     15       3
3        B     25       4
4        C     30       5
5        C     45       6

<br>

<div>

![](../media/pandas_indexing_selecting_filtering_31.PNG)

</div>


<code style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: -3px;">Let's take <span style="color: #ff5fee;"><u><strong>group1</strong></u></span> for example :</code>

In [65]:

group1_df = df[df['Category'] == 'A']                                                        # Group - 1
group1_df

  Category  Value  Weight
0        A     10       1
1        A     20       2

In [66]:

group1_df['Value']                                                                           # returns the 'Value' column in group1 as a series

0    10
1    20
Name: Value, dtype: int64

In [67]:

group1_df['Weight']                                                                          # returns the 'Weight' column in group1 as a series

0    1
1    2
Name: Weight, dtype: int64

In [62]:

group1_df['Value'] * group1_df['Weight']                                                     # multiplying two series  ---->  returns a series

0    10
1    40
dtype: int64

In [61]:

(group1_df['Value'] * group1_df['Weight']).sum()                                             # returns the sum of the above series

50

In [60]:

group1_df['Weight'].sum()                                                                    # returns the sum of the weights of the group1 dataframe

3

In [56]:

(group1_df['Value'] * group1_df['Weight']).sum() / group1_df['Weight'].sum()                 # returns the weighted average of the group1 dataframe

16.666666666666668


<code style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: -3px;">Let's summarize the above :</code>

In [68]:

group1_df = df[df['Category'] == 'A']                                                        # Group - 1
(group1_df['Value'] * group1_df['Weight']).sum() / group1_df['Weight'].sum()

16.666666666666668


<code style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: -3px;">Similarly for other groups, we can calculate the weighted average :</code>

In [58]:

group2_df = df[df['Category'] == 'B']                                                        # Group - 2
(group2_df['Value'] * group2_df['Weight']).sum() / group2_df['Weight'].sum()

20.714285714285715

In [59]:

group3_df = df[df['Category'] == 'C']                                                        # Group - 3
(group3_df['Value'] * group3_df['Weight']).sum() / group3_df['Weight'].sum()

38.18181818181818


<pre style="color: #c136fe; background-color: white; font-size: 0.82rem; margin-left: -3px;">Let's now call the custom function <code style="color: red; background-color: white;">weighted_average()</code> for each group using <code style="background-color: yellow;">.groupby().apply()</code></pre>

In [45]:

df.groupby('Category').apply(weighted_avg)

Category
A    16.666667
B    20.714286
C    38.181818
dtype: float64

In [38]:

df.groupby('Category').apply(weighted_avg).rename('Weighted_Avg')

Category
A    16.666667
B    20.714286
C    38.181818
Name: Weighted_Avg, dtype: float64

In [39]:

df.groupby('Category').apply(weighted_avg).rename('Weighted_Avg').reset_index()

  Category  Weighted_Avg
0        A     16.666667
1        B     20.714286
2        C     38.181818



###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>9. &nbsp;&nbsp;<span style="color: red;"><u><span style="color: blue;">Pivot &nbsp;Tables</span></u></span> &nbsp;for &nbsp;Complex &nbsp;Selection</strong></span> &nbsp;&nbsp;<font size="+1">⭐</font>


<code style="color: #c136fe; background-color: white; font-size: 0.8rem; margin-left: -4px;">Use <span style="color: black;"><u>pivot tables</u></span> for reshaping data and filtering.</code>


<span style="font-size: 0.8rem; color: red; margin-left: 1px;">■</span> &nbsp;&nbsp;<span style="color: red;">Filter &nbsp;rows &nbsp;where  &nbsp;<code style="background-color: #ffe8f1;">population > 8.35</code> </span>

In [44]:

# Example dataset
df = pd.DataFrame({
    'City': ['New York', 'New York', 'London', 'London'],
    'Year': [2020, 2021, 2020, 2021],
    'Population': [8.3, 8.4, 9.1, 9.2]
})


# Create a pivot table
pivot = df.pivot(index='Year', columns='City', values='Population')


# Filter years where New York population > 8.35           ---------------->               df[(df['Population'] > 8.35) & (df['City'] == 'New York')]

print(pivot[pivot['New York'] > 8.35])

City  London  New York
Year
2021     9.2       8.4

In [45]:

df = pd.DataFrame({
    'City': ['New York', 'New York', 'London', 'London'],
    'Year': [2020, 2021, 2020, 2021],
    'Population': [8.3, 8.4, 9.1, 9.2]
})


df

       City  Year  Population
0  New York  2020         8.3
1  New York  2021         8.4
2    London  2020         9.1
3    London  2021         9.2

<code>Method-1</code> &nbsp;- without using pivot

In [46]:

df[(df['Population'] > 8.35) & (df['City'] == 'New York')]

       City  Year  Population
1  New York  2021         8.4


<code>Method-1</code> &nbsp;- using pivot

In [31]:

# Create a pivot table
pivot = df.pivot(index='Year', columns='City', values='Population')
pivot

City  London  New York
Year
2020     9.1       8.3
2021     9.2       8.4



###### &nbsp;

<span style="color: blue; font-size: 0.9rem;"><strong>10. &nbsp;&nbsp;crosstab</strong></span>